#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Организации") Тогда
		Организации.ЗагрузитьЗначения(Параметры.Организации);
	КонецЕсли;

	ОбновитьПредставлениеОрганизации(Организации, ОрганизацииПредставление);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организации", ЭтотОбъект.Организации.ВыгрузитьЗначения());
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормаВыбораСпискаОрганизацийИСМП",
		ПараметрыОткрытияФормы,
		ЭтотОбъект,,,,
		Новый ОписаниеОповещения("ПослеЗавершенияВыбораОрганизаций", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	ЭтотОбъект.Организации.Очистить();
	ОбновитьПредставлениеОрганизации(Организации, ОрганизацииПредставление);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ОбновитьПредставлениеОрганизации(Организации, ОрганизацииПредставление);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьВходящиеДокументы(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Организация",   ИнтеграцияИСМПКлиент.ОрганизацииДляОбмена(ЭтотОбъект));
		ПараметрыОтбора.Вставить("НачалоПериода", НачалоПериода);
		ПараметрыОтбора.Вставить("КонецПериода",  КонецПериода);
		
		Закрыть(ПараметрыОтбора);
		
	Иначе
		
		Закрыть(Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеОрганизации(Организации, ОрганизацииПредставление)
	ОрганизацииПредставление = Строка(Организации);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияВыбораОрганизаций(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Организации.ЗагрузитьЗначения(Результат.Организации);
		ОбновитьПредставлениеОрганизации(Организации, ОрганизацииПредставление);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
