
&НаКлиенте
Процедура РеестрОбъектовАренды(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "РеестрОбъектов");
	
	Идентификатор = "РеестрОбъектов";
	ОткрытьФорму("Отчет.АР_РеестрОбъектовАренды.Форма", ПараметрыФормы,,Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрДоговоровАренды(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "РеестрДоговоров");
	
	Идентификатор = "РеестрДоговоров";
	ОткрытьФорму("Отчет.АР_РеестрОбъектовАренды.Форма", ПараметрыФормы,,Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗанятостьПлощадей(Команда)
	
	ОткрытьФорму("Отчет.АР_ЗанятостьПлощадей.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОбъектовАренды(Команда)
	
	ОткрытьФорму("Отчет.АР_ИсторияОбъектовАренды.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоНачислениямИВыплатам(Команда)
	
	ОткрытьФорму("Отчет.АР_ОтчетПоНачислениямИВыплатамАренднойПлаты.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПоАренде(Команда)
	
	ОткрытьФорму("Отчет.АР_ПродажиПоАренде.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасходыНаОплатуКоммунальныхУслуг(Команда)
	
	ОткрытьФорму("Отчет.АР_РасходыНаОплатуКомУслуг.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АнализЭффективностиИспользованияПлощадей(Команда)
	
	ОткрытьФорму("Отчет.АР_АнализЭффективностиИспользованияПлощадей.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрЗаявокНаЭксплуатацию(Команда)
	
	ОткрытьФорму("Отчет.АР_РеестрЗаявокНаОбслуживание.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОРасходахНаЭксплуатацию(Команда)
	
	ОткрытьФорму("Отчет.АР_СведенияОРасходахНаЭксплуатацию.Форма",,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АнализЗадержекПлатежейПоАренде(Команда)
	
	ОткрытьФорму("Отчет.АР_АнализЗадержекПлатежейПоАренде.Форма",,, Истина);
	
КонецПроцедуры















