
// Функция возвращает данные расписания
Функция ПолучитьРасписание() Экспорт
	
	Возврат Расписание.Получить();
	
КонецФункции

// Функция помещает данные расписания во временное хранилище
// и возвращает ссылку во временном хранишище
Функция УстановитьРасписание(РасписаниеОткрытое, УникальныйИдентификатор) Экспорт
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(РасписаниеОткрытое), УникальныйИдентификатор);
	Возврат Адрес;
	
КонецФункции

// Процедура получает расписание из временного хранилища
// и установливает его в соответствующий реквизит
Процедура ЗаписатьРасписание(Адрес) Экспорт
	
	Расписание = ПолучитьИзВременногоХранилища(Адрес);	
	
КонецПроцедуры

