#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ИсточникПоИдентификатору(ИдентификаторЗадания) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредставлениеЗаданийРаспознаваниеДокументов.Источник КАК Источник
		|ИЗ
		|	РегистрСведений.ПредставлениеЗаданийРаспознаваниеДокументов КАК ПредставлениеЗаданийРаспознаваниеДокументов
		|ГДЕ
		|	ПредставлениеЗаданийРаспознаваниеДокументов.ИдентификаторЗадания = &ИдентификаторЗадания";
	
	Запрос.УстановитьПараметр("ИдентификаторЗадания", ИдентификаторЗадания);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Перечисления.ИсточникиПолученияФайлов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Источник;
	
КонецФункции

#КонецОбласти

#КонецЕсли
