#Область ПрограммныйИнтерфейс

Процедура СертификатСоответствуетОтборуПриПодбореДляОрганизации(Сертификат, ПараметрыОтбора, Результат) Экспорт
	
	// Обязательные параметры Сервис, Организация.
	Если ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит") Тогда
		ЗаявкиНаКредитКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	ИначеЕсли ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ФинансоваяОтчетность") Тогда
		ФинОтчетностьВБанкиКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура СертификатСоответствуетОтборуПриВыводеСтроки(Сертификат, ПараметрыОтбора, Результат) Экспорт
	
	// Обязательные параметры Сервис, Организация.
	Если ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит") Тогда
		ЗаявкиНаКредитКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	ИначеЕсли ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ФинансоваяОтчетность") Тогда
		ФинОтчетностьВБанкиКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура СертификатСоответствуетОтборуПриВыбореСертификата(Сертификат, ПараметрыОтбора, Результат) Экспорт
	
	// Обязательные параметры Сервис, Организация.
	Если ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит") Тогда
		ЗаявкиНаКредитКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	ИначеЕсли ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ФинансоваяОтчетность") Тогда
		ФинОтчетностьВБанкиКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура СертификатСоответствуетОтборуПередКриптооперацией(Сертификат, ПараметрыОтбора, Результат) Экспорт
	
	// Обязательные параметры Сервис, Организация.
	Если ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ЗаявкиНаКредит") Тогда
		ЗаявкиНаКредитКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	ИначеЕсли ПараметрыОтбора.Сервис = ПредопределенноеЗначение("Перечисление.СервисыОбменаСБанками.ФинансоваяОтчетность") Тогда
		ФинОтчетностьВБанкиКлиентСервер.СертификатСоответствуетОтбору(Сертификат, ПараметрыОтбора, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
