
Функция Печать() Экспорт

ТабДок = Новый ТабличныйДокумент;
ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заборная_ведомость";
Макет = ПолучитьМакет("ЗаборнаяВедомость");

ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
ОбластьШапки = Макет.ПолучитьОбласть("ШапкаТаблицы");
ОбластьСтроки = Макет.ПолучитьОбласть("СтрокаТаблицы");
ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");

ОбластьЗаголовок.Параметры.Марка = Автомобиль.Марка;
ОбластьЗаголовок.Параметры.ГосНомер = Автомобиль.ГосНомер;
ОбластьЗаголовок.Параметры.НачПериода = Формат(НачПериода, "ДФ=dd.MM.yyyy");
ОбластьЗаголовок.Параметры.КонПериода = Формат(КонПериода, "ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОбластьЗаголовок);
ТабДок.Вывести(ОбластьШапки);

Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	ТребованиеНакладнаяМатериалы.Ссылка.ПодразделениеЗатрат КАК Автомобиль,
|	ТребованиеНакладнаяМатериалы.Номенклатура,
|	ТребованиеНакладнаяМатериалы.Количество
|ИЗ
|	Документ.ТребованиеНакладная.Материалы КАК ТребованиеНакладнаяМатериалы
|ГДЕ
|	ТребованиеНакладнаяМатериалы.Ссылка.Проведен
|	И ТребованиеНакладнаяМатериалы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
|	И ТребованиеНакладнаяМатериалы.ПодразделениеЗатрат = &Автомобиль
| " + ?(ПростоеСписание=Истина,"И ТребованиеНакладнаяМатериалы.Ссылка.ПростоеСписание = &ПростоеСписание","");
Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
Запрос.УстановитьПараметр("ПростоеСписание", ПростоеСписание);
Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(НачПериода));
Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(КонПериода));

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Номер = 0;

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Номер = Номер+1;
	ОбластьСтроки.Параметры.Номер = Номер;
	ОбластьСтроки.Параметры.Наименование = ВыборкаДетальныеЗаписи.Номенклатура;
	ОбластьСтроки.Параметры.Количество = ВыборкаДетальныеЗаписи.Количество;
	ТабДок.Вывести(ОбластьСтроки);
КонецЦикла;

ТабДок.Вывести(ОбластьПодвала);


ТабДок.ТолькоПросмотр 		= Истина;
ТабДок.ОтображатьСетку		= Ложь;
ТабДок.ОтображатьЗаголовки 	= Ложь;
ТабДок.АвтоМасштаб=Истина;
ТабДок.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
ТабДок.Показать();
КонецФункции