
Процедура ПроведениеПлатежекОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда
	Если Источник.ДокументОснование.СуммаПлатежа <>  Источник.СуммаДокумента   Тогда 
		Сообщить("Сумма документа основания и платежки не совпадают!!!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	Если Источник.ДокументОснование.Контрагент <>  Источник.Контрагент   Тогда 
		Сообщить("Контрагент основания и платежки не совпадают!!!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	Если Источник.ДокументОснование.ДоговорКонтрагента <>  Источник.ДоговорКонтрагента   Тогда 
		Сообщить("Договор основания и платежки не совпадают!!!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроведениеПеремещенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если не Отказ Тогда 
		движение = Источник.движения.Хозрасчетный
	КонецЕсли;
	
КонецПроцедуры
