
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("УслугаАренда"));
	Если ЗначениеПараметра <> Неопределено Тогда	
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение = Константы.АР_ОсновнаяУслугаПоАренде.Получить();
	КонецЕсли;
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	Если ЗначениеПараметра <> Неопределено Тогда	
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение = НачалоПериода;
	КонецЕсли;	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	Если ЗначениеПараметра <> Неопределено Тогда	
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение = ?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), ТекущаяДата());
	КонецЕсли;	
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Строка(ЭлементОтбора.ЛевоеЗначение) = "Организация" Тогда
			ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОрганизацияПарам"));
			Если ЗначениеПараметра <> Неопределено Тогда	
				ЗначениеПараметра.Использование = ЭлементОтбора.Использование;
				ЗначениеПараметра.Значение = ЭлементОтбора.ПравоеЗначение;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УслугаАренды = Константы.АР_ОсновнаяУслугаПоАренде.Получить();
	Если Не ЗначениеЗаполнено(УслугаАренды) Тогда
		ТекстСообщения = НСтр("ru = 'В параметрах управления недвижимостью не заполнена константа ""Основная услуга по аренде"", которая используется для расчета финансовых потерь'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОбъектыНедвижимости.КатегорияЦен
		|ПОМЕСТИТЬ ВТКатегории
		|ИЗ
		|	Справочник.АР_ОбъектыАренды КАК ОбъектыНедвижимости
		|ГДЕ
		|	ОбъектыНедвижимости.КатегорияЦен <> ЗНАЧЕНИЕ(Справочник.АР_КатегорииЦенАренды.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКатегории.КатегорияЦен,
		|	ЦеныНаАрендуСрезПоследних.Ставка
		|ИЗ
		|	ВТКатегории КАК ВТКатегории
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ЦеныНаАренду.СрезПоследних(, Услуга = &УслугаАренды) КАК ЦеныНаАрендуСрезПоследних
		|		ПО ВТКатегории.КатегорияЦен = ЦеныНаАрендуСрезПоследних.КатегорияЦен";
		Запрос.УстановитьПараметр("УслугаАренды", УслугаАренды);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Ставка) Тогда
				ТекстСообщения = НСтр("ru = 'Для категории цен" + Выборка.КатегорияЦен + " не установлена цена на услугу " + УслугаАренды + ". Расчет финансовых потерь по объектам с данной категорией не выполнен'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
