Функция ВидДоходовРасходовУчитывается(ВидДоходовРасходов) Экспорт
	
	Возврат Не НалоговыйУчет.ЗапрещеноОтражатьСуммыНалоговогоУчетаПоСтатьямПрочихРасходов(ВидДоходовРасходов);
	
КонецФункции

Функция СтатьяЗатратУчитывается(СтатьяЗатрат) Экспорт

	Если НЕ ЗначениеЗаполнено(СтатьяЗатрат) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтатьяЗатрат.ЭтоГруппа Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтатьяЗатрат.ВидДеятельностиДляНалоговогоУчетаЗатрат <> Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат СтатьяЗатрат.ВидРасходовНУ <> Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения;
	
КонецФункции
