
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СобственникКУдалению = ТекущиеДанные.Собственник;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	УдалитьСобственника(СобственникКУдалению);
	
	Оповестить("ЗаписьСобственника");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УдалитьСобственника(СобственникКУдалению)
	
	СобственникОбъект = СобственникКУдалению.ПолучитьОбъект();
	СобственникОбъект.ПометкаУдаления = Истина;
	СобственникОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти
