Перем СоответсвиеВариантовГруппировке, СоответсвиеВариантовНомеруСортировки, СписокОтчетов; 
Перем ПараметрыВызова, СтрокаФиксированнаяГруппировка, ТаблицаВариантов;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Подсистемы           = Параметры.Подсистемы;
	ИмяФормыОтчетов      = Параметры.ИмяФормы;
	КартинкаФормы        = Параметры.КартинкаФормы;
	ГруппироватьВарианты = истина;
    	
	Заголовок = Параметры.ИмяФормы;
	Если Параметры.КартинкаФормы <> "" тогда 
		Элементы.КартинкаОтчета.Картинка = БиблиотекаКартинок[Параметры.КартинкаФормы];
		Элементы.КартинкаОтчета.Видимость = истина;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.Подсистемы) = Тип("СписокЗначений") тогда
		ПутиПодсистемы = Параметры.Подсистемы;
	Иначе
		ПутиПодсистемы = Новый СписокЗначений;
		ПутиПодсистемы.Добавить(Параметры.Подсистемы);
	КонецЕсли;
	
	НарисоватьПанель(Отказ);
	
КонецПроцедуры           

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПолучитьСписокСправочников(Группа)
	
	СписокСправочников = Новый СписокЗначений;
	
	Если Группа = "ОбъектыНедвижимости" Тогда
		СписокСправочников.Добавить("АР_КатегорииЗемель");
		СписокСправочников.Добавить("АР_КатегорииЦенАренды");
		СписокСправочников.Добавить("АР_НазначенияОбъектовНедвижимости");
		СписокСправочников.Добавить("АР_ТипыОбъектовАренды");
	КонецЕсли;

	Для Каждого Элемент Из СписокСправочников Цикл
		Элемент.Представление = Метаданные.Справочники[Элемент.Значение].Синоним;
	КонецЦикла;
	
	Возврат СписокСправочников;
	
КонецФункции

&НаСервере
Процедура НарисоватьПанель(Отказ = ложь)
	
	МассивЭлементов = Новый Массив;

	Для каждого ЭлементГруппыСсылка из Элементы.ГруппаОсновная.ПодчиненныеЭлементы Цикл
		Если ЭлементГруппыСсылка.Имя = "КартинкаОтчета" тогда
			Продолжить;
		КонецЕсли;
		МассивЭлементов.Добавить(ЭлементГруппыСсылка);
	КонецЦикла;
	
	Для каждого ЭлементГруппыСсылка из МассивЭлементов Цикл
		Элементы.Удалить(ЭлементГруппыСсылка);		
	КонецЦикла;
	
	МассивКоманд = Новый Массив;
	
	Для каждого Команда из Команды Цикл
		МассивКоманд.Добавить(Команда);
	КонецЦикла;
	
	Для каждого Команда из МассивКоманд Цикл
		Команды.Удалить(Команда);
	КонецЦикла;
	
	//Подсистемы = Неопределено;
	
	СписокГрупп = Новый СписокЗначений;
	СписокГрупп.Добавить("ОбъектыНедвижимости", "Объекты недвижимости");
	
	Элементы.ГруппаОсновная.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Для Каждого Элемент Из СписокГрупп Цикл
		
		ИмяГруппировки = Элемент.Значение;
		СписокСправочников = ПолучитьСписокСправочников(ИмяГруппировки);
		
		Группа = ДобавитьГруппу(ИмяГруппировки, Элементы.ГруппаОсновная, Элемент.Представление, Истина);
		
		Колонка1 = ДобавитьГруппу(ИмяГруппировки + "Колонки1", Группа, "Первая колонка", , ложь);
		Колонка2 = ДобавитьГруппу(ИмяГруппировки + "Колонки2", Группа, "Вторая колонка", , ложь);
		Колонка3 = ДобавитьГруппу(ИмяГруппировки + "Колонки3", Группа, "Третья колонка", , ложь);
		
		КоличетвоВариантов = СписокСправочников.Количество();
		
		МинимальноКолВоВариантов = Цел(КоличетвоВариантов/3);
		Остаток                  = КоличетвоВариантов - МинимальноКолВоВариантов*3;
		
		КоличествоВариантовВКолонке1 = МинимальноКолВоВариантов + ?(Остаток >= 1, 1, 0);
		КоличествоВариантовВКолонке2 = МинимальноКолВоВариантов + ?(Остаток >= 2, 1, 0);
		КоличествоВариантовВКолонке3 = МинимальноКолВоВариантов;
		
		Для Сч = 0 по КоличествоВариантовВКолонке1-1 Цикл
			СтрокаСсылки = СписокСправочников[Сч];
			ДобавитьСсылкуНаСправочник(СтрокаСсылки.Значение, СтрокаСсылки.Представление,  СтрокаСсылки.Представление, Колонка1, Истина);
		КонецЦикла;
		
		Для Сч = КоличествоВариантовВКолонке1 по КоличествоВариантовВКолонке1 + КоличествоВариантовВКолонке2-1 Цикл
			СтрокаСсылки = СписокСправочников[Сч];
			ДобавитьСсылкуНаСправочник(СтрокаСсылки.Значение, СтрокаСсылки.Представление,  СтрокаСсылки.Представление, Колонка2, Истина);
		КонецЦикла;
		
		Для Сч = КоличествоВариантовВКолонке1 + КоличествоВариантовВКолонке2 по КоличествоВариантовВКолонке1 + КоличествоВариантовВКолонке2 + КоличествоВариантовВКолонке3-1 Цикл
			СтрокаСсылки = СписокСправочников[Сч];
			ДобавитьСсылкуНаСправочник(СтрокаСсылки.Значение, СтрокаСсылки.Представление,  СтрокаСсылки.Представление, Колонка3, Истина);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры           

&НаСервере
Функция ДобавитьГруппу(Имя, Родитель, Заголовок = "", Горизонтально = ложь, ОтображатьЗаголовок = истина)
	
	Группа = Элементы.Добавить(Имя, Тип("ГруппаФормы"), Родитель);
	Группа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Заголовок           = Заголовок;
	Группа.ОтображатьЗаголовок = ОтображатьЗаголовок;
	Если Группа.ОтображатьЗаголовок тогда
		Группа.ШрифтЗаголовка = Новый Шрифт(Группа.ШрифтЗаголовка, , , истина);
	КонецЕсли;
	Группа.Отображение         = ОтображениеОбычнойГруппы.СлабоеВыделение;
	Группа.Группировка         = ?(Горизонтально, ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	Группа.РастягиватьПоГоризонтали = Истина;
	
	Возврат Группа;
КонецФункции

&НаСервере
Процедура ДобавитьСсылкуНаСправочник(Ключ, Представление, Описание, Родитель, Видимость)
	
	НоваяКоманда = Команды.Добавить(Ключ);
	НоваяКоманда.Действие = "ОткрытьСправочник";
	НоваяКоманда.Подсказка = Описание;
		
	НоваяКнопка = Элементы.Добавить(Ключ, Тип("КнопкаФормы"), Родитель);
	НоваяКнопка.Заголовок  = Представление;
	НоваяКнопка.ИмяКоманды = Ключ;
	НоваяКнопка.Вид        = ВидКнопкиФормы.Гиперссылка;
	НоваяКнопка.Видимость  = Видимость;
	
Конецпроцедуры

&НаКлиенте             
Процедура ОткрытьСправочник(Команда)
	
	ИмяСправочника = Команда.Имя;
	ОткрытьФорму("Справочник." + ИмяСправочника + ".ФормаСписка", , , );
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьПанельОтчетов" тогда
		НарисоватьПанель();
	КонецЕсли;
	
КонецПроцедуры
