
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ДокументВладелец;
	
	Параметры.Свойство("ДокументВладелец", ДокументВладелец);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Объект.Документ <> ДокументВладелец Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
	Иначе
		Объект.Наименование = "Список счетчиков";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_СписокСчетчиков", Новый Структура("Документ, СписокСчетчиков", Объект.Документ, Объект.Ссылка));
	
КонецПроцедуры

#КонецОбласти
