
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьФункциональныеОпцииФормы();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ФормироватьРезервОтпусковНУ",
		"Видимость",
		ПолучитьФункциональнуюОпцию("ПлательщикНалогаНаПрибыль",
			Новый Структура("Организация", Запись.Организация)));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ПараметрыФО = Новый Структура("Организация, Период", Запись.Организация, НачалоДня(Запись.Период));
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры
