
Процедура ОбновитьДанныеПриПереходеС20() Экспорт
	
	Если ЗначениеЗаполнено(ТипДокумента) Тогда // уже обновляли
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УдалитьДокумент) Тогда
		ТипДокумента = Перечисления.АР_ТипыДокументовПечатныхФорм[СокрЛП(УдалитьДокумент)];
	КонецЕсли;
	Если ЗначениеЗаполнено(УдалитьШаблон) Тогда
		Если ЗначениеЗаполнено(УдалитьШаблон.Хранилище) Тогда
			Хранилище = Новый ХранилищеЗначения(УдалитьШаблон.Хранилище.Получить());
		КонецЕсли;
		ИмяФайла = УдалитьШаблон.ИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

