
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НапоминаниеВ1С И Не ОтправкаНаEmail Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан способ оповещения",, "Объект.НапоминаниеВ1С",, Отказ);
	КонецЕсли;
	
	Если ОтправкаНаEmail Тогда
		ДоступныеУчетныеЗаписи = АР_ОбщиеПроцедуры.ДоступныеУчетныеЗаписи();
		Если ДоступныеУчетныеЗаписи.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Не обнаружены доступные учетные записи электронной почты, обратитесь к администратору системы.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		Для каждого СтрокаПолучатель Из Получатели Цикл
			Если ТипЗнч(СтрокаПолучатель.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
				АдресПолучателя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СтрокаПолучатель.Пользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя);
				Если Не ЗначениеЗаполнено(АдресПолучателя) Тогда
					ТекстСообщения = НСтр("ru = 'У пользователя " + СтрокаПолучатель.Пользователь + " не указан адрес электронной почты.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, СтрокаПолучатель.Пользователь,,, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

