#Область ОбработчикиСобытий

&НаКлиенте
Процедура СтраницаМобильноеПриложениеAndroid(Команда)
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.e1c.MobileAccounting";
		
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаМобильноеПриложениеiOS(Команда)
	
	АдресСтраницы = "https://apps.apple.com/ru/app/%D0%BC%D0%BE%D0%B1%D0%B8%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F-%D0%B1%D1%83%D1%85%D0%B3%D0%B0%D0%BB%D1%82%D0%B5%D1%80%D0%B8%D1%8F-%D0%B8%D0%BF-%D0%B8-%D0%BE%D0%BE%D0%BE/id1210606612";
		
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

#КонецОбласти 

