#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура предназначена для проверки статуса объекта аренды (объект должен быть свободным в течение
// всего срока аренды)
Процедура ПроверитьСтатусыОбъектовАренды(ИмяТабличнойЧасти, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ИмяСписка = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть";
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ЭтотОбъект[ИмяТабличнойЧасти].Выгрузить());
	Запрос.Выполнить();
	
	Запрос.УстановитьПараметр("Период", Новый Граница(Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	// Проверим, что нет повторяющихся пар объект аренды и услуга     
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТТабличнаяЧасть.ОбъектАренды КАК ОбъектАренды,
	|	ВЫБОР
	|		КОГДА ВТТабличнаяЧасть.Услуга.АР_УслугаАренды
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ ВТТабличнаяЧасть.Услуга
	|	КОНЕЦ КАК Услуга,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	ВТТабличнаяЧасть КАК ВТТабличнаяЧасть
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТабличнаяЧасть.ОбъектАренды,
	|	ВЫБОР
	|		КОГДА ВТТабличнаяЧасть.Услуга.АР_УслугаАренды
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|		ИНАЧЕ ВТТабличнаяЧасть.Услуга
	|	КОНЕЦ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 1 Тогда
			Если ЗначениеЗаполнено(Выборка.Услуга) Тогда
				ТекстСообщения = НСтр("ru = 'Для объекта аренды """ + Выборка.ОбъектАренды + """ с услугой """ + Выборка.Услуга + """ имеются повторяющиеся строки'");
			Иначе
				ТекстСообщения = НСтр("ru = 'Для объекта аренды """ + Выборка.ОбъектАренды + """ выбрано несколько услуг по аренде недвижимости'");
			КонецЕсли;
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Список", "Корректность",
			,, ИмяСписка, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			ИмяТабличнойЧасти, "Объект", Отказ);
		КонецЕсли;   		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	       
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды.НеКонтролироватьЗанятость КАК НеКонтролироватьЗанятость,
	|	ВЫБОР
	|		КОГДА АР_СтатусыОбъектовАрендыСрезПоследних.Услуга.АР_УслугаАренды
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ АР_СтатусыОбъектовАрендыСрезПоследних.Услуга
	|	КОНЕЦ КАК Услуга,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Статус,
	|	АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.НомерСтроки,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды КАК ДатаНачала,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды КАК ДатаОкончания,
	|	АР_СтатусыОбъектовАрендыСрезПоследних.ЗаключениеДоговора
	|ИЗ
	|	ВТТабличнаяЧасть КАК АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(&Период, ) КАК АР_СтатусыОбъектовАрендыСрезПоследних
	|		ПО АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ОбъектАренды = АР_СтатусыОбъектовАрендыСрезПоследних.ОбъектАренды
	|			И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаНачалаАренды <= АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды)
	|			И (АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.ДатаОкончанияАренды >= АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды)
	|			И (АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга = АР_СтатусыОбъектовАрендыСрезПоследних.Услуга
	|				ИЛИ АР_СтатусыОбъектовАрендыСрезПоследних.Услуга = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИЛИ (АР_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга.АР_УслугаАренды
	|					И АР_СтатусыОбъектовАрендыСрезПоследних.Услуга.АР_УслугаАренды))
	|ГДЕ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Регистратор <> &Регистратор";
	                                
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Префикс = ИмяТабличнойЧасти + "[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		Если ЗначениеЗаполнено(Выборка.Услуга) ИЛИ Выборка.Услуга = Неопределено Тогда // Объект в аренде
			Если Не Выборка.НеКонтролироватьЗанятость Тогда
				Если ЗначениеЗаполнено(Выборка.Услуга) Тогда
					ТекстСообщения = НСтр("ru = 'Услуга """ + Выборка.Услуга + """ по объекту """ + Выборка.ОбъектАренды.Наименование + 
					""" с " + Формат(Выборка.ДатаНачала, "ДФ = дд.ММ.гггг") +
					" по " + Формат(Выборка.ДатаОкончания, "ДФ = дд.ММ.гггг")+ " имеет статус """ + Выборка.Статус + """" + ".
					|Заключение договора невозможно'");
				Иначе
					ТекстСообщения = НСтр("ru = 'По объекту """ + Выборка.ОбъектАренды.Наименование + 
					""" площади сданы в аренду с " + Формат(Выборка.ДатаНачала, "ДФ = дд.ММ.гггг") +
					" по " + Формат(Выборка.ДатаОкончания, "ДФ = дд.ММ.гггг")+ ".
					|Заключение договора невозможно'");
				КонецЕсли;
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
				Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "Услуга";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		Иначе // У объекта другой статус
			ТекстСообщения = НСтр("ru = 'Объект """ + Выборка.ОбъектАренды.Наименование + 
			""" с " + Формат(Выборка.ДатаНачала, "ДФ = дд.ММ.гггг") +
			" по "+ Формат(Выборка.ДатаОкончания, "ДФ = дд.ММ.гггг")+ " имеет статус """ + Выборка.Статус + """" + "
			|Для изменения статуса необходимо установить соответстующую дату окончания в документе """ + Выборка.ЗаключениеДоговора + """'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Объект аренды'"),
			Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "ОбъектАренды";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;    
		
КонецПроцедуры

Процедура ПроверитьПризнакСдачиВАренду(ИмяТабличнойЧасти, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ИмяСписка = ЭтотОбъект.Метаданные().ТабличныеЧасти[ИмяТабличнойЧасти].Представление();    
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.НомерСтроки,
	|	ТабличнаяЧасть.ОбъектАренды
	|ПОМЕСТИТЬ ВТТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабличнаяЧасть.НомерСтроки,
	|	ТабличнаяЧасть.ОбъектАренды,
	|	ЕСТЬNULL(ОбъектыПодлежащиеСдачеВАренду.ПодлежитСдачеВАренду, ЛОЖЬ) КАК ПодлежитСдачеВАренду
	|ИЗ
	|	ВТТабличнаяЧасть КАК ТабличнаяЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_ОбъектыПодлежащиеСдачеВАренду.СрезПоследних(&Период, ) КАК ОбъектыПодлежащиеСдачеВАренду
	|		ПО ТабличнаяЧасть.ОбъектАренды = ОбъектыПодлежащиеСдачеВАренду.ОбъектАренды
	|ГДЕ
	|	НЕ ЕСТЬNULL(ОбъектыПодлежащиеСдачеВАренду.ПодлежитСдачеВАренду, ЛОЖЬ)";

	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ЭтотОбъект[ИмяТабличнойЧасти].Выгрузить());
	                                
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Префикс = ИмяТабличнойЧасти + "[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		ТекстСообщения = НСтр("ru = 'Для объекта недвижимости """ + Выборка.ОбъектАренды.Наименование + """ на дату " + Формат(Дата, "ДФ=dd.MM.yyyy") + 
		" не установлен признак ""Объект подлежит сдаче в аренду""'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Объект аренды'"),
		Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
		Поле = Префикс + "ОбъектАренды";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
	КонецЦикла;    
		
КонецПроцедуры

Процедура ПроверитьПлощадьОбъектовАренды(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МоментВремени", Новый МоментВремени(Дата, Ссылка));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПостояннаяЧасть", ПостояннаяЧастьАренднойПлаты.Выгрузить());
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	
	// Проверим, что нет повторяющихся пар объект аренды и услуга     
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПостояннаяЧастьАренднойПлаты.НомерСтроки,
	|	ВЫРАЗИТЬ(ПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК Справочник.АР_ОбъектыАренды) КАК ОбъектАренды,
	|	ПостояннаяЧастьАренднойПлаты.Количество,
	|	ПостояннаяЧастьАренднойПлаты.Услуга,
	|	ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
	|	ПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды,
	|	&Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТПостояннаяЧасть
	|ИЗ
	|	&ПостояннаяЧасть КАК ПостояннаяЧастьАренднойПлаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПостояннаяЧастьАренднойПлаты.НомерСтроки КАК НомерСтроки,
	|	ПостояннаяЧастьАренднойПлаты.ОбъектАренды КАК ОбъектАренды,
	|	ПостояннаяЧастьАренднойПлаты.Количество КАК ПлощадьПоТекущемуДокументу,
	|	ЕСТЬNULL(Ставки.Площадь, 0) КАК ПлощадьПоДокументам,
	|	ПостояннаяЧастьАренднойПлаты.ОбъектАренды.ЗначениеХарактеристики КАК Площадь
	|ИЗ
	|	ВТПостояннаяЧасть КАК ПостояннаяЧастьАренднойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(
	|				&МоментВремени,
	|				Услуга.АР_УслугаАренды
	|					И ЗаключениеДоговора <> &Ссылка) КАК СтатусыОбъектовАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АР_Ставки.СрезПоследних(
	|					&МоментВремени,
	|					СрокДействия >= &ДатаСреза
	|						ИЛИ СрокДействия = ДАТАВРЕМЯ(1, 1, 1)) КАК Ставки
	|			ПО СтатусыОбъектовАренды.Договор = Ставки.Договор
	|				И СтатусыОбъектовАренды.ОбъектАренды = Ставки.ОбъектАренды
	|				И СтатусыОбъектовАренды.Услуга = Ставки.Услуга
	|		ПО ПостояннаяЧастьАренднойПлаты.ОбъектАренды = СтатусыОбъектовАренды.ОбъектАренды
	|			И (ВЫБОР
	|				КОГДА ПостояннаяЧастьАренднойПлаты.Ссылка.Дата > ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	|					ТОГДА ПостояннаяЧастьАренднойПлаты.Ссылка.Дата
	|				ИНАЧЕ ПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды
	|			КОНЕЦ <= СтатусыОбъектовАренды.ДатаОкончанияАренды)
	|			И (ПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= ВЫБОР
	|				КОГДА НАЧАЛОПЕРИОДА(СтатусыОбъектовАренды.Регистратор.Дата, ДЕНЬ) >= СтатусыОбъектовАренды.ДатаНачалаАренды
	|					ТОГДА НАЧАЛОПЕРИОДА(СтатусыОбъектовАренды.Регистратор.Дата, ДЕНЬ)
	|				ИНАЧЕ СтатусыОбъектовАренды.ДатаНачалаАренды
	|			КОНЕЦ)
	|ГДЕ
	|	ПостояннаяЧастьАренднойПлаты.Услуга.АР_УслугаАренды
	|	И НЕ ПостояннаяЧастьАренднойПлаты.ОбъектАренды.НеКонтролироватьПлощадь
	|ИТОГИ
	|	МАКСИМУМ(НомерСтроки),
	|	МАКСИМУМ(ПлощадьПоТекущемуДокументу),
	|	СУММА(ПлощадьПоДокументам),
	|	МАКСИМУМ(Площадь)
	|ПО
	|	ОбъектАренды";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ИмяСписка = "Постоянная часть арендной платы";
	Пока Выборка.Следующий() Цикл
		Префикс = "ПостояннаяЧастьАренднойПлаты[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		Если Выборка.Площадь < Выборка.ПлощадьПоДокументам + Выборка.ПлощадьПоТекущемуДокументу Тогда
			ТекстСообщения = НСтр("ru = 'Для объекта аренды """ + Выборка.ОбъектАренды + """ сдаваемая площадь с учетом текущего документа
			|составляет: " + Формат(Выборка.ПлощадьПоДокументам + Выборка.ПлощадьПоТекущемуДокументу, "ЧДЦ=2; ЧРД=.") + " м2, что превышает площадь объекта аренды: " + Формат(Выборка.Площадь, "ЧДЦ=2; ЧРД=.") + " м2'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Площадь'"),
			Выборка.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Количество";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;   
		
КонецПроцедуры

Процедура ПроверитьПараметрыНачисленияПеней(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТТабличнаяЧасть
	|ИЗ
	|	&ТабличнаяЧасть КАК ТабличнаяЧасть";
	Запрос.УстановитьПараметр("ТабличнаяЧасть", СрокиОплаты.Выгрузить());
	Запрос.Выполнить();
	
	// Проверим, что нет повторяющихся пар Назначение срока и услуга     
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТТабличнаяЧасть.НазначениеСрока КАК НазначениеСрока,
	|	ВТТабличнаяЧасть.Услуга КАК Услуга,
	|	СУММА(1) КАК Количество
	|ИЗ
	|	ВТТабличнаяЧасть КАК ВТТабличнаяЧасть
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТабличнаяЧасть.НазначениеСрока,
	|	ВТТабличнаяЧасть.Услуга ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 1 Тогда
			ИмяСписка = "Сроки оплаты";
			Если ЗначениеЗаполнено(Выборка.Услуга) Тогда
				ТекстСообщения = НСтр("ru = 'Для услуги """ + Выборка.Услуга + """ имеется несколько строк сроков оплаты'");
			Иначе
				ТекстСообщения = НСтр("ru = 'Для назначения срока """ + Выборка.НазначениеСрока + """ имеется несколько строк сроков оплаты'");
			КонецЕсли;
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Список", "Корректность",
			,, ИмяСписка, ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"СрокиОплаты", "Объект", Отказ);
		КонецЕсли;   		
	КонецЦикла;
	
	Для каждого СтрокаТЧ Из СрокиОплаты Цикл
		Префикс = "СрокиОплаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		Если СтрокаТЧ.НазначениеСрока = Перечисления.АР_ВариантыНазначенияСрокаОплаты.ДляУслуги И Не ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Заполнение", НСтр("ru = 'Услуга'"), СтрокаТЧ.НомерСтроки, "Сроки оплаты");
			Поле = Префикс + "Услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СуммаВключаетНДС = Истина;
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

	НастройкаСроковОплаты = АР_ОбщиеПроцедуры.ПолучитьНастройкуСроковОплатыПоУмолчанию();
	Если НастройкаСроковОплаты <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкаСроковОплаты);
		Если НастройкаСроковОплаты.Свойство("СрокиОплаты") Тогда
			СрокиОплаты.Загрузить(НастройкаСроковОплаты.СрокиОплаты);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДетализацияСроковОплаты = Перечисления.АР_ДетализацииСроковОплаты.ОбщиеУсловия Тогда
		Пока СрокиОплаты.Количество() > 1 Цикл
			СрокиОплаты.Удалить(1);
		КонецЦикла;
		Если СрокиОплаты.Количество() < 1 Тогда
			СрокиОплаты.Добавить();
		КонецЕсли;
		СрокиОплаты[0].НазначениеСрока = Перечисления.АР_ВариантыНазначенияСрокаОплаты.Общий;
		СрокиОплаты[0].Услуга = Неопределено;
	ИначеЕсли ДетализацияСроковОплаты = Перечисления.АР_ДетализацииСроковОплаты.РаздельныеУсловия Тогда
		Пока СрокиОплаты.Количество() > 2 Цикл
			СрокиОплаты.Удалить(1);
		КонецЦикла;
		Пока СрокиОплаты.Количество() < 2 Цикл
			СрокиОплаты.Добавить();
		КонецЦикла;
		СрокиОплаты[0].НазначениеСрока = Перечисления.АР_ВариантыНазначенияСрокаОплаты.ПостояннаяЧасть;
		СрокиОплаты[1].НазначениеСрока = Перечисления.АР_ВариантыНазначенияСрокаОплаты.ПеременнаяЧасть;
		СрокиОплаты[0].Услуга = Неопределено;
		СрокиОплаты[1].Услуга = Неопределено;
	Иначе
		Для каждого СтрокаТЧ Из СрокиОплаты Цикл
			Если СтрокаТЧ.НазначениеСрока <> Перечисления.АР_ВариантыНазначенияСрокаОплаты.ДляУслуги Тогда
				СтрокаТЧ.Услуга = Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Для каждого СтрокаСрокОплаты Из СрокиОплаты Цикл
		Если СтрокаСрокОплаты.СпособОпределенияСрокаОплаты = Перечисления.АР_СпособыРасчетаПросрочки.ПоПериодуНачисления Тогда
			СтрокаСрокОплаты.КоличествоДнейОтДатыСчетаАкта = 0;
		Иначе
			СтрокаСрокОплаты.СрокОплаты = 0;
			СтрокаСрокОплаты.ПериодСрокаОплаты = 0;
		КонецЕсли;
		СтрокаСрокОплаты.СпособПогашенияПени = СрокиОплаты[0].СпособПогашенияПени;
		СтрокаСрокОплаты.УчитыватьТолькоРабочиеДниПриРасчетеПени = СрокиОплаты[0].УчитыватьТолькоРабочиеДниПриРасчетеПени;
	КонецЦикла;
	
	Если ИспользоватьСпециальныйКурсВалюты Тогда
		Если СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Фиксированный Тогда
			Коэффициент = 0;
			ВерхняяГраница = 0;
			НижняяГраница = 0;
		ИначеЕсли СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Расчетный Тогда
			Курс = 0;
			Кратность = 0;
		КонецЕсли;
	Иначе
		СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.ПустаяСсылка();
		Коэффициент = 0;
		ВерхняяГраница = 0;
		НижняяГраница = 0;
		Курс = 0;
		Кратность = 0;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Документ", Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_ГрафикиИзмененияСтавокНаУслуги.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.АР_ГрафикиИзмененияСтавокНаУслуги КАК АР_ГрафикиИзмененияСтавокНаУслуги
		|ГДЕ
		|	АР_ГрафикиИзмененияСтавокНаУслуги.Документ = &Документ";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ГрафикОбъект = Выборка.Ссылка.Получитьобъект();	
			ГрафикОбъект.ПометкаУдаления = ПометкаУдаления;
			ГрафикОбъект.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ИспользоватьСпециальныйКурсВалюты Тогда
		Если Не СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Фиксированный Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Курс");
			МассивНепроверяемыхРеквизитов.Добавить("Кратность");
		КонецЕсли;
		Если Не СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Расчетный Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Коэффициент");
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ВалютаСпособаНачисления");
		МассивНепроверяемыхРеквизитов.Добавить("СпособРасчета");
		МассивНепроверяемыхРеквизитов.Добавить("Курс");
		МассивНепроверяемыхРеквизитов.Добавить("Кратность");
		МассивНепроверяемыхРеквизитов.Добавить("Коэффициент");
	КонецЕсли;
	
	Если ДатаЗаключенияДоговора > ДатаОкончанияДоговора Тогда
		ТекстСообщения = НСтр("ru = 'Дата заключения договора превышает дату окончания действия договора'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Дата заключения договора'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"ДатаЗаключенияДоговора", "Объект", Отказ);
	КонецЕсли;
	
	Если СпособРасчета = Перечисления.АР_СпособыРасчетаКурсаВалюты.Расчетный 
		И ЗначениеЗаполнено(ВерхняяГраница)
		И ВерхняяГраница < НижняяГраница Тогда
		ТекстСообщения = НСтр("ru = 'Нижняя граница курса валюты не может превышать верхнюю границу'");
		ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения(, "Корректность",
				НСтр("ru = 'Нижняя граница'"),,, ТекстСообщения);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
			"НижняяГраница", "Объект", Отказ);
	КонецЕсли;
	
	// Сроки оплаты
	Если Не ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоУслугам
		И ДетализацияСроковОплаты <> Перечисления.АР_ДетализацииСроковОплаты.ОбщиеУсловия Тогда
		ТекстСообщения = "Настройки сроков оплаты постоянной и переменной части могут различаться только при условии ведения взаиморасчетов по услугам (установлен соответствующий признак в карточке договора контрагента).";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
	// Проверяем табличную часть "Постоянная часть арендной платы":
	ИмяСписка = НСтр("ru = 'Постоянная часть арендной платы'");
	Для каждого СтрокаТЧ Из ПостояннаяЧастьАренднойПлаты Цикл
		Префикс = "ПостояннаяЧастьАренднойПлаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачалаСрокаАренды) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончанияСрокаАренды) Тогда
			
			Если СтрокаТЧ.ДатаНачалаСрокаАренды < ДатаЗаключенияДоговора Тогда
				ТекстСообщения = НСтр("ru = 'Дата начала аренды объекта меньше даты заключения договора'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			Если СтрокаТЧ.ДатаОкончанияСрокаАренды > ДатаОкончанияДоговора Тогда
				ТекстСообщения = НСтр("ru = 'Дата окончания аренды объекта больше даты окончания действия договора'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата окончания срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаОкончанияСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			// Проверим заполнение сроков аренды
			Если СтрокаТЧ.ДатаНачалаСрокаАренды > СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
				ТекстСообщения = НСтр("ru = 'Дата начала аренды не может превышать дату окончания'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;	
			
			// Проверим корректность даты документа и даты начала аренды
			Если НачалоДня(Дата) > СтрокаТЧ.ДатаНачалаСрокаАренды И НачалоДня(Дата) <= СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
				ТекстСообщения = НСтр("ru = 'Возможно некорректное начисление арендной платы за период с " 
				+ Формат(СтрокаТЧ.ДатаНачалаСрокаАренды, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy") + "'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверим корректность заполнения услуг
		Если Не СтрокаТЧ.Услуга.АР_ПостояннаяЧастьОплаты Тогда
			ТекстСообщения = НСтр("ru = 'Указанная услуга не соответствует назначению табличной части'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
					СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
				
		// Проверим корректность заполнения способов начисления
		Если СтрокаТЧ.СпособНачисления.ВариантРасчета = Перечисления.АР_ВариантыРасчета.РасчетПоПроизвольнойФормуле Тогда
			ТекстСообщения = НСтр("ru = 'В способе начисления указан недопустимый вариант расчета'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Способ начисления'"),
					СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "СпособНачисления";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
		// Проверим, что если ставка - это график, то он соответствует текущему документу
		Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			Если СтрокаТЧ.Ставка.Документ <> Ссылка Тогда
				ТекстСообщения = НСтр("ru = 'Ставка не соответствует текущему документу'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
						СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "Ставка";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		ИначеЕсли СтрокаТЧ.Ставка = Неопределено Тогда // Запретим неопределенную ставку
			ТекстСообщения = НСтр("ru = 'Необходимо выбрать тип ставки'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Ставка";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверяем табличную часть "Переменнач часть арендной платы":
	ИмяСписка = НСтр("ru = 'Переменная часть арендной платы'");
	Для каждого СтрокаТЧ Из ПеременнаяЧастьАренднойПлаты Цикл
		
		Префикс = "ПеременнаяЧастьАренднойПлаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
				
		// Проверим, что если ставка - это график, то он соответствует текущему документу
		Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			Если СтрокаТЧ.Ставка.Документ <> Ссылка Тогда
				ТекстСообщения = НСтр("ru = 'Ставка не соответствует текущему документу'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
						СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "Ставка";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		ИначеЕсли СтрокаТЧ.Ставка = Неопределено Тогда // Запретим неопределенную ставку
			ТекстСообщения = НСтр("ru = 'Необходимо выбрать тип ставки'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Ставка";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	ПроверитьСтатусыОбъектовАренды("ПостояннаяЧастьАренднойПлаты", Отказ);
	ПроверитьПризнакСдачиВАренду("ПостояннаяЧастьАренднойПлаты", Отказ);
	ПроверитьПлощадьОбъектовАренды(Отказ);

	// Проверяем табличную часть "Переменную часть арендной платы":
	ИмяСписка = НСтр("ru = 'Переменная часть арендной платы'");
	Для каждого СтрокаТЧ Из ПеременнаяЧастьАренднойПлаты Цикл
		Префикс = "ПеременнаяЧастьАренднойПлаты[" + Формат(СтрокаТЧ.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].";
		
		Если ЗначениеЗаполнено(СтрокаТЧ.ДатаНачалаСрокаАренды) И ЗначениеЗаполнено(СтрокаТЧ.ДатаОкончанияСрокаАренды) Тогда
			
			Если СтрокаТЧ.ДатаНачалаСрокаАренды < ДатаЗаключенияДоговора Тогда
				ТекстСообщения = НСтр("ru = 'Дата начала аренды объекта меньше даты заключения договора'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			Если СтрокаТЧ.ДатаОкончанияСрокаАренды > ДатаОкончанияДоговора Тогда
				ТекстСообщения = НСтр("ru = 'Дата окончания аренды объекта больше даты окончания действия договора'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата окончания срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаОкончанияСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			// Проверим заполнение сроков аренды
			Если СтрокаТЧ.ДатаНачалаСрокаАренды > СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
				ТекстСообщения = НСтр("ru = 'Дата начала аренды не может превышать дату окончания'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;	
			
			// Проверим корректность даты документа и даты начала аренды
			Если НачалоДня(Дата) > СтрокаТЧ.ДатаНачалаСрокаАренды И НачалоДня(Дата) <= СтрокаТЧ.ДатаОкончанияСрокаАренды Тогда
				ТекстСообщения = НСтр("ru = 'Возможно некорректное начисление арендной платы за период с " 
				+ Формат(СтрокаТЧ.ДатаНачалаСрокаАренды, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy") + "'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата начала срока аренды'"),
				СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "ДатаНачалаСрокаАренды";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверим корректность заполнения услуг
		Если СтрокаТЧ.Услуга.АР_ПостояннаяЧастьОплаты Тогда
			ТекстСообщения = НСтр("ru = 'Указанная услуга не соответствует назначению табличной части'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Услуга'"),
					СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
				
		// Проверим, что если ставка - это график, то он соответствует текущему документу
		Если ТипЗнч(СтрокаТЧ.Ставка) = Тип("СправочникСсылка.АР_ГрафикиИзмененияСтавокНаУслуги") Тогда
			Если СтрокаТЧ.Ставка.Документ <> Ссылка Тогда
				ТекстСообщения = НСтр("ru = 'Ставка не соответствует текущему документу'");
				ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Ставка'"),
						СтрокаТЧ.НомерСтроки, ИмяСписка, ТекстСообщения);
				Поле = Префикс + "Ставка";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ПроверитьСтатусыОбъектовАренды("ПеременнаяЧастьАренднойПлаты", Отказ);
	ПроверитьПризнакСдачиВАренду("ПеременнаяЧастьАренднойПлаты", Отказ);
	ПроверитьПараметрыНачисленияПеней(Отказ);
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;

	ПараметрыПроведения = Документы.АР_ЗаключениеДоговораАренды.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ

	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтатусыОбъектовАрендыПостояннаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтатусыОбъектовАрендыПеременнаяЧасть, Движения, "АР_СтатусыОбъектовАренды", Отказ);
	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтавкиПостояннаяЧасть, Движения, "АР_Ставки", Отказ);
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.СтавкиПеременнаяЧасть, Движения, "АР_Ставки", Отказ);
		
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.ПараметрыНачисленияПени, Движения, "АР_СрокиОплатыИПараметрыНачисленияПеней", Отказ);
	
	АР_ОбщиеПроцедуры.СформироватьДвиженияПоРегистру(ПараметрыПроведения.КурсыВалют, Движения, "АР_КурсыВалютДляРасчетовСАрендаторами", Отказ);
		
	ПроведениеСервер.УстановитьЗаписьОчищаемыхНаборовЗаписей(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

#КонецЕсли
