#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		МобильныеПриложения = РаспознаваниеДокументовКоннекторСлужебный.ПодключенныеМобильныеПриложения();
		
		Объект.Наименование = СтрШаблон(НСтр("ru = 'Клиент %1'"), МобильныеПриложения.Количество() + 1);
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		
		Попытка
			
			Объект.Код = РаспознаваниеДокументовКоннекторСлужебный.ЗарегистрироватьМобильноеПриложение(Объект.Наименование);
			Записать();
			
		Исключение
			
			Если Не ПустаяСтрока(Объект.Код) Тогда
				РаспознаваниеДокументовКоннекторСлужебный.ОтключитьМобильноеПриложения(Объект.Код);
			КонецЕсли;
			
			Отказ = Истина;
			Возврат;
			
		КонецПопытки;
		
	КонецЕсли;
	
	QRCodeПодключения = ПоместитьВоВременноеХранилище(ДанныеQRКода(Объект.Код), УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "МобильныеПриложенияРаспознаванияДокументов_Запись" И Параметр = Объект.Ссылка Тогда
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.Отключено Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область БизнесЛогика

&НаСервереБезКонтекста
Функция ДанныеQRКода(Данные)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		Возврат МодульУправлениеПечатью.ДанныеQRКода(Данные, 0, 350);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
