#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	GooglePlay = "https://play.google.com/store/apps/details?id=com.e1c.mobile.documentscanner";
	QRcodeGooglePlay = ПоместитьВоВременноеХранилище(ДанныеQRКода(GooglePlay), УникальныйИдентификатор);
	
	
	AppStore = РаспознаваниеДокументовКоннекторСлужебный.ПолучитьСсылкуAppStore();
	Если ПустаяСтрока(AppStore) Тогда 
		Элементы.ГруппаAppStore.Видимость = Ложь;
	Иначе
		QRcodeAppStore = ПоместитьВоВременноеХранилище(ДанныеQRКода(AppStore), УникальныйИдентификатор);;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура AppStoreНажатие(Элемент)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(AppStore);
	
КонецПроцедуры

&НаКлиенте
Процедура GooglePlayНажатие(Элемент)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(GooglePlay);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область БизнесЛогика

&НаСервереБезКонтекста
Функция ДанныеQRКода(Данные)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		Возврат МодульУправлениеПечатью.ДанныеQRКода(Данные, 0, 350);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти