#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Функция ПредставлениеСтрокой(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СлужбыДоставкиИнтернетМагазина.НаименованиеСлужбыДоставки КАК НаименованиеСлужбыДоставки
	|ИЗ
	|	РегистрСведений.СлужбыДоставкиИнтернетМагазина КАК СлужбыДоставкиИнтернетМагазина
	|ГДЕ
	|	СлужбыДоставкиИнтернетМагазина.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат СтрСоединить(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НаименованиеСлужбыДоставки"), ", ");
	КонецЕсли;
	
КонецФункции

Функция ТаблицаСоответствияСлужбДоставки(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СлужбыДоставкиИнтернетМагазина.ИдентификаторСлужбыДоставки КАК ИдентификаторСлужбыДоставки,
	|	СлужбыДоставкиИнтернетМагазина.СпособДоставки КАК СпособДоставки,
	|	СлужбыДоставкиИнтернетМагазина.НаименованиеСлужбыДоставки КАК НаименованиеСлужбыДоставки
	|ИЗ
	|	РегистрСведений.СлужбыДоставкиИнтернетМагазина КАК СлужбыДоставкиИнтернетМагазина
	|ГДЕ
	|	СлужбыДоставкиИнтернетМагазина.Организация = &Организация";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли