#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиПодключения = Параметры.НастройкиПодключения;
	
	CMSИнтернетМагазина = НастройкиПодключения.CMSИнтернетМагазина;
	
	Элементы.ФормаЗагрузитьИзИнтернетМагазина.Видимость = 
		CMSИнтернетМагазина = ПредопределенноеЗначение("Перечисление.CMSИнтернетМагазина.Bitrix")
			ИЛИ CMSИнтернетМагазина = ПредопределенноеЗначение("Перечисление.CMSИнтернетМагазина.UMI");
	
	Статусы.ЗагрузитьЗначения(Параметры.Статусы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть(Статусы.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзИнтернетМагазина(Команда)
	СтатусыЗаказов = ОбменСИнтернетМагазиномВызовСервера.СтатусыЗаказовИнтернетМагазина(НастройкиПодключения);
	Если ЗначениеЗаполнено(СтатусыЗаказов) Тогда
		Статусы.ЗагрузитьЗначения(СтатусыЗаказов);
		Элементы.Статусы.Обновить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

