
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗаменяемыеСимволы = "\/:*?<>|""";
	Для Индекс = 1 По СтрДлина(ЗаменяемыеСимволы) Цикл
		Если СтрНайти(Наименование, Сред(ЗаменяемыеСимволы, Индекс, 1)) > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Наименование файла планировки не может содержать символы " + ЗаменяемыеСимволы, ЭтотОбъект, "Наименование", "Объект", Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	ХранитьФайлыПланировокВ1СДокументооборот = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюС1СДокументооборот") И Константы.АР_ХранитьФайлыПланировокВ1СДокументооборот.Получить();
	Если ХранитьФайлыПланировокВ1СДокументооборот Тогда
		  МассивНепроверяемыхРеквизитов.Добавить("ИмяФайла");
	КонецЕсли;
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецЕсли