
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(Утвердил) Тогда 
	РС = РегистрыСведений.ИсторияСогласованияЗаявок.СоздатьМенеджерЗаписи();
	РС.Заявка = Ссылка;
	РС.ДатаУтверждения = ДатаУтверждения;
	РС.Примечание = Примечание;
	РС.Утвердил = Утвердил;
	РС.ЭтапСогласования = ЭтапСогласования;       

	РС.Записать();
	КонецЕсли;
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	ЭтапСогласования = Перечисления.ЭтапыСогласованияЗаявки.Новая;
	Утвердил = Справочники.Пользователи.ПустаяСсылка();
	ДатаУтверждения = '00010101000000';
	УтвержденнаяДатаОплаты = '00010101000000';

	Примечание = "";
	Если не ОбъектКопирования.ЭтапСогласования  = Перечисления.ЭтапыСогласованияЗаявки.Отменена Тогда 
		
	КонецЕсли;
	
КонецПроцедуры

