
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Хозрасчетный 
	Движения.Хозрасчетный.Записывать = Истина;
	Движения.Хозрасчетный.Очистить();
	Для Каждого ТекСтрокаКалендарь Из Календарь Цикл
		НОмерКолонки=1;
		//НазвКолонки="Д"+НОмерКолонки;
		ПОка НОмерКолонки<=31 Цикл
			НазвКолонки="Д"+НОмерКолонки;
			Если ТекСтрокаКалендарь[НазвКолонки]>0 Тогда
			Движение = Движения.Хозрасчетный.Добавить();
			
			Движение.Организация = Справочники.Организации.НайтиПоКоду("000000001");
			//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, "СтатьиДвиженияДенежныхСредств", РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств);						
			Движение.Период = НачалоМесяца(Дата)+86400*(НОмерКолонки-1);
			Движение.Сумма = ТекСтрокаКалендарь[НазвКолонки];
			Если  Не ТекСтрокаКалендарь.СтатьяДС.ПринадлежитЭлементу(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000120")) тогда			
			Движение.СчетДт=ПланыСчетов.Хозрасчетный.НайтиПоКоду("ПБД");
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "СтатьиДвиженияДенежныхСредств", ТекСтрокаКалендарь.СтатьяДС);
		Иначе
			Движение.СчетКт=ПланыСчетов.Хозрасчетный.НайтиПоКоду("ПБД");
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "СтатьиДвиженияДенежныхСредств", ТекСтрокаКалендарь.СтатьяДС);
			КонецЕсли;
			//Движение.СчетДт=ПланыСчетов.Хозрасчетный.НайтиПоКоду("ПБД");
		КонецЕсли;
		НОмерКолонки=НОмерКолонки+1;
		КонецЦикла;
		
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
