#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НастройкиСервиса() Экспорт
	
	Настройки = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиСервисаКабинетСотрудника);
							
	Возврат СтруктураНастроек;

КонецФункции

Процедура ВключитьВыполнениеРегламентногоЗадания() Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей[0].ВыполнятьРегламентноеЗадание = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьТестовыйТарифАктивирован(ТестовыйТарифАктивирован) Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 И ТестовыйТарифАктивирован <> НаборЗаписей[0].ТестовыйТарифАктивирован Тогда
		НаборЗаписей[0].ТестовыйТарифАктивирован = ТестовыйТарифАктивирован;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьАбонентСервисаИнициализирован() Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 И Не НаборЗаписей[0].АбонентСервисаИнициализирован Тогда
		НаборЗаписей[0].АбонентСервисаИнициализирован = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьСообщениеОбАктивацииТестовогоТарифаОтправлено() Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 И Не НаборЗаписей[0].СообщениеОбАктивацииТестовогоТарифаОтправлено Тогда
		НаборЗаписей[0].СообщениеОбАктивацииТестовогоТарифаОтправлено = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьТребуетсяАктивацияТестовогоТарифа(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].ТребуетсяАктивацияТестовогоТарифа Тогда
			НаборЗаписей[0].ТребуетсяАктивацияТестовогоТарифа = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		НаборЗаписей[0].ТребуетсяАктивацияТестовогоТарифа = НовоеЗначение;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#КонецЕсли
