#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбновлениеИнформационнойБазы

Функция СтатьяУчетаПрочихДоходовПоАвансамИП() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправочникОрганизации.Ссылка КАК Организация
	|ПОМЕСТИТЬ ВТ_Предприниматели
	|ИЗ
	|	Справочник.Организации КАК СправочникОрганизации
	|ГДЕ
	|	НЕ СправочникОрганизации.ПометкаУдаления
	|	И СправочникОрганизации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетнаяПолитика.УдалитьСтатьяУчетаПрочихДоходовПоАвансамИП КАК Ссылка,
	|	УчетнаяПолитика.УдалитьСтатьяУчетаПрочихДоходовПоАвансамИП.Код КАК Код
	|ИЗ
	|	РегистрСведений.УдалитьУчетнаяПолитикаОрганизаций.СрезПоследних(
	|			,
	|			Организация В
	|					(ВЫБРАТЬ
	|						ВТ_Предприниматели.Организация
	|					ИЗ
	|						ВТ_Предприниматели КАК ВТ_Предприниматели)
	|				И НЕ СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Упрощенная)) КАК УчетнаяПолитика
	|ГДЕ
	|	НЕ УчетнаяПолитика.УдалитьСтатьяУчетаПрочихДоходовПоАвансамИП.Код ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция СтатьяУчетаПрочихДоходовИРасходовПоСомнительнымДолгам() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетнаяПолитика.УдалитьСтатьяУчетаПрочихДоходовИРасходовПоСомнительнымДолгам КАК Ссылка,
	|	УчетнаяПолитика.УдалитьСтатьяУчетаПрочихДоходовИРасходовПоСомнительнымДолгам.Код КАК Код
	|ИЗ
	|	РегистрСведений.УдалитьУчетнаяПолитикаОрганизаций.СрезПоследних(, ) КАК УчетнаяПолитика
	|ГДЕ
	|	НЕ УчетнаяПолитика.УдалитьСтатьяУчетаПрочихДоходовИРасходовПоСомнительнымДолгам.Код ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Выборка.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
