#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает виды доходов исполнительного производства начислений
//
// Возвращаемое значение:
// 	Соответствие:
// 	 	* Ключ     - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний
// 	 	* Значение - ПеречислениеСсылка.ВидыДоходовИсполнительногоПроизводства
// 
Функция ВидыДоходовИсполнительногоПроизводства() Экспорт

	ВидыДоходовИсполнительногоПроизводства = Новый Соответствие;
	
	ВидыДоходов = Перечисления.ВидыДоходовИсполнительногоПроизводства;
	ВидыДоходовИсполнительногоПроизводства.Вставить(Дивиденды,            ВидыДоходов.ДоходыБезОграниченияВзысканий);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДивидендыСотрудников, ВидыДоходов.ДоходыБезОграниченияВзысканий);
	
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДоговорАвторскогоЗаказа, ВидыДоходов.ЗарплатаВознаграждения);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ДоговорРаботыУслуги,     ВидыДоходов.ЗарплатаВознаграждения);
	
	ВидыДоходовИсполнительногоПроизводства.Вставить(КомпенсацияЗаЗадержкуЗарплаты, ВидыДоходов.ЗарплатаВознаграждения);
	
	// МатериальнаяВыгодаПоЗаймам не является доходом вообще, в том смысле, 
	// что ИЛ с ее сумм не должны начисляться, и ее НДФЛ можно регистрировать как угодно.
	// Призы проходят в "Перечне видов заработной платы и иного дохода, из которых производится удержание алиментов"
	// в пункте "м) с других видов выплат к заработной плате, установленных законодательством..."
	// Поэтому относим эти виды особых начислений и удержаний к "зарплатным" доходам.
	ВидыДоходовИсполнительногоПроизводства.Вставить(МатериальнаяВыгодаПоЗаймам, ВидыДоходов.ЗарплатаВознаграждения);
	ВидыДоходовИсполнительногоПроизводства.Вставить(СтоимостьПодарковПризов,    ВидыДоходов.ЗарплатаВознаграждения);

	ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности, ВидыДоходов.КомпенсацииНеоблагаемые);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеПриРожденииРебенка,     ВидыДоходов.КомпенсацииНеоблагаемые);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребение,           ВидыДоходов.КомпенсацииНеоблагаемые);
	ВидыДоходовИсполнительногоПроизводства.Вставить(ПособиеНаПогребениеСотруднику, ВидыДоходов.КомпенсацииНеоблагаемые);
	
	Возврат ВидыДоходовИсполнительногоПроизводства
	
КонецФункции

#КонецОбласти

#КонецЕсли