#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Сотрудники.Сотрудник, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор = "ПФ_MXL_ФормаСЗВ_ТД";
	КомандаПечати.Представление = НСтр("ru = 'СЗВ-ТД'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ФормаСЗВ_ТД") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПФ_MXL_ФормаСЗВ_ТД", 
			НСтр("ru = 'СЗВ-ТД'"), 
			ПечатнаяФормаСЗВ_ТД(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ИмяФайла(Организация, Дата, УИД = Неопределено) Экспорт

	Если УИД = Неопределено Тогда
		УИД = Новый УникальныйИдентификатор;
	КонецЕсли;	
	
	Параметры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "РегистрационныйНомерПФР");
	
	Возврат "ПФР"
			+ "_" + ?(ЗначениеЗаполнено(Параметры.РегистрационныйНомерПФР), Параметры.РегистрационныйНомерПФР, "")
			+ "_СЗВ-ТД"
			+ "_" + Формат(Дата, "ДФ=ггггММдд")
			+ "_" + УИД;
			
КонецФункции	

Функция ВыборкаПоШапкеДокумента(МассивОбъектов)	
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТДанныеДокументовДополненные(Запрос.МенеджерВременныхТаблиц, МассивОбъектов);  
	
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ВТДанныеДокументовДополненные";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ВыборкаПоСотрудникам(МассивОбъектов)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТДанныеДокументовДополненные(Запрос.МенеджерВременныхТаблиц, МассивОбъектов);  
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДокументовДополненные.Ссылка КАК Ссылка,
		|	ДанныеДокументовДополненные.Дата КАК Дата,
		|	ДанныеДокументовДополненные.Номер КАК Номер,
		|	ДанныеДокументовДополненные.Организация КАК Организация,
		|	ДанныеДокументовДополненные.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ДанныеДокументовДополненные.Наименование КАК Наименование,
		|	ДанныеДокументовДополненные.НаименованиеПолное КАК НаименованиеПолное,
		|	ДанныеДокументовДополненные.ИНН КАК ИНН,
		|	ДанныеДокументовДополненные.КПП КАК КПП,
		|	ДанныеДокументовДополненные.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
		|	ДанныеДокументовДополненные.ОГРН КАК ОГРН,
		|	ДанныеДокументовДополненные.Ответственный КАК Ответственный,
		|	ДанныеДокументовДополненные.РегистрационныйНомерПФР КАК РегистрационныйНомерПФР,
		|	ДанныеДокументовДополненные.КодПоОКПО КАК КодПоОКПО,
		|	ДанныеДокументовДополненные.НаименованиеОКОПФ КАК НаименованиеОКОПФ,
		|	ДанныеДокументовДополненные.НаименованиеСокращенное КАК НаименованиеСокращенное,
		|	ДанныеДокументовДополненные.ИмяФайлаДляПФР КАК ИмяФайлаДляПФР,
		|	ДанныеДокументовДополненные.ОтчетныйПериод КАК ОтчетныйПериод,
		|	ДанныеДокументовДополненные.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ДанныеДокументовДополненные.Руководитель КАК Руководитель,
		|	ДанныеДокументовДополненные.ФамилияРуководителя КАК ФамилияРуководителя,
		|	ДанныеДокументовДополненные.ИмяРуководителя КАК ИмяРуководителя,
		|	ДанныеДокументовДополненные.ОтчествоРуководителя КАК ОтчествоРуководителя,
		|	ДанныеДокументовДополненные.РуководительРасшифровкаПодписи КАК РуководительРасшифровкаПодписи,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Сотрудник КАК Сотрудник,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Фамилия КАК Фамилия,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Имя КАК Имя,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Отчество КАК Отчество,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ДатаРождения КАК ДатаРождения,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ЗаявлениеОПродолжении КАК ЗаявлениеОПродолжении,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ЗаявлениеОПредоставлении КАК ЗаявлениеОПредоставлении,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.НомерСтроки КАК НомерСтрокиСотрудника,
		|	ЕСТЬNULL(ЗаявленияОВеденииТрудовыхКнижекОПродолжении.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ЗаявлениеОПродолженииДата,
		|	ВЫБОР
		|		КОГДА СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ЗаявлениеОПродолженииОтмена
		|			ТОГДА ""2""
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ЗаявлениеОПродолженииСтатус,
		|	ЕСТЬNULL(ЗаявленияОВеденииТрудовыхКнижекОПредоставлении.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ЗаявлениеОПредоставленииДата,
		|	ВЫБОР
		|		КОГДА СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ЗаявлениеОПредоставленииОтмена
		|			ТОГДА ""2""
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ЗаявлениеОПредоставленииСтатус,
		|	ВЫБОР
		|		КОГДА СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ЗаявлениеОПродолженииОтмена
		|			ТОГДА ""Х""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ОтменаЗаявленияОПродолжении,
		|	ВЫБОР
		|		КОГДА СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ЗаявлениеОПредоставленииОтмена
		|			ТОГДА ""Х""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ОтменаЗаявленияОПредоставлении
		|ПОМЕСТИТЬ ВТДанныеСотрудников
		|ИЗ
		|	ВТДанныеДокументовДополненные КАК ДанныеДокументовДополненные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудники КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявленияОВеденииТрудовыхКнижек КАК ЗаявленияОВеденииТрудовыхКнижекОПродолжении
		|			ПО СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ЗаявлениеОПродолжении = ЗаявленияОВеденииТрудовыхКнижекОПродолжении.Заявление
		|				И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Сотрудник = ЗаявленияОВеденииТрудовыхКнижекОПродолжении.ФизическоеЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявленияОВеденииТрудовыхКнижек КАК ЗаявленияОВеденииТрудовыхКнижекОПредоставлении
		|			ПО СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ЗаявлениеОПредоставлении = ЗаявленияОВеденииТрудовыхКнижекОПредоставлении.Заявление
		|				И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Сотрудник = ЗаявленияОВеденииТрудовыхКнижекОПредоставлении.ФизическоеЛицо
		|		ПО ДанныеДокументовДополненные.Ссылка = СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеСотрудников.Ссылка КАК Ссылка,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.НомерСтроки КАК НомерСтроки,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ЯвляетсяСовместителем КАК ЯвляетсяСовместителем,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ДатаМероприятия КАК ДатаМероприятия,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ВидМероприятия КАК ВидМероприятия,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Подразделение КАК Подразделение,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Должность КАК Должность,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.РазрядКатегория КАК РазрядКатегория,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ОснованиеУвольнения КАК ОснованиеУвольнения,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.НаименованиеДокументаОснования КАК НаименованиеДокументаОснования,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ДатаДокументаОснования КАК ДатаДокументаОснования,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.НомерДокументаОснования КАК НомерДокументаОснования,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.СерияДокументаОснования КАК СерияДокументаОснования,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.КодПоРееструДолжностей КАК КодПоРееструДолжностей,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ДатаС КАК ДатаС,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ДатаПо КАК ДатаПо,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ДатаОтмены КАК ДатаОтмены,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ИдМероприятия КАК ИдМероприятия,
		|	ДанныеСотрудников.Дата КАК Дата,
		|	ДанныеСотрудников.Организация КАК Организация,
		|	ДанныеСотрудников.ОтчетныйПериод КАК ОтчетныйПериод,
		|	ДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	ДанныеСотрудников.Сотрудник КАК ФизическоеЛицо,
		|	ДанныеСотрудников.НомерСтрокиСотрудника КАК НомерСтрокиСотрудника,
		|	ДанныеСотрудников.Фамилия КАК Фамилия,
		|	ДанныеСотрудников.Имя КАК Имя,
		|	ДанныеСотрудников.Отчество КАК Отчество,
		|	ДанныеСотрудников.ДатаРождения КАК ДатаРождения,
		|	ДанныеСотрудников.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ДанныеСотрудников.ЗаявлениеОПродолжении КАК ЗаявлениеОПродолжении,
		|	ДанныеСотрудников.ЗаявлениеОПредоставлении КАК ЗаявлениеОПредоставлении,
		|	ДанныеСотрудников.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
		|	ДанныеСотрудников.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ДанныеСотрудников.РегистрационныйНомерПФР КАК РегистрационныйНомерПФР,
		|	ДанныеСотрудников.ИНН КАК ИНН,
		|	ДанныеСотрудников.КПП КАК КПП,
		|	ДанныеСотрудников.Руководитель КАК Руководитель,
		|	ДанныеСотрудников.РуководительРасшифровкаПодписи КАК РуководительРасшифровкаПодписи,
		|	ДанныеСотрудников.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	ВЫБОР
		|		КОГДА СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ДатаОтмены > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ""Х""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ПризнакОтмены,
		|	ДанныеСотрудников.ЗаявлениеОПродолженииДата КАК ЗаявлениеОПродолженииДата,
		|	ДанныеСотрудников.ЗаявлениеОПродолженииСтатус КАК ЗаявлениеОПродолженииСтатус,
		|	ДанныеСотрудников.ЗаявлениеОПредоставленииДата КАК ЗаявлениеОПредоставленииДата,
		|	ДанныеСотрудников.ЗаявлениеОПредоставленииСтатус КАК ЗаявлениеОПредоставленииСтатус,
		|	ДанныеСотрудников.ОтменаЗаявленияОПродолжении КАК ОтменаЗаявленияОПродолжении,
		|	ДанныеСотрудников.ОтменаЗаявленияОПредоставлении КАК ОтменаЗаявленияОПредоставлении,
		|	ВЫБОР
		|		КОГДА СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ТрудоваяФункция.Описание = """"
		|			ТОГДА СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ТрудоваяФункция
		|		ИНАЧЕ СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ТрудоваяФункция.Описание
		|	КОНЕЦ КАК ТрудоваяФункцияОписание,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ТрудоваяФункция.КодПрофессиональнойДеятельности КАК ТрудоваяФункцияКод,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Сведения КАК Сведения,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ПредставлениеДолжности КАК ПредставлениеДолжности,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ПредставлениеПодразделения КАК ПредставлениеПодразделения,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ОснованиеУвольненияТекстОснования КАК ОснованиеУвольненияТекстОснования,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ОснованиеУвольненияСтатья КАК ОснованиеУвольненияСтатья,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ОснованиеУвольненияЧасть КАК ОснованиеУвольненияЧасть,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ОснованиеУвольненияПункт КАК ОснованиеУвольненияПункт,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ОснованиеУвольненияПодПункт КАК ОснованиеУвольненияПодПункт,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ОписаниеДолжности КАК ОписаниеДолжности
		|ИЗ
		|	ВТДанныеСотрудников КАК ДанныеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Мероприятия КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельностиПереданные КАК МероприятияТрудовойДеятельностиПереданные
		|			ПО СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ИдМероприятия = МероприятияТрудовойДеятельностиПереданные.ИдМероприятия
		|				И (НЕ МероприятияТрудовойДеятельностиПереданные.Отменено)
		|		ПО ДанныеСотрудников.Ссылка = СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Ссылка
		|			И ДанныеСотрудников.Сотрудник = СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтрокиСотрудника,
		|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции	

Процедура СоздатьВТДанныеДокументовДополненные(МенеджерВременныхТаблиц, МассивОбъектов)
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ОписаниеИсточникаДанных = ПерсонифицированныйУчет.ОписаниеИсточникаДанныхДляСоздатьВТСведенияОбОрганизациях();
	ОписаниеИсточникаДанных.ИмяТаблицы = "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД";
	ОписаниеИсточникаДанных.ИмяПоляОрганизация = "Организация";
	ОписаниеИсточникаДанных.ИмяПоляПериод = "Дата";
	ОписаниеИсточникаДанных.СписокСсылок = МассивОбъектов;

	ПерсонифицированныйУчет.СоздатьВТСведенияОбОрганизацияхПоОписаниюДокументаИсточникаДанных(Запрос.МенеджерВременныхТаблиц, ОписаниеИсточникаДанных);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка КАК Ссылка,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Номер КАК Номер,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Дата КАК Дата,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Организация КАК Организация,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ОтчетныйПериод КАК ОтчетныйПериод,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ДокументПринятВПФР КАК ДокументПринятВПФР,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ИмяФайлаДляПФР КАК ИмяФайлаДляПФР,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Руководитель КАК Руководитель,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ФайлСформирован КАК ФайлСформирован,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ответственный КАК Ответственный,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ОкончаниеОтчетногоПериода КАК ОкончаниеОтчетногоПериода
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД
		|ГДЕ
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка В(&МассивОбъектов)";
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, "Руководитель", "ВТДанныеДокументов");  
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДокументов.Ссылка КАК Ссылка,
		|	ДанныеДокументов.Дата КАК Дата,
		|	ДанныеДокументов.Номер КАК Номер,
		|	ДанныеДокументов.Организация КАК Организация,
		|	ДанныеДокументов.Ответственный КАК Ответственный,
		|	ДанныеДокументов.ИмяФайлаДляПФР КАК ИмяФайлаДляПФР,
		|	ДанныеДокументов.ОтчетныйПериод КАК ОтчетныйПериод,
		|	ЕСТЬNULL(ДанныеДокументов.ДолжностьРуководителя.Наименование, """") КАК ДолжностьРуководителя,
		|	ЕСТЬNULL(ФИООтветственныхЛиц.ФИОПолные, """") КАК Руководитель,
		|	ЕСТЬNULL(ФИООтветственныхЛиц.Фамилия, """") КАК ФамилияРуководителя,
		|	ЕСТЬNULL(ФИООтветственныхЛиц.Имя, """") КАК ИмяРуководителя,
		|	ЕСТЬNULL(ФИООтветственныхЛиц.Отчество, """") КАК ОтчествоРуководителя,
		|	ЕСТЬNULL(ФИООтветственныхЛиц.РасшифровкаПодписи, """") КАК РуководительРасшифровкаПодписи,
		|	СведенияОбОрганизациях.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	СведенияОбОрганизациях.Наименование КАК Наименование,
		|	СведенияОбОрганизациях.НаименованиеСокращенное КАК НаименованиеСокращенное,
		|	СведенияОбОрганизациях.НаименованиеПолное КАК НаименованиеПолное,
		|	СведенияОбОрганизациях.ИНН КАК ИНН,
		|	СведенияОбОрганизациях.КПП КАК КПП,
		|	СведенияОбОрганизациях.РегистрационныйНомерПФР КАК РегистрационныйНомерПФР,
		|	СведенияОбОрганизациях.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
		|	СведенияОбОрганизациях.ОГРН КАК ОГРН,
		|	СведенияОбОрганизациях.КодПоОКПО КАК КодПоОКПО,
		|	СведенияОбОрганизациях.НаименованиеОКОПФ КАК НаименованиеОКОПФ
		|ПОМЕСТИТЬ ВТДанныеДокументовДополненные
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОбОрганизациях КАК СведенияОбОрганизациях
		|		ПО ДанныеДокументов.Организация = СведенияОбОрганизациях.Организация
		|			И ДанныеДокументов.Дата = СведенияОбОрганизациях.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИООтветственныхЛиц
		|		ПО ДанныеДокументов.Ссылка = ФИООтветственныхЛиц.Ссылка
		|			И ДанныеДокументов.Руководитель = ФИООтветственныхЛиц.ФизическоеЛицо";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция СформироватьВыходнойФайл(Ссылка) 
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(Ссылка);
	
	ВыборкаПоШапкеДокумента = ВыборкаПоШапкеДокумента(МассивСсылок);
	ВыборкаПоШапкеДокумента.Следующий();
		
	ВыборкаПоРаботникам = ВыборкаПоСотрудникам(МассивСсылок);
	
	// Загружаем формат файла сведений
	ДеревоФорматаXML = ПолучитьОбщийМакет("ФорматПФР_ЭТК_2019XML");
	ТекстФорматаXML = ДеревоФорматаXML.ПолучитьТекст();
	
	ДеревоФормата = ЗарплатаКадры.ЗагрузитьXMLВДокументDOM(ТекстФорматаXML);
	
	ФорматСЗВ_ТД = ЗарплатаКадры.ЗагрузитьФорматНабораЗаписей(ДеревоФормата, "СЗВ_ТД");
	
	ФорматЗЛ = ОбщегоНазначения.СкопироватьРекурсивно(ФорматСЗВ_ТД.ЗЛ.Значение);
	ФорматСЗВ_ТД.Удалить("ЗЛ");
	
	НаборЗаписейДатаЗаполнения = Новый Структура("ДатаЗаполнения", ОбщегоНазначения.СкопироватьРекурсивно(ФорматСЗВ_ТД.ДатаЗаполнения));
	ФорматСЗВ_ТД.Удалить("ДатаЗаполнения");
	
	НаборЗаписейРуководитель = Новый Структура("Руководитель", ОбщегоНазначения.СкопироватьРекурсивно(ФорматСЗВ_ТД.Руководитель));
	ФорматСЗВ_ТД.Удалить("Руководитель");
	
	// Создаем начальное дерево
	ДеревоВыгрузки = ЗарплатаКадры.СоздатьДеревоXML();
	
	Атрибуты = Новый Соответствие;
	Атрибуты.Вставить("xmlns", "http://пф.рф/СЗВ-ТД/2019-12-20");
	Атрибуты.Вставить("xmlns:УТ2", "http://пф.рф/УТ/2017-08-21");
	Атрибуты.Вставить("xmlns:АФ5", "http://пф.рф/АФ/2018-12-07");
	УзелПФР = ЗарплатаКадры.ДобавитьУзелВДеревоXML(ДеревоВыгрузки, "ЭДПФР", "", Атрибуты);
	
	// Данные формы и страхователя
	НаборЗаписейРаботодатель = ФорматСЗВ_ТД.Работодатель.Значение;
	НаименованиеОрганизации = СокрЛП(ВРег(ВыборкаПоШапкеДокумента.НаименованиеПолное));
	ПерсонифицированныйУчет.УдалитьПробелыРядомСДефисом(НаименованиеОрганизации);
	НаборЗаписейРаботодатель.НаименованиеОрганизации = НаименованиеОрганизации;
	НаборЗаписейРаботодатель.УТ2__РегНомер = ВыборкаПоШапкеДокумента.РегистрационныйНомерПФР;
	НаборЗаписейРаботодатель.УТ2__ИНН = ВыборкаПоШапкеДокумента.ИНН;
	Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.КПП) Тогда
		НаборЗаписейРаботодатель.УТ2__КПП = ВыборкаПоШапкеДокумента.КПП;
	Иначе
		НаборЗаписейРаботодатель.Удалить("УТ2__КПП");
		СтрокаПоляКПП = ФорматСЗВ_ТД.Работодатель.Поля.Найти("УТ2__КПП", "ИмяПоля");
		Если СтрокаПоляКПП <> Неопределено Тогда
			ФорматСЗВ_ТД.Работодатель.Поля.Удалить(СтрокаПоляКПП);
		КонецЕсли;		
	КонецЕсли;
	
	НаборЗаписейОтчетныйПериод = ФорматСЗВ_ТД.ОтчетныйПериод.Значение;
	НаборЗаписейОтчетныйПериод.Месяц = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Строка(Месяц(ВыборкаПоШапкеДокумента.ОтчетныйПериод)), 2);
	НаборЗаписейОтчетныйПериод.КалендарныйГод = Год(ВыборкаПоШапкеДокумента.ОтчетныйПериод);
	
	УзелФормы = ЗарплатаКадры.ДобавитьУзелВДеревоXML(УзелПФР, "СЗВ-ТД", "");
	ЗарплатаКадры.ДобавитьИнформациюВДерево(УзелФормы, ФорматСЗВ_ТД);
	
	ФорматТрудоваяДеятельность = ОбщегоНазначения.СкопироватьРекурсивно(ФорматЗЛ.ТрудоваяДеятельность.Значение);
	ФорматЗЛ.Удалить("ТрудоваяДеятельность");
	
	ФорматМероприятие = ОбщегоНазначения.СкопироватьРекурсивно(ФорматТрудоваяДеятельность.Мероприятие.Значение);
	ФорматТрудоваяДеятельность.Удалить("Мероприятие");
	
	ФорматМероприятиеОтменяемое = ОбщегоНазначения.СкопироватьРекурсивно(ФорматТрудоваяДеятельность.МероприятиеОтменяемое.Значение);
	ФорматТрудоваяДеятельность.Удалить("МероприятиеОтменяемое");
	
	Пока ВыборкаПоРаботникам.СледующийПоЗначениюПоля("НомерСтрокиСотрудника") Цикл
	
		НаборЗаписейЗЛ = ОбщегоНазначения.СкопироватьРекурсивно(ФорматЗЛ);
		
		// Данные по сотруднику
		Фамилия = СокрЛП(ВыборкаПоРаботникам.Фамилия);
		Имя = СокрЛП(ВыборкаПоРаботникам.Имя);
		Отчество = СокрЛП(ВыборкаПоРаботникам.Отчество);
		
		НаборЗаписейФИО = НаборЗаписейЗЛ.УТ2__ФИО.Значение;
		НаборЗаписейФИО.УТ2__Фамилия = ВРег(Фамилия);
		НаборЗаписейФИО.УТ2__Имя = ВРег(Имя);
		НаборЗаписейФИО.УТ2__Отчество = ВРег(Отчество);
		
		ПерсонифицированныйУчет.УстановитьВыводВФайлСвойстваЗначенияЭлемента(НаборЗаписейЗЛ.УТ2__ФИО, "УТ2__Отчество");
		
		НаборЗаписейЗЛ.ДатаРождения.Значение = Формат(ВыборкаПоРаботникам.ДатаРождения, "ДФ=yyyy-MM-dd");
		
		НаборЗаписейЗЛ.УТ2__СНИЛС.Значение = ВыборкаПоРаботникам.СтраховойНомерПФР;
		
		Если ЗначениеЗаполнено(ВыборкаПоРаботникам.ЗаявлениеОПредоставленииДата) Тогда
			ЗаявлениеОПредоставлении = НаборЗаписейЗЛ.Заявления.Значение.ЗаявлениеОПредоставлении.Значение;
			ЗаявлениеОПредоставлении.Дата.Значение = Формат(ВыборкаПоРаботникам.ЗаявлениеОПредоставленииДата, "ДФ=yyyy-MM-dd");
			ЗаявлениеОПредоставлении.СтатусЗаявленияОПредоставлении.Значение = ВыборкаПоРаботникам.ЗаявлениеОПредоставленииСтатус;
		Иначе
			НаборЗаписейЗЛ.Заявления.Значение.ЗаявлениеОПредоставлении.НеВыводитьВФайл = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаПоРаботникам.ЗаявлениеОПродолженииДата) Тогда
			ЗаявлениеОПродолжении = НаборЗаписейЗЛ.Заявления.Значение.ЗаявлениеОПродолжении.Значение;
			ЗаявлениеОПродолжении.Дата.Значение = Формат(ВыборкаПоРаботникам.ЗаявлениеОПродолженииДата, "ДФ=yyyy-MM-dd");
			ЗаявлениеОПродолжении.СтатусЗаявленияОПродолжении.Значение = ВыборкаПоРаботникам.ЗаявлениеОПродолженииСтатус;
		Иначе
			НаборЗаписейЗЛ.Заявления.Значение.ЗаявлениеОПродолжении.НеВыводитьВФайл = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаПоРаботникам.ЗаявлениеОПредоставленииДата) 
			И Не ЗначениеЗаполнено(ВыборкаПоРаботникам.ЗаявлениеОПродолжении) Тогда
		    НаборЗаписейЗЛ.Заявления.НеВыводитьВФайл = Истина;
		КонецЕсли;
		
		УзелСотрудника = ЗарплатаКадры.ДобавитьУзелВДеревоXML(УзелФормы, "ЗЛ", "");
		ЗарплатаКадры.ДобавитьИнформациюВДерево(УзелСотрудника, НаборЗаписейЗЛ);
		
		Мероприятия = Новый Массив;
		ОтменяемыеМероприятия = Новый Массив;
		
		Пока ВыборкаПоРаботникам.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(ВыборкаПоРаботникам.ВидМероприятия) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаПоРаботникам.ДатаОтмены) Тогда
				
				НаборЗаписейМероприятиеОтменяемое = ОбщегоНазначения.СкопироватьРекурсивно(ФорматМероприятиеОтменяемое);
				НаборЗаписейМероприятиеОтменяемое.UUID.Значение = Строка(ВыборкаПоРаботникам.ИдМероприятия);
				НаборЗаписейМероприятиеОтменяемое.ДатаМероприятия.Значение = Формат(ВыборкаПоРаботникам.ДатаМероприятия, "ДФ=yyyy-MM-dd");
				НаборЗаписейМероприятиеОтменяемое.ДатаОтмены.Значение = Формат(ВыборкаПоРаботникам.ДатаОтмены, "ДФ=yyyy-MM-dd");
				НаборЗаписейМероприятиеОтменяемое.Вид.Значение = КодВидаМероприятия(ВыборкаПоРаботникам.ВидМероприятия);
				НаборЗаписейМероприятиеОтменяемое.ЯвляетсяСовместителем.Значение = ?(ВыборкаПоРаботникам.ЯвляетсяСовместителем, 1, 0);
				
				ОтменяемыеМероприятия.Добавить(НаборЗаписейМероприятиеОтменяемое);
				
			Иначе
				
				НаборЗаписейМероприятие = ОбщегоНазначения.СкопироватьРекурсивно(ФорматМероприятие);
				НаборЗаписейМероприятие.UUID.Значение = Строка(ВыборкаПоРаботникам.ИдМероприятия);
				НаборЗаписейМероприятие.Дата.Значение = Формат(ВыборкаПоРаботникам.ДатаМероприятия, "ДФ=yyyy-MM-dd");
				НаборЗаписейМероприятие.Вид.Значение = КодВидаМероприятия(ВыборкаПоРаботникам.ВидМероприятия);
				
				НаборЗаписейМероприятие.Сведения.Значение = СокрЛП(ВыборкаПоРаботникам.Сведения);
				
				Если ВыборкаПоРаботникам.ВидМероприятия = Перечисления.ВидыМероприятийТрудовойДеятельности.УстановлениеВторойПрофессии
					И ЗначениеЗаполнено(ВыборкаПоРаботникам.ОписаниеДолжности) Тогда
					
					НаборЗаписейМероприятие.Должность.Значение = СокрЛП(ВыборкаПоРаботникам.ОписаниеДолжности);
					
				Иначе
					
					НаборЗаписейМероприятие.Должность.Значение = СокрЛП(ВыборкаПоРаботникам.ПредставлениеДолжности) 
						+ ?(ЗначениеЗаполнено(ВыборкаПоРаботникам.КодПоРееструДолжностей), ", " + СокрЛП(ВыборкаПоРаботникам.КодПоРееструДолжностей), "")
						+ ?(ЗначениеЗаполнено(ВыборкаПоРаботникам.РазрядКатегория), ", " + ЭлектронныеТрудовыеКнижкиПовтИсп.ПредставлениеРазрядаКатегории(
						ВыборкаПоРаботникам.РазрядКатегория), "");
					
				КонецЕсли;
				
				НаборЗаписейМероприятие.ЯвляетсяСовместителем.Значение = ?(ВыборкаПоРаботникам.ЯвляетсяСовместителем, "1", "0");
				
				НаборЗаписейМероприятие.СтруктурноеПодразделение.Значение = СокрЛП(ВыборкаПоРаботникам.ПредставлениеПодразделения);
				
				НаборЗаписейМероприятие.ВидПР.Значение = СокрЛП(ВыборкаПоРаботникам.ТрудоваяФункцияОписание);
				НаборЗаписейМероприятие.КодВФ.Значение = СокрЛП(ВыборкаПоРаботникам.ТрудоваяФункцияКод);
				
				НаборЗаписейМероприятие.ДатаС.Значение = Формат(ВыборкаПоРаботникам.ДатаС, "ДФ=yyyy-MM-dd");
				НаборЗаписейМероприятие.ДатаПо.Значение = Формат(ВыборкаПоРаботникам.ДатаПо, "ДФ=yyyy-MM-dd");
				
				Если ВыборкаПоРаботникам.ВидМероприятия = Перечисления.ВидыМероприятийТрудовойДеятельности.Увольнение Тогда
					
					НаборЗаписейМероприятие.Причина.Значение = СокрЛП(ВыборкаПоРаботникам.ОснованиеУвольненияТекстОснования);
					
					НаборЗаписейМероприятие.ОснованиеУвольнения.Значение.УТ2__НормативныйДокумент = КадровыйУчет.НормативныйДокументОснованияУвольнения(ВыборкаПоРаботникам.ОснованиеУвольнения);
					НаборЗаписейМероприятие.ОснованиеУвольнения.Значение.УТ2__Статья = ВыборкаПоРаботникам.ОснованиеУвольненияСтатья;
					НаборЗаписейМероприятие.ОснованиеУвольнения.Значение.УТ2__Часть = ВыборкаПоРаботникам.ОснованиеУвольненияЧасть;
					НаборЗаписейМероприятие.ОснованиеУвольнения.Значение.УТ2__Пункт = ВыборкаПоРаботникам.ОснованиеУвольненияПункт;
					НаборЗаписейМероприятие.ОснованиеУвольнения.Значение.УТ2__Подпункт = ВыборкаПоРаботникам.ОснованиеУвольненияПодпункт;
					ПерсонифицированныйУчет.УстановитьВыводВФайлСвойстваЗначенияЭлемента(НаборЗаписейМероприятие.ОснованиеУвольнения, "УТ2__НормативныйДокумент");
					ПерсонифицированныйУчет.УстановитьВыводВФайлСвойстваЗначенияЭлемента(НаборЗаписейМероприятие.ОснованиеУвольнения, "УТ2__Статья");
					ПерсонифицированныйУчет.УстановитьВыводВФайлСвойстваЗначенияЭлемента(НаборЗаписейМероприятие.ОснованиеУвольнения, "УТ2__Часть");
					ПерсонифицированныйУчет.УстановитьВыводВФайлСвойстваЗначенияЭлемента(НаборЗаписейМероприятие.ОснованиеУвольнения, "УТ2__Пункт");
					ПерсонифицированныйУчет.УстановитьВыводВФайлСвойстваЗначенияЭлемента(НаборЗаписейМероприятие.ОснованиеУвольнения, "УТ2__Подпункт");
				Иначе 
					НаборЗаписейМероприятие.ОснованиеУвольнения.НеВыводитьВФайл = Истина;
				КонецЕсли;
				
				НаборЗаписейОснование = НаборЗаписейМероприятие.Основание.Значение;
				НаборЗаписейОснование.Наименование.Значение = СокрЛП(ВыборкаПоРаботникам.НаименованиеДокументаОснования);
				НаборЗаписейОснование.Дата.Значение = Формат(ВыборкаПоРаботникам.ДатаДокументаОснования, "ДФ=yyyy-MM-dd");;
				НаборЗаписейОснование.Номер.Значение = СокрЛП(ВыборкаПоРаботникам.НомерДокументаОснования);
				НаборЗаписейОснование.Серия.Значение = СокрЛП(ВыборкаПоРаботникам.СерияДокументаОснования);
				
				ПерсонифицированныйУчет.УстановитьВыводВФайл(НаборЗаписейМероприятие.Сведения, "Значение");
				ПерсонифицированныйУчет.УстановитьВыводВФайл(НаборЗаписейМероприятие.Должность, "Значение");
				ПерсонифицированныйУчет.УстановитьВыводВФайл(НаборЗаписейМероприятие.СтруктурноеПодразделение, "Значение");
				ПерсонифицированныйУчет.УстановитьВыводВФайл(НаборЗаписейМероприятие.ВидПР, "Значение");
				ПерсонифицированныйУчет.УстановитьВыводВФайл(НаборЗаписейМероприятие.КодВФ, "Значение");
				ПерсонифицированныйУчет.УстановитьВыводВФайл(НаборЗаписейМероприятие.Причина, "Значение");
				ПерсонифицированныйУчет.УстановитьВыводВФайл(НаборЗаписейМероприятие.ДатаС, "Значение");
				ПерсонифицированныйУчет.УстановитьВыводВФайл(НаборЗаписейМероприятие.ДатаПо, "Значение");
				ПерсонифицированныйУчет.УстановитьВыводВФайл(НаборЗаписейОснование.Серия, "Значение");
				
				Мероприятия.Добавить(НаборЗаписейМероприятие);
				
			КонецЕсли;
			
		КонецЦикла;
			
		Если Мероприятия.Количество() = 0 И ОтменяемыеМероприятия.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		УзелТрудоваяДеятельность = ЗарплатаКадры.ДобавитьУзелВДеревоXML(УзелСотрудника, "ТрудоваяДеятельность", "");
		
		Для Каждого НаборЗаписейМероприятие Из Мероприятия Цикл 
			УзелМероприятие = ЗарплатаКадры.ДобавитьУзелВДеревоXML(УзелТрудоваяДеятельность, "Мероприятие", "");
			ЗарплатаКадры.ДобавитьИнформациюВДерево(УзелМероприятие, НаборЗаписейМероприятие);
		КонецЦикла;
		
		Для Каждого НаборЗаписейМероприятиеОтменяемое Из ОтменяемыеМероприятия Цикл 
			УзелМероприятиеОтменяемое = ЗарплатаКадры.ДобавитьУзелВДеревоXML(УзелТрудоваяДеятельность, "МероприятиеОтменяемое", "");
			ЗарплатаКадры.ДобавитьИнформациюВДерево(УзелМероприятиеОтменяемое, НаборЗаписейМероприятиеОтменяемое);
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписейДатаЗаполнения.ДатаЗаполнения.Значение = Формат(ВыборкаПоШапкеДокумента.Дата, "ДФ=yyyy-MM-dd");
	ЗарплатаКадры.ДобавитьИнформациюВДерево(УзелФормы, НаборЗаписейДатаЗаполнения);
	
	НаборЗаписейРуководитель.Руководитель.Значение.УТ2__Должность.Значение = СокрЛП(ВРег(ВыборкаПоШапкеДокумента.ДолжностьРуководителя));
	НаборЗаписейФИО = НаборЗаписейРуководитель.Руководитель.Значение.УТ2__ФИО.Значение;
	НаборЗаписейФИО.УТ2__Фамилия = СокрЛП(ВРег(ВыборкаПоШапкеДокумента.ФамилияРуководителя));
	НаборЗаписейФИО.УТ2__Имя = СокрЛП(ВРег(ВыборкаПоШапкеДокумента.ИмяРуководителя));
	НаборЗаписейФИО.УТ2__Отчество = СокрЛП(ВРег(ВыборкаПоШапкеДокумента.ОтчествоРуководителя));
	ПерсонифицированныйУчет.УстановитьВыводВФайлСвойстваЗначенияЭлемента(НаборЗаписейРуководитель.Руководитель.Значение.УТ2__ФИО, "УТ2__Отчество");
	ЗарплатаКадры.ДобавитьИнформациюВДерево(УзелФормы, НаборЗаписейРуководитель);
	
	// Служебная информация о файле
	НаборЗаписейСлужебнаяИнформация = ЗарплатаКадры.ЗагрузитьФорматНабораЗаписей(ДеревоФормата, "СлужебнаяИнформация");
	Если ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ИмяФайлаДляПФР) Тогда
		ЧастиИмениФайла = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(ВыборкаПоШапкеДокумента.ИмяФайлаДляПФР),"_");
		НаборЗаписейСлужебнаяИнформация.АФ5__GUID.Значение = ЧастиИмениФайла[ЧастиИмениФайла.ВГраница()];
	КонецЕсли;
	НаборЗаписейСлужебнаяИнформация.АФ5__ДатаВремя.Значение = ПерсонифицированныйУчет.ПредставлениеДатыВФорматеdateTimeСЧасовымПоясом(ВыборкаПоШапкеДокумента.Дата);
	ЗарплатаКадры.ДобавитьИнформациюВДерево(ЗарплатаКадры.ДобавитьУзелВДеревоXML(УзелПФР, "СлужебнаяИнформация",""), НаборЗаписейСлужебнаяИнформация);
	
	// Преобразуем дерево в строковое описание XML
	ПотокВыгрузкиXML = ЗарплатаКадры.СоздатьПотокXML(, "UTF-8");
	ЗарплатаКадры.ЗаписатьУзелДереваXMLВXML(ДеревоВыгрузки, ПотокВыгрузкиXML, "xsi", "http://www.w3.org/2001/XMLSchema", Ложь);
	ТекстФайла = ЗарплатаКадры.ЗаписатьПотокXML(ПотокВыгрузкиXML);
	
	Возврат СтрЗаменить(ТекстФайла, "__", ":");
	
КонецФункции // СформироватьВыходнойФайл()

Процедура ОбработкаФормированияФайла(Объект) Экспорт	
	
	ТекстФайла = СформироватьВыходнойФайл(Объект.Ссылка);
	ЗарплатаКадры.ЗаписатьФайлВАрхив(Объект.Ссылка, Объект.ИмяФайлаДляПФР, ТекстФайла, , "UTF-8", Ложь, Ложь);
	
КонецПроцедуры

Функция ВыгрузитьФайлыВоВременноеХранилище(Ссылка, УникальныйИдентификатор = Неопределено) Экспорт
	
	ДанныеФайла = ЗарплатаКадры.ПолучитьДанныеФайла(Ссылка, УникальныйИдентификатор);
	
	ОписаниеВыгруженногоФайла = ПерсонифицированныйУчет.ОписаниеВыгруженногоФайлаОтчетности();
	
	ОписаниеВыгруженногоФайла.Владелец = Ссылка;
	ОписаниеВыгруженногоФайла.АдресВоВременномХранилище = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
	ОписаниеВыгруженногоФайла.ИмяФайла = ДанныеФайла.ИмяФайла;
	ОписаниеВыгруженногоФайла.ПроверятьCheckXML = Ложь;
	ОписаниеВыгруженногоФайла.ПроверятьCheckUFA = Истина;
	ОписаниеВыгруженногоФайла.ПроверятьПОПД = Истина;
	
	ВыгруженныеФайлы = Новый Массив;
	ВыгруженныеФайлы.Добавить(ОписаниеВыгруженногоФайла);
	
	Возврат ВыгруженныеФайлы;
	
КонецФункции

Функция КодВидаМероприятия(ВидМероприятия)
	
	КодыМероприятий = Новый Соответствие;
	КодыМероприятий.Вставить(Перечисления.ВидыМероприятийТрудовойДеятельности.Прием, 1);
	КодыМероприятий.Вставить(Перечисления.ВидыМероприятийТрудовойДеятельности.Перевод, 2);
	КодыМероприятий.Вставить(Перечисления.ВидыМероприятийТрудовойДеятельности.Переименование, 3);
	КодыМероприятий.Вставить(Перечисления.ВидыМероприятийТрудовойДеятельности.УстановлениеВторойПрофессии, 4);
	КодыМероприятий.Вставить(Перечисления.ВидыМероприятийТрудовойДеятельности.Увольнение, 5);
	КодыМероприятий.Вставить(Перечисления.ВидыМероприятийТрудовойДеятельности.ЗапретЗаниматьДолжность, 6);
	
	Возврат КодыМероприятий.Получить(ВидМероприятия);
	
КонецФункции

Функция СтруктураПолейМероприятий() Экспорт 
	
	СтруктураПолей = Новый Структура;
	Реквизиты = Метаданные.Документы.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ТабличныеЧасти.Мероприятия.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		СтруктураПолей.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат СтруктураПолей;
	
КонецФункции

Функция ПечатнаяФормаСЗВ_ТД(МассивОбъектов, ОбъектыПечати)
	
	Выборка = ВыборкаПоСотрудникам(МассивОбъектов);
	
	Возврат ЭлектронныеТрудовыеКнижки.ВывестиМакетыДокументов(Выборка, "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ПФ_MXL_ФормаСЗВ_ТД", ОбъектыПечати);;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьСотрудниковСЗВ_ТД(ПараметрыОбновления = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Сотрудники.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.Сотрудник = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	               |	И Сотрудники.УдалитьСотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();			   
				   
	Если РезультатЗапроса.Пустой() Тогда 
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(ДокументОбъект.Сотрудники, "УдалитьСотрудник");
		ФизическиеЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сотрудники, "ФизическоеЛицо");
		
		Для Каждого СтрокаСотрудника Из ДокументОбъект.Сотрудники Цикл 
			СтрокаСотрудника.Сотрудник = ФизическиеЛица[СтрокаСотрудника.УдалитьСотрудник];
		КонецЦикла;
		
		Для Каждого СтрокаМероприятия Из ДокументОбъект.Мероприятия Цикл 
			СтрокаМероприятия.Сотрудник = ФизическиеЛица[СтрокаМероприятия.УдалитьСотрудник];
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЯвляетсяСовместителемВМероприятиях(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудники КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Мероприятия КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия
		|		ПО СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Ссылка = СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Ссылка
		|			И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Сотрудник = СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Ссылка
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(МАКСИМУМ(СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.УдалитьЯвляетсяСовместителем), ЛОЖЬ) И
		|	НЕ ЕСТЬNULL(МАКСИМУМ(СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ЯвляетсяСовместителем), ИСТИНА)";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаСотрудника Из ДокументОбъект.Сотрудники Цикл
			
			МероприятияСотрудника = ДокументОбъект.Мероприятия.НайтиСтроки(Новый Структура("Сотрудник", СтрокаСотрудника.Сотрудник));
			Для Каждого СтрокаМероприятия Из МероприятияСотрудника Цикл
				СтрокаМероприятия.ЯвляетсяСовместителем = СтрокаСотрудника.УдалитьЯвляетсяСовместителем;
			КонецЦикла;
			
		КонецЦикла;
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИдМероприятий(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Мероприятия КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия
		|ГДЕ
		|	НЕ СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Ссылка В (&МассивОбновленных)
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.УдалитьИдентификатор <> """"
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.ИдМероприятия = &ПустойИдентификатор";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаМероприятия Из ДокументОбъект.Мероприятия Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаМероприятия.ИдМероприятия)
					И ЭтоУникальныйИдентификатор(СтрокаМероприятия.УдалитьИдентификатор) Тогда
					
					СтрокаМероприятия.ИдМероприятия = Новый УникальныйИдентификатор(СтрокаМероприятия.УдалитьИдентификатор);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Обновление информационной базы.Ошибка при заполнении идентификаторов мероприятий'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение, , Выборка.Ссылка, "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД");
				
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСотрудниковМероприятий(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Мероприятия КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия
		|ГДЕ
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.СотрудникЗаписи = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаМероприятия Из ДокументОбъект.Мероприятия Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаМероприятия.СотрудникЗаписи)
				И ЗначениеЗаполнено(СтрокаМероприятия.Сотрудник) Тогда
				
				СтрокаМероприятия.СотрудникЗаписи = 
					КадровыйУчет.ОсновнойСотрудникФизическогоЛица(
						СтрокаМероприятия.Сотрудник, 
						ДокументОбъект.Организация, 
						СтрокаМероприятия.ДатаМероприятия)
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВДвиженияхПризнакПринятоВПФР(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельностиПереданные КАК МероприятияТрудовойДеятельностиПереданные
		|		ПО СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка = МероприятияТрудовойДеятельностиПереданные.Регистратор
		|			И (НЕ МероприятияТрудовойДеятельностиПереданные.ПринятоВПФР)
		|ГДЕ
		|	НЕ СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка В (&МассивОбновленных)
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Проведен
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ДокументПринятВПФР
		|	И НЕ МероприятияТрудовойДеятельностиПереданные.ИдМероприятия ЕСТЬ NULL";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		СформироватьДвиженияПереданныхМероприятийНеПринятыхВПФР(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
			ПараметрыОбновления, "РегистрСведений.МероприятияТрудовойДеятельностиПереданные.НаборЗаписей", "Регистратор", Выборка.Ссылка) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.МероприятияТрудовойДеятельностиПереданные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.ПринятоВПФР = Истина;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	Если ПараметрыОбновления = Неопределено Тогда
		СформироватьДвиженияПереданныхМероприятийНеПринятыхВПФР(ПараметрыОбновления);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПереданныхМероприятийНеПринятыхВПФР(ПараметрыОбновления)
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельностиПереданные КАК МероприятияТрудовойДеятельностиПереданные
		|		ПО СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка = МероприятияТрудовойДеятельностиПереданные.Регистратор
		|			И (НЕ МероприятияТрудовойДеятельностиПереданные.ПринятоВПФР)
		|ГДЕ
		|	НЕ СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка В (&МассивОбновленных)
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Проведен
		|	И НЕ СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ДокументПринятВПФР
		|	И МероприятияТрудовойДеятельностиПереданные.ИдМероприятия ЕСТЬ NULL";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбрабатываемыеДокументы = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	ДанныеДляПроведенияДокументов = ДанныеДляПроведенияПоМероприятияТрудовойДеятельностиПереданные(ОбрабатываемыеДокументы, Истина);
	Для Каждого Регистратор Из ОбрабатываемыеДокументы Цикл
		
		МассивОбновленных.Добавить(Регистратор);
		ДанныеДляПроведения = ДанныеДляПроведенияДокументов.Получить(Регистратор);
		Если ДанныеДляПроведения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеДляПроведенияПереданныхМероприятийКорректны(ДанныеДляПроведения) Тогда
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, "РегистрСведений.МероприятияТрудовойДеятельностиПереданные.НаборЗаписей", "Регистратор", Регистратор) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.МероприятияТрудовойДеятельностиПереданные.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			
			ЭлектронныеТрудовыеКнижки.СформироватьДвиженияМероприятийТрудовойДеятельностиПереданных(НаборЗаписей, ДанныеДляПроведения);
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
		Иначе
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД", "Ссылка", Регистратор) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОбъект = Регистратор.ПолучитьОбъект();
			ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, , , РежимЗаписиДокумента.ОтменаПроведения);
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление информационной базы.Отмена проведения СЗВ-ТД'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД,
				Регистратор, НСтр("ru = 'Отменено проведение. Документ содержит незаполненные или повторяющиеся идентификаторы мероприятий'", ОбщегоНазначения.КодОсновногоЯзыка()));
				
		КонецЕсли;
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалениеСтрокБезСотрудников(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Мероприятия КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия
		|ГДЕ
		|	НЕ СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Ссылка В (&МассивОбновленных)
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДМероприятия.Сотрудник = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СрокиКУдалению = ДокументОбъект.Мероприятия.НайтиСтроки(Новый Структура("Сотрудник", Справочники.ФизическиеЛица.ПустаяСсылка()));
		Для Каждого СтрокаМероприятия Из СрокиКУдалению Цикл
			ДокументОбъект.Мероприятия.Удалить(СтрокаМероприятия);
		КонецЦикла;
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнениеПризнакаПринятоВПФРВСтрокахСотрудников(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудники КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники
		|ГДЕ
		|	НЕ СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Ссылка В (&МассивОбновленных)
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.Ссылка.ДокументПринятВПФР
		|	И НЕ СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДСотрудники.ПринятоВПФР";
	
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Ссылка);
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаСотрудника Из ДокументОбъект.Сотрудники Цикл
			СтрокаСотрудника.ПринятоВПФР = Истина;
		КонецЦикла;
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДвиженияПереданныхМероприятийНеПринятыхВПФР(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	МероприятияТрудовойДеятельностиПереданные.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.МероприятияТрудовойДеятельностиПереданные КАК МероприятияТрудовойДеятельностиПереданные
		|ГДЕ
		|	НЕ МероприятияТрудовойДеятельностиПереданные.Регистратор В (&МассивОбновленных)
		|
		|СГРУППИРОВАТЬ ПО
		|	МероприятияТрудовойДеятельностиПереданные.Регистратор
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МероприятияТрудовойДеятельностиПереданные.ПринятоВПФР) > 1";
	
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		МассивОбновленных.Добавить(Выборка.Регистратор);
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
			ПараметрыОбновления, "РегистрСведений.МероприятияТрудовойДеятельностиПереданные.НаборЗаписей", "Регистратор", Выборка.Регистратор) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.МероприятияТрудовойДеятельностиПереданные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		
		ТаблицаНабора = НаборЗаписей.Выгрузить();
		НеПринятыеСтроки = ТаблицаНабора.НайтиСтроки(Новый Структура("ПринятоВПФР", Ложь));
		Для Каждого НеПринятаяСтрока Из НеПринятыеСтроки Цикл
			ТаблицаНабора.Удалить(НеПринятаяСтрока);
		КонецЦикла;
		
		НаборЗаписей.Загрузить(ТаблицаНабора);
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ДанныеДляПроведенияДокумента(СсылкаНаДокумент) Экспорт
	
	ДанныеДляПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка.Дата КАК ДатаПередачи,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка.Организация КАК Организация,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудник КАК ФизическоеЛицо,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПродолжении КАК Заявление,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПродолженииОтмена КАК Отозвано,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТДанныеЗаявлений
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудники КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекПереданные КАК ЗаявленияОВеденииТрудовыхКнижекПереданные
		|		ПО СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудник = ЗаявленияОВеденииТрудовыхКнижекПереданные.ФизическоеЛицо
		|			И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПродолжении = ЗаявленияОВеденииТрудовыхКнижекПереданные.Заявление
		|			И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПродолженииОтмена = ЗаявленияОВеденииТрудовыхКнижекПереданные.Отозвано
		|ГДЕ
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка = &Ссылка
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ПринятоВПФР
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПродолжении <> НЕОПРЕДЕЛЕНО
		|	И ЗаявленияОВеденииТрудовыхКнижекПереданные.Заявление ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка.Дата,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка.Организация,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудник,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПредоставлении,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПредоставленииОтмена,
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.НомерСтроки
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудники КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекПереданные КАК ЗаявленияОВеденииТрудовыхКнижекПереданные
		|		ПО СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудник = ЗаявленияОВеденииТрудовыхКнижекПереданные.ФизическоеЛицо
		|			И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПредоставлении = ЗаявленияОВеденииТрудовыхКнижекПереданные.Заявление
		|			И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПредоставленииОтмена = ЗаявленияОВеденииТрудовыхКнижекПереданные.Отозвано
		|ГДЕ
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка = &Ссылка
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ПринятоВПФР
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ЗаявлениеОПредоставлении <> НЕОПРЕДЕЛЕНО
		|	И ЗаявленияОВеденииТрудовыхКнижекПереданные.Заявление ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДанныеЗаявлений.ДатаПередачи) КАК ДатаПередачи,
		|	ДанныеЗаявлений.Организация КАК Организация,
		|	ДанныеЗаявлений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеЗаявлений.Заявление КАК Заявление,
		|	ДанныеЗаявлений.Отозвано КАК Отозвано,
		|	МИНИМУМ(ДанныеЗаявлений.НомерСтроки) КАК НомерСтроки
		|ИЗ
		|	ВТДанныеЗаявлений КАК ДанныеЗаявлений
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеЗаявлений.Организация,
		|	ДанныеЗаявлений.ФизическоеЛицо,
		|	ДанныеЗаявлений.Заявление,
		|	ДанныеЗаявлений.Отозвано";
	
	ДанныеДляПроведения.Вставить("ЗаявленияОВеденииТрудовыхКнижекПереданные", Запрос.Выполнить().Выгрузить());
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Функция ДанныеДляПроведенияПоМероприятияТрудовойДеятельностиПереданные(СсылкаНаДокумент, ТолькоПроведенные = Ложь) Экспорт
	
	ДанныеДляПроведения = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.ИдМероприятия КАК ИдМероприятия,
		|	ВЫБОР
		|		КОГДА ТаблицаДокумента.ДатаОтмены = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Отменено,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ТаблицаДокумента.ТрудоваяФункция.Описание = """"
		|				ТОГДА ТаблицаДокумента.ТрудоваяФункция.Наименование
		|			ИНАЧЕ ТаблицаДокумента.ТрудоваяФункция.Описание
		|		КОНЕЦ, """") КАК ТрудоваяФункцияОписание,
		|	ЕСТЬNULL(ТаблицаДокумента.ТрудоваяФункция.КодПрофессиональнойДеятельности, """") КАК ТрудоваяФункцияКод,
		|	ТаблицаДокумента.Сведения КАК Сведения,
		|	ТаблицаДокумента.ПредставлениеДолжности КАК ПредставлениеДолжности,
		|	ТаблицаДокумента.ПредставлениеПодразделения КАК ПредставлениеПодразделения,
		|	ТаблицаДокумента.ОснованиеУвольненияТекстОснования КАК ОснованиеУвольненияТекстОснования,
		|	ТаблицаДокумента.ОснованиеУвольненияСтатья КАК ОснованиеУвольненияСтатья,
		|	ТаблицаДокумента.ОснованиеУвольненияЧасть КАК ОснованиеУвольненияЧасть,
		|	ТаблицаДокумента.ОснованиеУвольненияПункт КАК ОснованиеУвольненияПункт,
		|	ТаблицаДокумента.ОснованиеУвольненияПодПункт КАК ОснованиеУвольненияПодПункт,
		|	ТаблицаДокумента.ОписаниеДолжности КАК ОписаниеДолжности,
		|	ТаблицаСотрудниковДокумента.ПринятоВПФР КАК ПринятоВПФР
		|ПОМЕСТИТЬ ВТДанныеМероприятий
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Мероприятия КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Сотрудники КАК ТаблицаСотрудниковДокумента
		|		ПО ТаблицаДокумента.Ссылка = ТаблицаСотрудниковДокумента.Ссылка
		|			И ТаблицаДокумента.Сотрудник = ТаблицаСотрудниковДокумента.Сотрудник
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&Ссылка)
		|	И &ТолькоПроведенные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДанныеМероприятий.ПринятоВПФР) КАК ПринятоВПФР,
		|	ДанныеМероприятий.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТПринятостьМероприятий
		|ИЗ
		|	ВТДанныеМероприятий КАК ДанныеМероприятий
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеМероприятий.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеМероприятий.Ссылка КАК Ссылка,
		|	ДанныеМероприятий.ИдМероприятия КАК ИдМероприятия,
		|	ДанныеМероприятий.Отменено КАК Отменено,
		|	ДанныеМероприятий.ТрудоваяФункцияОписание КАК ТрудоваяФункцияОписание,
		|	ДанныеМероприятий.ТрудоваяФункцияКод КАК ТрудоваяФункцияКод,
		|	ДанныеМероприятий.Сведения КАК Сведения,
		|	ДанныеМероприятий.ПредставлениеДолжности КАК ПредставлениеДолжности,
		|	ДанныеМероприятий.ПредставлениеПодразделения КАК ПредставлениеПодразделения,
		|	ДанныеМероприятий.ОснованиеУвольненияТекстОснования КАК ОснованиеУвольненияТекстОснования,
		|	ДанныеМероприятий.ОснованиеУвольненияСтатья КАК ОснованиеУвольненияСтатья,
		|	ДанныеМероприятий.ОснованиеУвольненияЧасть КАК ОснованиеУвольненияЧасть,
		|	ДанныеМероприятий.ОснованиеУвольненияПункт КАК ОснованиеУвольненияПункт,
		|	ДанныеМероприятий.ОснованиеУвольненияПодПункт КАК ОснованиеУвольненияПодПункт,
		|	ДанныеМероприятий.ОписаниеДолжности КАК ОписаниеДолжности,
		|	ДанныеМероприятий.ПринятоВПФР КАК ПринятоВПФР
		|ИЗ
		|	ВТДанныеМероприятий КАК ДанныеМероприятий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПринятостьМероприятий КАК ПринятостьМероприятий
		|		ПО ДанныеМероприятий.Ссылка = ПринятостьМероприятий.Ссылка
		|			И ДанныеМероприятий.ПринятоВПФР = ПринятостьМероприятий.ПринятоВПФР
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	
	Если ТолькоПроведенные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоПроведенные", "ТаблицаДокумента.Ссылка.Проведен");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоПроведенные", "ИСТИНА");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ДвиженияДокумента = Новый Массив;
		ДанныеДляПроведения.Вставить(Выборка.Ссылка, ДвиженияДокумента);
		
		Пока Выборка.Следующий() Цикл
			Запись = ЭлектронныеТрудовыеКнижки.ЗаписьДвиженияМероприятияТрудовойДеятельностиПереданные(Выборка);
			ДвиженияДокумента.Добавить(Запись);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Процедура СформироватьНаборыЗаписейМероприятияТрудовойДеятельностиПереданные(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленныхПереданных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленныхПереданных") Тогда
			МассивОбновленныхПереданных = ПараметрыОбновления.МассивОбновленныхПереданных;
		Иначе
			МассивОбновленныхПереданных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленныхПереданных", МассивОбновленныхПереданных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленныхПереданных", МассивОбновленныхПереданных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ТаблицаДокумента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Мероприятия КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельностиПереданные КАК МероприятияТрудовойДеятельностиПереданные
		|		ПО ТаблицаДокумента.ИдМероприятия = МероприятияТрудовойДеятельностиПереданные.ИдМероприятия
		|			И (ВЫБОР
		|				КОГДА ТаблицаДокумента.ДатаОтмены = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ = МероприятияТрудовойДеятельностиПереданные.Отменено)
		|ГДЕ
		|	НЕ ТаблицаДокумента.Ссылка В (&МассивОбновленныхПереданных)
		|	И ТаблицаДокумента.Ссылка.Проведен
		|	И МероприятияТрудовойДеятельностиПереданные.ИдМероприятия ЕСТЬ NULL";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	ОбрабатываемыеДокументы = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	ДанныеДляПроведенияДокументов = ДанныеДляПроведенияПоМероприятияТрудовойДеятельностиПереданные(ОбрабатываемыеДокументы, Истина);
	Для Каждого Регистратор Из ОбрабатываемыеДокументы Цикл
		
		МассивОбновленныхПереданных.Добавить(Регистратор);
		ДанныеДляПроведения = ДанныеДляПроведенияДокументов.Получить(Регистратор);
		Если ДанныеДляПроведения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.МероприятияТрудовойДеятельностиПереданные.НаборЗаписей", "Регистратор", Регистратор) Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.МероприятияТрудовойДеятельностиПереданные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
		
		Для Каждого Запись Из ДанныеДляПроведения Цикл
			Если Не ЗначениеЗаполнено(Запись.ИдМероприятия) Тогда
				Запись.ИдМероприятия = Новый УникальныйИдентификатор;
			КонецЕсли;
		КонецЦикла;
		
		ЭлектронныеТрудовыеКнижки.СформироватьДвиженияМероприятийТрудовойДеятельностиПереданных(НаборЗаписей, ДанныеДляПроведения);
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоУникальныйИдентификатор(Знач Идентификатор)
	
	Идентификатор = СокрЛП(Идентификатор);
	Если СтрДлина(Идентификатор) <> 36 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Сред(Идентификатор, 9, 1) <> "-"
		Или Сред(Идентификатор, 14, 1) <> "-"
		Или Сред(Идентификатор, 19, 1) <> "-"
		Или Сред(Идентификатор, 24, 1) <> "-" Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Идентификатор = СтрЗаменить(Идентификатор, "-", "");
	
	ДопустимыеСимволы = "0123456789abcdefABCDEF";
	Для НомерСимвола = 1 По СтрДлина(Идентификатор) Цикл
		
		ТестируемыйСимвол = Сред(Идентификатор, НомерСимвола, 1);
		Если СтрНайти(ДопустимыеСимволы, ТестируемыйСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ДанныеДляПроведенияПереданныхМероприятийКорректны(ДанныеДляПроведения)
	
	СоответствиеИдентификаторов = Новый Соответствие;
	Для Каждого ДанныеМероприятия Из ДанныеДляПроведения Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеМероприятия.ИдМероприятия) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ДанныеИдентификатора = СоответствиеИдентификаторов.Получить(ДанныеМероприятия.ИдМероприятия);
		Если ДанныеИдентификатора = Неопределено Тогда
			ДанныеИдентификатора = Новый Соответствие;
			СоответствиеИдентификаторов.Вставить(ДанныеМероприятия.ИдМероприятия, ДанныеИдентификатора);
		КонецЕсли;
		
		ДанныеОтмененности = ДанныеИдентификатора.Получить(ДанныеМероприятия.Отменено);
		Если ДанныеОтмененности <> Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ДанныеИдентификатора.Вставить(ДанныеМероприятия.Отменено, Истина);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#Область ИмпортСЗВТДИПротоколовПриема

// Заполняет документ данными из переданных ранее файлов СЗВ-ТД
//
Функция ЗаполнитьПоДаннымФайла(ДокументОбъект, АдресДанныхСЗВТД, ИмяФайла, Отказ) Экспорт
	
	ДеревоXML = ЭлектронныеТрудовыеКнижки.ДанныеXMLФайла(АдресДанныхСЗВТД, ИмяФайла);
	
	Если Не ЭтоДанныеСЗВТД(ДеревоXML) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не известный формат файла (%1).'"), ИмяФайла);
	КонецЕсли;
	
	ЗаявленияСотрудников = Новый ТаблицаЗначений;
	ЗаявленияСотрудников.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ЗаявленияСотрудников.Колонки.Добавить("ВидЗаявления", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности"));
	ЗаявленияСотрудников.Колонки.Добавить("СтатусЗаявления", Новый ОписаниеТипов("Число"));
	ЗаявленияСотрудников.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ЗаявленияСотрудников.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	
	ДокументОбъект.Дата = ДатаИзСтроки(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/ДатаЗаполнения"));
	ДокументОбъект.Руководитель = РуководительПоФИО(
		ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/Руководитель/ФИО/Фамилия"),
		ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/Руководитель/ФИО/Имя"),
		ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/Руководитель/ФИО/Отчество"));
	
	ДокументОбъект.ДолжностьРуководителя = ДолжностьПоНаименованию(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/Руководитель/Должность"));
	
	РегистрационныйНомерПФР = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/Работодатель/РегНомер");
	ДокументОбъект.Организация = ЭлектронныеТрудовыеКнижкиПовтИсп.ОрганизацияПоРегистрационномуНомеруПФР(РегистрационныйНомерПФР);
	
	ОтчетныйГод = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/ОтчетныйПериод/КалендарныйГод");
	ОтчетныйМесяц = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/ОтчетныйПериод/Месяц");
	ДокументОбъект.ОтчетныйПериод = Дата(
		СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОтчетныйГод),
		СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ОтчетныйМесяц),
		1);
	
	ПринятыйФайл = Новый Файл(ИмяФайла);
	ДокументОбъект.ИмяФайлаДляПФР = ПринятыйФайл.ИмяБезРасширения;
	ДокументОбъект.ФайлСформирован = Истина;
	
	ЗаполняемыеЗначения = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения);
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗаполняемыеЗначения);
	ДокументОбъект.Комментарий = НСтр("ru = 'Импортирован'") + ": " + Формат(ТекущаяДатаСеанса(), "ДЛФ=D");
	
	ЗЛ = ЭлектронныеТрудовыеКнижки.КоллекцияОбъектовXDTO(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД"), "ЗЛ");
	
	Для Каждого ОбъектЗЛ Из ЗЛ Цикл
		
		СтрокаСотрудники = ДокументОбъект.Сотрудники.Добавить();
		СтрокаСотрудники.СтраховойНомерПФР = ОбъектЗЛ.СНИЛС;
		СтрокаСотрудники.ДатаРождения = ДатаИзСтроки(ОбъектЗЛ.ДатаРождения);
		
		СтрокаСотрудники.Фамилия = ЧастьФИОИзСтроки(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектЗЛ, "Фамилия"));
		СтрокаСотрудники.Имя = ЧастьФИОИзСтроки(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектЗЛ, "Имя"));
		СтрокаСотрудники.Отчество = ЧастьФИОИзСтроки(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектЗЛ, "Отчество"));
		
		СтрокаСотрудники.Сотрудник = ФизическоеЛицоПоСНИЛС(СтрокаСотрудники.СтраховойНомерПФР);
		Если ЗначениеЗаполнено(СтрокаСотрудники.Сотрудник) Тогда
			
			Заявления = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектЗЛ, "Заявления");
			Если Заявления <> Неопределено Тогда
				
				ВидЗаявления = Неопределено;
				
				ЗаявлениеОПродолжении = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(Заявления, "ЗаявлениеОПродолжении");
				Если ЗаявлениеОПродолжении <> Неопределено Тогда
					
					ВидЗаявления = Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.ВедениеБумажнойТрудовойКнижки;
					СтатусЗаявления = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ЗаявлениеОПродолжении, "СтатусЗаявленияОПродолжении");
					ДатаЗаявления = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ЗаявлениеОПродолжении, "Дата");
					
				Иначе
					
					ЗаявлениеОПредоставлении = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(Заявления, "ЗаявлениеОПредоставлении");
					Если ЗаявлениеОПредоставлении <> Неопределено Тогда
						
						ВидЗаявления = Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.СведенияОТрудовойДеятельностиВЭлектроннойФорме;
						СтатусЗаявления = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ЗаявлениеОПредоставлении, "СтатусЗаявленияОПредоставлении");
						ДатаЗаявления = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ЗаявлениеОПредоставлении, "Дата");
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВидЗаявления) Тогда
					
					СтрокаЗаявленияСотрудников = ЗаявленияСотрудников.Добавить();
					СтрокаЗаявленияСотрудников.Сотрудник = СтрокаСотрудники.Сотрудник;
					СтрокаЗаявленияСотрудников.ВидЗаявления = ВидЗаявления;
					СтрокаЗаявленияСотрудников.СтатусЗаявления = СтатусЗаявления;
					СтрокаЗаявленияСотрудников.Дата = ДатаИзСтроки(ДатаЗаявления);
					СтрокаЗаявленияСотрудников.НомерСтроки = СтрокаСотрудники.НомерСтроки;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Мероприятия = ЭлектронныеТрудовыеКнижки.КоллекцияОбъектовXDTO(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектЗЛ, "ТрудоваяДеятельность"), "Мероприятие");
			Если Мероприятия <> Неопределено Тогда
				
				Для Каждого ОбъектМероприятия Из Мероприятия Цикл
					
					СтрокаМероприятия = ДокументОбъект.Мероприятия.Добавить();
					СтрокаМероприятия.Сотрудник = СтрокаСотрудники.Сотрудник;
					
					ИдМероприятияСтрокой = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "UUID");
					Если ЗначениеЗаполнено(ИдМероприятияСтрокой) Тогда
						СтрокаМероприятия.ИдМероприятия = Новый УникальныйИдентификатор(ИдМероприятияСтрокой);
					КонецЕсли;
					
					СтрокаМероприятия.ДатаМероприятия = ДатаИзСтроки(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Дата"));
					СтрокаМероприятия.ВидМероприятия = ВидМероприятия(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Вид"));
					
					СтрокаМероприятия.Сведения = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Сведения");
					
					СтрокаМероприятия.НаименованиеДокументаОснования = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Основание/Наименование");
					СтрокаМероприятия.ДатаДокументаОснования = ДатаИзСтроки(ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Основание/Дата"));
					СтрокаМероприятия.СерияДокументаОснования = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Основание/Серия");
					СтрокаМероприятия.НомерДокументаОснования = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Основание/Номер");
					
					СтрокаМероприятия.ЯвляетсяСовместителем = (ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "ЯвляетсяСовместителем") = "1");
					
					Если СтрокаМероприятия.ВидМероприятия = Перечисления.ВидыМероприятийТрудовойДеятельности.УстановлениеВторойПрофессии Тогда
						СтрокаМероприятия.ОписаниеДолжности = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Должность");
					Иначе
						СтрокаМероприятия.ПредставлениеДолжности = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Должность");
					КонецЕсли;
					
					СтрокаМероприятия.ПредставлениеПодразделения = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "СтруктурноеПодразделение");
					СтрокаМероприятия.ОснованиеУвольненияТекстОснования = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "Причина");
					СтрокаМероприятия.ОснованиеУвольненияСтатья = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "ОснованиеУвольнения/Статья");
					СтрокаМероприятия.ОснованиеУвольненияЧасть = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "ОснованиеУвольнения/Часть");
					СтрокаМероприятия.ОснованиеУвольненияПункт = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "ОснованиеУвольнения/Пункт");
					СтрокаМероприятия.ОснованиеУвольненияПодПункт = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ОбъектМероприятия, "ОснованиеУвольнения/Подпункт");
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			ФИО = Новый Массив;
			ФИО.Добавить(СтрокаСотрудники.Фамилия);
			ФИО.Добавить(СтрокаСотрудники.Имя);
			Если ЗначениеЗаполнено(СтрокаСотрудники.Отчество) Тогда
				ФИО.Добавить(СтрокаСотрудники.Отчество);
			КонецЕсли;
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Не найден сотрудник %1 (%2), СНИЛС: %3'"),
				СтрСоединить(ФИО, " "),
				Формат(СтрокаСотрудники.ДатаРождения, "ДЛФ=D"),
				СтрокаСотрудники.СтраховойНомерПФР);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДозаполнитьМероприятияДокумента(ДокументОбъект, Отказ);
	ДозаполнитьЗаявленияДокумента(ДокументОбъект, ЗаявленияСотрудников, Отказ);
	
КонецФункции

// Читает протокол приема файла СЗВ-ТД в ПФР
//
Функция ПрочитатьПротоколПриема(ДокументОбъект, АдресДанныхПротоколаПриемки, ИмяФайла) Экспорт
	
	ФайлСведений = ПолучитьИзВременногоХранилища(АдресДанныхПротоколаПриемки);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
	ФайлСведений.Записать(ИмяВременногоФайла);
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
		ДеревоXML = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		ЧтениеXML.Закрыть();
	Исключение
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось прочитать файл (%1).'"), ИмяФайла);
	КонецПопытки;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Чтение протокола приема СЗВ-ТД'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Попытка
		
		КодФормы = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "УПП/ПроверяемыйДокумент/КодФормы");
		ИмяФайлаПротокола = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "УПП/ПроверяемыйДокумент/Файл/ИмяФайла");
		РегистрационныйНомерПФР = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СлужебнаяИнформация/Контрагент/РегистрационныйНомер");
		РезультатПроверки = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СлужебнаяИнформация/РезультатПроверки");
		
	Исключение
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не известный формат файла (%1).'"), ИмяФайла);
	КонецПопытки;
	
	Если КодФормы <> "СЗВ-ТД"
		Или ИмяФайлаПротокола = Неопределено Тогда
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не известный формат файла (%1).'"), ИмяФайла);
		
	КонецЕсли;
	
	Если СтрНайти(ВРег(ИмяФайлаПротокола), ВРег(ДокументОбъект.ИмяФайлаДляПФР)) = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Файл протокола предназначен для другого документа.'");
	КонецЕсли;
	
	ДанныеОрганизации = ПерсонифицированныйУчет.СведенияОбОрганизации(
		ДокументОбъект.Организация, КонецМесяца(ДокументОбъект.ОтчетныйПериод));
	
	Если ЗначениеЗаполнено(РезультатПроверки)
		И ДанныеОрганизации.РегистрационныйНомерПФР <> РегистрационныйНомерПФР Тогда
		
		ВызватьИсключение НСтр("ru = 'Файл содержит данные для другого страхователя'");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РезультатПроверки) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Файл не содержит результатов приема'"));
	КонецЕсли;
	
	ОшибкиДокумента = Новый Соответствие;
	
	ДеревоСведений = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "УПП/ПроверочныйМодуль/ПроверкаФайлов");
	СписокФайлов = ЭлектронныеТрудовыеКнижки.КоллекцияОбъектовXDTO(ДеревоСведений, "Файл");
	Для Каждого ДанныеФайла Из СписокФайлов Цикл
		
		ИмяПринятогоФайла = ДанныеФайла.ИмяФайла;
		КоллекцияРезультатов = ЭлектронныеТрудовыеКнижки.КоллекцияОбъектовXDTO(ДанныеФайла, "Результат");
		Для Каждого Результат Из КоллекцияРезультатов Цикл
			
			БлокиПроверки = ЭлектронныеТрудовыеКнижки.КоллекцияОбъектовXDTO(Результат, "БлокПроверок");
			Для Каждого БлокПроверок Из БлокиПроверки Цикл
				
				Проверки = ЭлектронныеТрудовыеКнижки.КоллекцияОбъектовXDTO(БлокПроверок, "Проверка");
				Для Каждого Проверка Из Проверки Цикл
					
					Если Проверка.КодРезультата <> "00" Тогда
						
						ОшибкиПроверки = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(Проверка, "Ошибки");
						Если ОшибкиПроверки <> Неопределено Тогда
							
							Ошибки = ЭлектронныеТрудовыеКнижки.КоллекцияОбъектовXDTO(ОшибкиПроверки, "Ошибка");
							Для Каждого Ошибка Из Ошибки Цикл
								
								КлючОшибки = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(Ошибка, "Объект/Значение");
								Если КлючОшибки = Неопределено Тогда
									КлючОшибки = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(Ошибка, "ОжидаемоеЗначение");
								КонецЕсли;
								
								ОшибкиОбъекта = ОшибкиДокумента.Получить(КлючОшибки);
								Если ОшибкиОбъекта = Неопределено Тогда
									ОшибкиОбъекта = Новый Соответствие;
									ОшибкиДокумента.Вставить(КлючОшибки, ОшибкиОбъекта);
								КонецЕсли;
								
								ОшибкиПроверки = ОшибкиОбъекта.Получить(Проверка.ОписаниеПроверки);
								Если ОшибкиПроверки = Неопределено Тогда
									ОшибкиПроверки = Новый Массив;
									ОшибкиОбъекта.Вставить(Проверка.ОписаниеПроверки, ОшибкиПроверки);
								КонецЕсли;
								
								ОшибкиПроверки.Добавить(Новый Структура("ПутьДоЭлемента,КодРезультата", Ошибка.ПутьДоЭлемента, Проверка.КодРезультата));
								
							КонецЦикла;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДанныеФормыСтруктура") Тогда
		
		Если ДокументОбъект.Сотрудники.Количество() > 0
			И ТипЗнч(ДокументОбъект.Сотрудники[0]) = Тип("ДанныеФормыЭлементКоллекции")
			И ДокументОбъект.Сотрудники[0].Свойство("СообщенияМероприятий") Тогда
			
			Для Каждого СтрокаСотрудника Из ДокументОбъект.Сотрудники Цикл
				СтрокаСотрудника.СообщенияМероприятий.Очистить();
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СотрудникиСОшибками = Новый Соответствие;
	ОшибкиСотрудников = Новый Соответствие;
	Если ОшибкиДокумента.Количество() > 0 Тогда
		
		Для Каждого ОшибкиОбъекта Из ОшибкиДокумента Цикл
			
			Для Каждого ОшибкиПроверки Из ОшибкиОбъекта.Значение Цикл
				
				Для Каждого ДанныеОшибки Из ОшибкиПроверки.Значение Цикл
					
					ТекстСообщения = "";
					Поле = "";
					ПутиКДанным = ПутьКДаннымОшибки(ДанныеОшибки.ПутьДоЭлемента);
					Сотрудник = Неопределено;
					
					ТекстСообщенияМероприятия = "";
					ПутьМероприятия = "";
					
					Для Каждого ПутьКДанным Из ПутиКДанным Цикл
						
						Если ПустаяСтрока(ТекстСообщения) Тогда
							
							Если СтрНачинаетсяС(ПутьКДанным.ИмяЭлемента, "ЗЛ") Тогда
								
								СтрокаСотрудника = Неопределено;
								Если ЗначениеЗаполнено(ПутьКДанным.НомерСтроки) Тогда
									
									СтрокиСотрудника = ДокументОбъект.Сотрудники.НайтиСтроки(Новый Структура("НомерСтроки", ПутьКДанным.НомерСтроки));
									Если СтрокиСотрудника.Количество() > 0 Тогда
										
										СтрокаСотрудника = СтрокиСотрудника[0];
										Сотрудник = СтрокаСотрудника.Сотрудник;
										
									КонецЕсли;
									
								КонецЕсли;
								
								Если СтрокаСотрудника = Неопределено Тогда
									ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке'") + " " + ПутьКДанным.НомерСтроки) + " " + ОшибкиПроверки.Ключ;
								Иначе
									ТекстСообщения = Строка(СтрокаСотрудника.Сотрудник) + ": " + ОшибкиПроверки.Ключ;
								КонецЕсли;
								
							Иначе
								ТекстСообщения = ТекстСообщения + ОшибкиПроверки.Ключ;
							КонецЕсли;
							
						ИначеЕсли ПутьКДанным.ИмяЭлемента = "Мероприятие"
							Или ПутьКДанным.ИмяЭлемента = "МероприятиеОтменяемое" Тогда
							
							Если ЗначениеЗаполнено(Сотрудник) И ЗначениеЗаполнено(ПутьКДанным.НомерСтроки) Тогда
								
								МероприятияСотрудника = ДокументОбъект.Мероприятия.Выгрузить(Новый Структура("Сотрудник", СОтрудник));
								Если ПутьКДанным.НомерСтроки <= МероприятияСотрудника.Количество() Тогда
									
									СтрокаМероприятий = МероприятияСотрудника[ПутьКДанным.НомерСтроки - 1];
									Если ЗначениеЗаполнено(СтрокаМероприятий.ДатаОтмены) Тогда
										
										ТекстМероприятия = СтрШаблон(
											НСтр("ru = 'Строка %1, %2, от %3, отменено %4'"),
											ПутьКДанным.НомерСтроки,
											СтрокаМероприятий.ВидМероприятия,
											Формат(СтрокаМероприятий.ДатаМероприятия, "ДЛФ=D"),
											Формат(СтрокаМероприятий.ДатаОтмены, "ДЛФ=D"));
										
									Иначе
										
										ТекстМероприятия = СтрШаблон(
											НСтр("ru = 'Строка %1, %2, от %3'"),
											ПутьКДанным.НомерСтроки,
											СтрокаМероприятий.ВидМероприятия,
											Формат(СтрокаМероприятий.ДатаМероприятия, "ДЛФ=D"));
										
									КонецЕсли;
									
									ТекстСообщения = ТекстСообщения + " (" + ТекстМероприятия + ")";
									
								КонецЕсли;
								
								ТекстыПредставленияОшибки = СтрРазделить(ОшибкиПроверки.Ключ, ".");
								Если ТекстыПредставленияОшибки.Количество() > 0 Тогда
									ТекстСообщенияМероприятия = СокрЛП(ТекстыПредставленияОшибки[ТекстыПредставленияОшибки.Количество() - 1]);
									ПутьМероприятия = "Мероприятия[" + Формат(ПутьКДанным.НомерСтроки - 1, "ЧН=; ЧГ=") + "].ВидМероприятия";
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						ОписаниеДанных = ОписаниеДанных().Получить(ПутьКДанным.ИмяЭлемента);
						Если ЗначениеЗаполнено(ОписаниеДанных) Тогда
							
							Если ОписаниеДанных.Множественное
								И ЗначениеЗаполнено(ПутьКДанным.НомерСтроки)
								И СтрНайти(ОписаниеДанных.Путь, "%") > 0 Тогда
								
								Поле = Поле + СтрШаблон(ОписаниеДанных.Путь, Формат(ПутьКДанным.НомерСтроки - 1, "ЧН=; ЧГ="));
								
							Иначе
								Поле = Поле + ОписаниеДанных.Путь;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если ЗначениеЗаполнено(Сотрудник) Тогда
						
						Если ЗначениеЗаполнено(ДанныеОшибки.КодРезультата) Тогда
							
							КодРезультата = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ДанныеОшибки.КодРезультата);
							Если КодРезультата >= 30 Тогда
								СотрудникиСОшибками.Вставить(Сотрудник, Истина);
							КонецЕсли;
							
						КонецЕсли;
						
						ОшибкиСотрудника = ОшибкиСотрудников.Получить(Сотрудник);
						Если ОшибкиСотрудника = Неопределено Тогда
							ОшибкиСотрудника = Новый Массив;
							ОшибкиСотрудников.Вставить(Сотрудник, ОшибкиСотрудника);
						КонецЕсли;
						
						ОшибкиСотрудника.Добавить(Новый Структура("ТекстСообщения,Поле", ТекстСообщения, Поле));
						
						Если ЗначениеЗаполнено(ТекстСообщенияМероприятия) Тогда
							
							Если ТипЗнч(СтрокаСотрудника) = Тип("ДанныеФормыЭлементКоллекции")
								И СтрокаСотрудника.Свойство("СообщенияМероприятий") Тогда
								
								СтрокаСотрудника.СообщенияМероприятий.Добавить(ПутьМероприятия, ТекстСообщенияМероприятия);
								
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка, Поле, "Объект");
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если РезультатПроверки = НСтр("ru = 'Документ не принят'") Тогда
		ДокументОбъект.ДокументПринятВПФР = Ложь;
	ИначеЕсли РезультатПроверки = НСтр("ru = 'Документ принят'") Тогда
		ДокументОбъект.ДокументПринятВПФР = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаСотрудники Из ДокументОбъект.Сотрудники Цикл
		
		Если РезультатПроверки = НСтр("ru = 'Документ принят'") Тогда
			СтрокаСотрудники.ПринятоВПФР = Истина;
		ИначеЕсли РезультатПроверки = НСтр("ru = 'Документ принят частично'") Тогда
			
			Если СотрудникиСОшибками.Получить(СтрокаСотрудники.Сотрудник) = Неопределено Тогда
				СтрокаСотрудники.ПринятоВПФР = Истина;
			КонецЕсли;
			
		ИначеЕсли РезультатПроверки = НСтр("ru = 'Документ не принят'") Тогда
			СтрокаСотрудники.ПринятоВПФР = Ложь;
		КонецЕсли;
		
		ОшибкиСотрудника = ОшибкиСотрудников.Получить(СтрокаСотрудники.Сотрудник);
		Если ОшибкиСотрудника <> Неопределено Тогда
			
			Для Каждого ОписаниеОшибки Из ОшибкиСотрудника Цикл
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки.ТекстСообщения, ДокументОбъект.Ссылка, ОписаниеОшибки.Поле, "Объект");
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Проверяет, что данные XML соответствуют формату файлов СЗВ-ТД
//
Функция ЭтоДанныеСЗВТД(ДеревоXML) Экспорт
	
	Попытка
		
		КодФормы = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД");
		ЗЛ = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/ЗЛ");
		РегистрационныйНомерПФР = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СЗВ_ТД/Работодатель/РегНомер");
		
		Если КодФормы = Неопределено
			Или ЗЛ = Неопределено
			Или РегистрационныйНомерПФР = Неопределено Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Проверяет, что данные XML соответствуют формату файлов протоколов приема СЗВ-ТД
//
Функция ЭтоДанныеПротоколаПриемаСЗВТД(ДеревоXML) Экспорт
	
	Попытка
		
		КодФормы = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "УПП/ПроверяемыйДокумент/КодФормы");
		ИмяФайлаПротокола = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "УПП/ПроверяемыйДокумент/Файл/ИмяФайла");
		РегистрационныйНомерПФР = ЭлектронныеТрудовыеКнижки.ПолучитьСвойствоXDTO(ДеревоXML, "СлужебнаяИнформация/Контрагент/РегистрационныйНомер");
		
		Если КодФормы = Неопределено
			Или ИмяФайлаПротокола = Неопределено
			Или РегистрационныйНомерПФР = Неопределено Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Если КодФормы <> "СЗВ-ТД"
		Или ИмяФайлаПротокола = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Возвращает ссылку на документ по имени файла сведений
//
Функция ДокументПоИмениФайла(ИмяФайла) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД КАК СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД
		|ГДЕ
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ИмяФайлаДляПФР ПОДОБНО &ИмяФайлаДляПФР
		|	И СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.Проведен,
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ИмяФайлаДляПФР", СтрЗаменить(ВРег(ИмяФайла), ".XML", ""));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДатаИзСтроки(ДатаСтрокой)
	
	СоставДаты = СтрРазделить(ДатаСтрокой, "-");
	
	Если СоставДаты.Количество() = 3 Тогда
		Возврат Дата(СоставДаты[0], СоставДаты[1], СоставДаты[2]);
	КонецЕсли;
	
	Возврат '00010101';
	
КонецФункции

Функция ЧастьФИОИзСтроки(Знач ЧастьФИО)
	
	СловаЧастиФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ЧастьФИО);
	
	Для Каждого СловоЧастиФИО Из СловаЧастиФИО Цикл
		ЧастьФИО = СтрЗаменить(ЧастьФИО, СловоЧастиФИО, Лев(СловоЧастиФИО, 1) + НРег(Сред(СловоЧастиФИО, 2)));
	КонецЦикла;
	
	Возврат ЧастьФИО;
	
КонецФункции

Функция ФизическоеЛицоПоСНИЛС(СНИЛС)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтраховойНомерПФР", СНИЛС);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.СтраховойНомерПФР = &СтраховойНомерПФР";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВидМероприятия(НомерВидаМероприятия)
	
	ВидПоНомеруМероприятия = Новый Соответствие;
	
	ВидПоНомеруМероприятия.Вставить("1", Перечисления.ВидыМероприятийТрудовойДеятельности.Прием);
	ВидПоНомеруМероприятия.Вставить("2", Перечисления.ВидыМероприятийТрудовойДеятельности.Перевод);
	ВидПоНомеруМероприятия.Вставить("3", Перечисления.ВидыМероприятийТрудовойДеятельности.Переименование);
	ВидПоНомеруМероприятия.Вставить("4", Перечисления.ВидыМероприятийТрудовойДеятельности.УстановлениеВторойПрофессии);
	ВидПоНомеруМероприятия.Вставить("5", Перечисления.ВидыМероприятийТрудовойДеятельности.Увольнение);
	ВидПоНомеруМероприятия.Вставить("6", Перечисления.ВидыМероприятийТрудовойДеятельности.ЗапретЗаниматьДолжность);
	
	Возврат ВидПоНомеруМероприятия.Получить(НомерВидаМероприятия);
	
КонецФункции

Функция РуководительПоФИО(Фамилия, Имя, Отчество)
	
	Руководитель = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПохожиеФизическиеЛица = СотрудникиФормы.ПодобратьСписокФизЛиц(Неопределено, Фамилия, Имя, Отчество);
	Если ПохожиеФизическиеЛица.ДанныеФизическихЛицДоступны И ПохожиеФизическиеЛица.ДанныеФизическихЛиц.Количество() > 0 Тогда
		Руководитель = ПохожиеФизическиеЛица.ДанныеФизическихЛиц[0].ФизическоеЛицо;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Руководитель;
	
КонецФункции

Функция ДолжностьПоНаименованию(НаименованиеДолжности)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", НаименованиеДолжности);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должности.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Должности КАК Должности
		|ГДЕ
		|	Должности.Наименование = &Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДозаполнитьМероприятияДокумента(ДокументОбъект, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Мероприятия", ДокументОбъект.Мероприятия.Выгрузить(, "Сотрудник,ДатаМероприятия,ИдМероприятия,ДатаОтмены"));
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадры.ГоловнаяОрганизация(ДокументОбъект.Организация));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Мероприятия.Сотрудник КАК ФизическоеЛицо,
		|	Мероприятия.ДатаМероприятия КАК ДатаМероприятия,
		|	Мероприятия.ИдМероприятия КАК ИдМероприятия,
		|	Мероприятия.ДатаОтмены КАК ДатаОтмены
		|ПОМЕСТИТЬ ВТФизическиеЛицаМероприятий
		|ИЗ
		|	&Мероприятия КАК Мероприятия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	ФизическиеЛицаМероприятий.ДатаМероприятия КАК ДатаНачала,
		|	ФизическиеЛицаМероприятий.ДатаМероприятия КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТДляСЗВТДСотрудникиПериоды
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛицаМероприятий КАК ФизическиеЛицаМероприятий
		|		ПО Сотрудники.ФизическоеЛицо = ФизическиеЛицаМероприятий.ФизическоеЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
		|		ПО Сотрудники.Ссылка = ТекущиеКадровыеДанныеСотрудников.Сотрудник
		|			И (ТекущиеКадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору)
		|ГДЕ
		|	Сотрудники.ГоловнаяОрганизация = &ГоловнаяОрганизация
		|	И ТекущиеКадровыеДанныеСотрудников.ДатаПриема <= ФизическиеЛицаМероприятий.ДатаМероприятия
		|	И (ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения >= ФизическиеЛицаМероприятий.ДатаМероприятия
		|			ИЛИ ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МероприятияТрудовойДеятельности.ФизическоеЛицо КАК Сотрудник,
		|	МероприятияТрудовойДеятельности.Организация КАК Организация,
		|	МероприятияТрудовойДеятельности.ИдМероприятия КАК ИдМероприятия,
		|	МероприятияТрудовойДеятельности.Отменено КАК Отменено,
		|	МероприятияТрудовойДеятельности.Сотрудник КАК СотрудникЗаписи,
		|	МероприятияТрудовойДеятельности.ДатаМероприятия КАК ДатаМероприятия,
		|	МероприятияТрудовойДеятельности.ВидМероприятия КАК ВидМероприятия,
		|	МероприятияТрудовойДеятельности.Сведения КАК Сведения,
		|	МероприятияТрудовойДеятельности.Подразделение КАК Подразделение,
		|	МероприятияТрудовойДеятельности.Должность КАК Должность,
		|	МероприятияТрудовойДеятельности.РазрядКатегория КАК РазрядКатегория,
		|	МероприятияТрудовойДеятельности.КодПоРееструДолжностей КАК КодПоРееструДолжностей,
		|	МероприятияТрудовойДеятельности.ТрудоваяФункция КАК ТрудоваяФункция,
		|	МероприятияТрудовойДеятельности.НаименованиеДокументаОснования КАК НаименованиеДокументаОснования,
		|	МероприятияТрудовойДеятельности.ДатаДокументаОснования КАК ДатаДокументаОснования,
		|	МероприятияТрудовойДеятельности.СерияДокументаОснования КАК СерияДокументаОснования,
		|	МероприятияТрудовойДеятельности.НомерДокументаОснования КАК НомерДокументаОснования,
		|	МероприятияТрудовойДеятельности.ОснованиеУвольнения КАК ОснованиеУвольнения,
		|	МероприятияТрудовойДеятельности.ДатаС КАК ДатаС,
		|	МероприятияТрудовойДеятельности.ДатаПо КАК ДатаПо,
		|	МероприятияТрудовойДеятельности.ДатаОтмены КАК ДатаОтмены,
		|	МероприятияТрудовойДеятельности.ЯвляетсяСовместителем КАК ЯвляетсяСовместителем,
		|	МероприятияТрудовойДеятельности.ПредставлениеДолжности КАК ПредставлениеДолжности,
		|	МероприятияТрудовойДеятельности.ПредставлениеПодразделения КАК ПредставлениеПодразделения,
		|	МероприятияТрудовойДеятельности.ОснованиеУвольненияТекстОснования КАК ОснованиеУвольненияТекстОснования,
		|	МероприятияТрудовойДеятельности.ОснованиеУвольненияСтатья КАК ОснованиеУвольненияСтатья,
		|	МероприятияТрудовойДеятельности.ОснованиеУвольненияЧасть КАК ОснованиеУвольненияЧасть,
		|	МероприятияТрудовойДеятельности.ОснованиеУвольненияПункт КАК ОснованиеУвольненияПункт,
		|	МероприятияТрудовойДеятельности.ОснованиеУвольненияПодПункт КАК ОснованиеУвольненияПодПункт,
		|	МероприятияТрудовойДеятельности.ОписаниеДолжности КАК ОписаниеДолжности
		|ИЗ
		|	ВТФизическиеЛицаМероприятий КАК ФизическиеЛицаМероприятий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельности КАК МероприятияТрудовойДеятельности
		|		ПО ФизическиеЛицаМероприятий.ФизическоеЛицо = МероприятияТрудовойДеятельности.ФизическоеЛицо
		|			И ФизическиеЛицаМероприятий.ИдМероприятия = МероприятияТрудовойДеятельности.ИдМероприятия
		|			И (ВЫБОР
		|				КОГДА ФизическиеЛицаМероприятий.ДатаОтмены = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ЛОЖЬ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ = МероприятияТрудовойДеятельности.Отменено)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МероприятияТрудовойДеятельностиПрочие.ФизическоеЛицо,
		|	МероприятияТрудовойДеятельностиПрочие.Организация,
		|	МероприятияТрудовойДеятельностиПрочие.ИдМероприятия,
		|	МероприятияТрудовойДеятельностиПрочие.Отменено,
		|	МероприятияТрудовойДеятельностиПрочие.Сотрудник,
		|	МероприятияТрудовойДеятельностиПрочие.ДатаМероприятия,
		|	МероприятияТрудовойДеятельностиПрочие.ВидМероприятия,
		|	МероприятияТрудовойДеятельностиПрочие.Сведения,
		|	МероприятияТрудовойДеятельностиПрочие.Подразделение,
		|	МероприятияТрудовойДеятельностиПрочие.Должность,
		|	МероприятияТрудовойДеятельностиПрочие.РазрядКатегория,
		|	МероприятияТрудовойДеятельностиПрочие.КодПоРееструДолжностей,
		|	МероприятияТрудовойДеятельностиПрочие.ТрудоваяФункция,
		|	МероприятияТрудовойДеятельностиПрочие.НаименованиеДокументаОснования,
		|	МероприятияТрудовойДеятельностиПрочие.ДатаДокументаОснования,
		|	МероприятияТрудовойДеятельностиПрочие.СерияДокументаОснования,
		|	МероприятияТрудовойДеятельностиПрочие.НомерДокументаОснования,
		|	МероприятияТрудовойДеятельностиПрочие.ОснованиеУвольнения,
		|	МероприятияТрудовойДеятельностиПрочие.ДатаС,
		|	МероприятияТрудовойДеятельностиПрочие.ДатаПо,
		|	МероприятияТрудовойДеятельностиПрочие.ДатаОтмены,
		|	МероприятияТрудовойДеятельностиПрочие.ЯвляетсяСовместителем,
		|	МероприятияТрудовойДеятельностиПрочие.ПредставлениеДолжности,
		|	МероприятияТрудовойДеятельностиПрочие.ПредставлениеПодразделения,
		|	МероприятияТрудовойДеятельностиПрочие.ОснованиеУвольненияТекстОснования,
		|	МероприятияТрудовойДеятельностиПрочие.ОснованиеУвольненияСтатья,
		|	МероприятияТрудовойДеятельностиПрочие.ОснованиеУвольненияЧасть,
		|	МероприятияТрудовойДеятельностиПрочие.ОснованиеУвольненияПункт,
		|	МероприятияТрудовойДеятельностиПрочие.ОснованиеУвольненияПодПункт,
		|	МероприятияТрудовойДеятельностиПрочие.ОписаниеДолжности
		|ИЗ
		|	ВТФизическиеЛицаМероприятий КАК ФизическиеЛицаМероприятий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельностиПрочие КАК МероприятияТрудовойДеятельностиПрочие
		|		ПО ФизическиеЛицаМероприятий.ФизическоеЛицо = МероприятияТрудовойДеятельностиПрочие.ФизическоеЛицо
		|			И ФизическиеЛицаМероприятий.ИдМероприятия = МероприятияТрудовойДеятельностиПрочие.ИдМероприятия";
	
	МероприятияИБ = Запрос.Выполнить().Выгрузить();
	МероприятияИБ.Индексы.Добавить("Сотрудник,ИдМероприятия");
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
	ПараметрыПолучения.Организация = ДокументОбъект.Организация;
	ПараметрыПолучения.КадровыеДанные = "Организация," + ЭлектронныеТрудовыеКнижки.ИменаКадровыхДанныхСотрудниковДляНачалаУчета();
	
	ЗапросВТСотрудникиОрганизацииПоРабочимМестам = КадровыйУчет.ЗапросВТСотрудникиОрганизацииПоРабочимМестам(
		Истина, "ВТДляСЗВТДСотрудникиОрганизации", "ВТДляСЗВТДСотрудникиПериоды", ПараметрыПолучения);
	
	ЗапросВТСотрудникиОрганизацииПоРабочимМестам.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросВТСотрудникиОрганизацииПоРабочимМестам.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизации.Период КАК Период,
		|	СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	СотрудникиОрганизации.Организация КАК Организация,
		|	СотрудникиОрганизации.Подразделение КАК Подразделение,
		|	СотрудникиОрганизации.Должность КАК Должность,
		|	СотрудникиОрганизации.ВидЗанятости КАК ВидЗанятости,
		|	СотрудникиОрганизации.ВидСобытия КАК ВидСобытия,
		|	СотрудникиОрганизации.РабочееМестоПериодРегистрации КАК РабочееМестоПериодРегистрации,
		|	&РазрядКатегория КАК РазрядКатегория
		|ИЗ
		|	ВТДляСЗВТДСотрудникиОрганизации КАК СотрудникиОрганизации";
	
	ЭлектронныеТрудовыеКнижки.УточнитьЗапросПолученияДанныхНаНачалоУчета(Запрос);
	
	ТаблицаСотрудников = Запрос.Выполнить().Выгрузить();
	
	СтрокиНовыхМероприятий = Новый Массив;
	Для Каждого СтрокаМероприятия Из ДокументОбъект.Мероприятия Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Сотрудник", СтрокаМероприятия.Сотрудник);
		СтруктураПоиска.Вставить("ИдМероприятия", СтрокаМероприятия.ИдМероприятия);
		НайденныеМероприятия = МероприятияИБ.НайтиСтроки(СтруктураПоиска);
		Если НайденныеМероприятия.Количество() > 0 Тогда
			
			МероприятиеИБ = НайденныеМероприятия[0];
			
			ТекстСообщения = "";
			Если МероприятиеИБ.ВидМероприятия <> СтрокаМероприятия.ВидМероприятия Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В базе данных мероприятие %1 (идентификатор: %2) имеет вид %3 (в файле: %4)'"),
					СтрокаМероприятия.Сотрудник,
					СтрокаМероприятия.ИдМероприятия,
					МероприятиеИБ.ВидМероприятия,
					СтрокаМероприятия.ВидМероприятия);
				
			ИначеЕсли МероприятиеИБ.ДатаМероприятия <> СтрокаМероприятия.ДатаМероприятия Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В базе данных мероприятие %1 (идентификатор: %2) имеет дату мероприятия %3 (в файле: %4)'"),
					СтрокаМероприятия.Сотрудник,
					СтрокаМероприятия.ИдМероприятия,
					Формат(МероприятиеИБ.ДатаМероприятия, "ДЛФ=D"),
					Формат(СтрокаМероприятия.ДатаМероприятия, "ДЛФ=D"));
				
			ИначеЕсли ЗначениеЗаполнено(МероприятиеИБ.НаименованиеДокументаОснования) И
				ВРег(МероприятиеИБ.НаименованиеДокументаОснования) <> ВРег(СтрокаМероприятия.НаименованиеДокументаОснования) Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В базе данных мероприятие %1 (идентификатор: %2) имеет наименование документа основания %3 (в файле: %4)'"),
					СтрокаМероприятия.Сотрудник,
					СтрокаМероприятия.ИдМероприятия,
					МероприятиеИБ.НаименованиеДокументаОснования,
					СтрокаМероприятия.НаименованиеДокументаОснования);
				
			ИначеЕсли ВРег(МероприятиеИБ.НомерДокументаОснования) <> ВРег(СтрокаМероприятия.НомерДокументаОснования) Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В базе данных мероприятие %1 (идентификатор: %2) имеет номер документа основания %3 (в файле: %4)'"),
					СтрокаМероприятия.Сотрудник,
					СтрокаМероприятия.ИдМероприятия,
					МероприятиеИБ.НомерДокументаОснования,
					СтрокаМероприятия.НомерДокументаОснования);
				
			ИначеЕсли МероприятиеИБ.ДатаДокументаОснования <> СтрокаМероприятия.ДатаДокументаОснования Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В базе данных мероприятие %1 (идентификатор: %2) имеет дату документа основания %3 (в файле: %4)'"),
					СтрокаМероприятия.Сотрудник,
					СтрокаМероприятия.ИдМероприятия,
					Формат(МероприятиеИБ.ДатаДокументаОснования, "ДЛФ=D"),
					Формат(СтрокаМероприятия.ДатаДокументаОснования, "ДЛФ=D"));
				
			КонецЕсли;
			
			Если ПустаяСтрока(ТекстСообщения) Тогда
				
				ЗаполнитьЗначенияСвойств(СтрокаМероприятия, МероприятиеИБ,
					"СотрудникЗаписи,Подразделение,Должность,КодПоРееструДолжностей,РазрядКатегория,ТрудоваяФункция,ОснованиеУвольнения");
				
			Иначе
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокиНовыхМероприятий.Добавить(СтрокаМероприятия);
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ФизическоеЛицо", СтрокаМероприятия.Сотрудник);
		СтруктураПоиска.Вставить("Период", СтрокаМероприятия.ДатаМероприятия);
		Если Не СтрокаМероприятия.ЯвляетсяСовместителем Тогда
			СтруктураПоиска.Вставить("ВидЗанятости", Перечисления.ВидыЗанятости.ОсновноеМестоРаботы);
		КонецЕсли;
		
		СтрокаСотрудника = Неопределено;
		
		Сотрудники = ТаблицаСотрудников.НайтиСтроки(СтруктураПоиска);
		Если Сотрудники.Количество() > 0 Тогда
			
			Если Не СтрокаМероприятия.ЯвляетсяСовместителем Тогда
				
				Если Сотрудники.Количество() = 1 Тогда
					СтрокаСотрудника = Сотрудники[0];
				КонецЕсли;
				
			Иначе
				
				СтрокиСовместителей = Новый Массив;
				СтрокиСовместителейСПериодом = Новый Массив;
				Для Каждого СтрокаСотрудники Из Сотрудники Цикл
					
					Если СтрокаСотрудники.ВидЗанятости = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокиСовместителей.Добавить(СтрокаСотрудники);
					Если СтрокаМероприятия.ДатаМероприятия = НачалоДня(СтрокаСотрудники.РабочееМестоПериодРегистрации) Тогда
						СтрокиСовместителейСПериодом.Добавить(СтрокаСотрудники);
					КонецЕсли;
					
				КонецЦикла;
				
				Если СтрокиСовместителейСПериодом.Количество() = 1 Тогда
					СтрокаСотрудника = СтрокиСовместителейСПериодом[0];
				ИначеЕсли СтрокиСовместителей.Количество() = 1 Тогда
					СтрокаСотрудника = СтрокиСовместителей[0];
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаСотрудника <> Неопределено Тогда
			
			СтрокаМероприятия.СотрудникЗаписи = СтрокаСотрудника.Сотрудник;
			Если СтрокаМероприятия.ВидМероприятия = Перечисления.ВидыМероприятийТрудовойДеятельности.Прием
				Или СтрокаМероприятия.ВидМероприятия = Перечисления.ВидыМероприятийТрудовойДеятельности.Перевод Тогда
				
				СтрокаМероприятия.Подразделение = СтрокаСотрудника.Подразделение;
				СтрокаМероприятия.Должность = СтрокаСотрудника.Должность;
				
			ИначеЕсли СтрокаМероприятия.ВидМероприятия = Перечисления.ВидыМероприятийТрудовойДеятельности.Увольнение Тогда
				
				СтрокаМероприятия.ОснованиеУвольнения = ОснованиеУвольнения(
					СтрокаМероприятия.ОснованиеУвольненияЧасть,
					СтрокаМероприятия.ОснованиеУвольненияСтатья,
					СтрокаМероприятия.ОснованиеУвольненияПункт,
					СтрокаМероприятия.ОснованиеУвольненияПодпункт)
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		
		Если СтрокиНовыхМероприятий.Количество() > 0 Тогда
			
			РегистрацияТрудовойДеятельности = Документы.РегистрацияТрудовойДеятельности.СоздатьДокумент();
			
			РегистрацияТрудовойДеятельности.Дата = ДокументОбъект.Дата;
			РегистрацияТрудовойДеятельности.Организация = ДокументОбъект.Организация;
			РегистрацияТрудовойДеятельности.Ответственный = ДокументОбъект.Ответственный;
			РегистрацияТрудовойДеятельности.Комментарий = НСтр("ru = 'Импортирован'") + ": " + Формат(ТекущаяДатаСеанса(), "ДЛФ=D");
			
			Для Каждого СтрокаМероприятия Из СтрокиНовыхМероприятий Цикл
				ЗаполнитьЗначенияСвойств(РегистрацияТрудовойДеятельности.Мероприятия.Добавить(), СтрокаМероприятия);
			КонецЦикла;
			
			Если РегистрацияТрудовойДеятельности.ПроверитьЗаполнение() Тогда
				
				Попытка
					РегистрацияТрудовойДеятельности.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), , , , Отказ);
				КонецПопытки;
				
			Иначе
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Процедура ДозаполнитьЗаявленияДокумента(ДокументОбъект, ЗаявленияСотрудников, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗаявленияСотрудников.Количество() > 0 Тогда
		
		ОтозванныеЗаявления = Новый ТаблицаЗначений;
		ОтозванныеЗаявления.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		ОтозванныеЗаявления.Колонки.Добавить("Заявление", Новый ОписаниеТипов("ДокументСсылка.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности"));
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ЗаявленияСотрудников", ЗаявленияСотрудников);
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаявленияСотрудников.Сотрудник КАК Сотрудник,
			|	ЗаявленияСотрудников.ВидЗаявления КАК ВидЗаявления,
			|	ЗаявленияСотрудников.СтатусЗаявления КАК СтатусЗаявления,
			|	ЗаявленияСотрудников.Дата КАК Дата,
			|	ЗаявленияСотрудников.НомерСтроки КАК НомерСтроки
			|ПОМЕСТИТЬ ВТЗаявленияСотрудниковДокумента
			|ИЗ
			|	&ЗаявленияСотрудников КАК ЗаявленияСотрудников
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаявленияСотрудниковДокумента.Сотрудник КАК Сотрудник,
			|	ЗаявленияСотрудниковДокумента.ВидЗаявления КАК ВидЗаявления,
			|	ЗаявленияСотрудниковДокумента.Дата КАК Дата,
			|	ЗаявленияСотрудниковДокумента.НомерСтроки КАК НомерСтроки,
			|	ЗаявленияСотрудниковДокумента.СтатусЗаявления КАК СтатусЗаявления,
			|	ЗаявленияОВеденииТрудовыхКнижек.Регистратор КАК Заявление
			|ПОМЕСТИТЬ ВТЗаявленияСотрудников
			|ИЗ
			|	ВТЗаявленияСотрудниковДокумента КАК ЗаявленияСотрудниковДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявленияОВеденииТрудовыхКнижек КАК ЗаявленияОВеденииТрудовыхКнижек
			|		ПО ЗаявленияСотрудниковДокумента.Сотрудник = ЗаявленияОВеденииТрудовыхКнижек.ФизическоеЛицо
			|			И ЗаявленияСотрудниковДокумента.ВидЗаявления = ЗаявленияОВеденииТрудовыхКнижек.ВидЗаявления
			|			И ЗаявленияСотрудниковДокумента.Дата = ЗаявленияОВеденииТрудовыхКнижек.Период
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаявленияСотрудников.Сотрудник КАК Сотрудник,
			|	ЗаявленияСотрудников.ВидЗаявления КАК ВидЗаявления,
			|	ЗаявленияСотрудников.Дата КАК Дата,
			|	ЗаявленияСотрудников.НомерСтроки КАК НомерСтроки,
			|	ЗаявленияСотрудников.СтатусЗаявления КАК СтатусЗаявления,
			|	ЗаявленияСотрудников.Заявление КАК Заявление
			|ИЗ
			|	ВТЗаявленияСотрудников КАК ЗаявленияСотрудников
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата,
			|	Заявление";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("Дата") Цикл
			
			Пока Выборка.СледующийПоЗначениюПоля("Заявление") Цикл
				
				Если ЗначениеЗаполнено(Выборка.Заявление) Тогда
					
					Пока Выборка.Следующий() Цикл
						
						СтрокаСотрудника = ДокументОбъект.Сотрудники.Найти(Выборка.НомерСтроки, "НомерСтроки");
						Если СтрокаСотрудника <> Неопределено Тогда
							
							Если Выборка.ВидЗаявления = Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.ВедениеБумажнойТрудовойКнижки Тогда
								СтрокаСотрудника.ЗаявлениеОПродолжении = Выборка.Заявление;
								СтрокаСотрудника.ЗаявлениеОПродолженииОтмена = (Выборка.СтатусЗаявления = 2);
							Иначе
								СтрокаСотрудника.ЗаявлениеОПредоставлении = Выборка.Заявление;
								СтрокаСотрудника.ЗаявлениеОПредоставленииОтмена = (Выборка.СтатусЗаявления = 2);
							КонецЕсли;
							
							Если Выборка.СтатусЗаявления = 2 Тогда
								
								СтрокаОтозванного = ОтозванныеЗаявления.Добавить();
								СтрокаОтозванного.Сотрудник = Выборка.Сотрудник;
								СтрокаОтозванного.Заявление = Выборка.Заявление;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				ДокументЗаявленияОбъект = Документы.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.СоздатьДокумент();
				ДокументЗаявленияОбъект.Дата = Выборка.Дата;
				ДокументЗаявленияОбъект.Организация = ДокументОбъект.Организация;
				ДокументЗаявленияОбъект.Ответственный = ДокументОбъект.Ответственный;
				ДокументЗаявленияОбъект.Руководитель = ДокументОбъект.Руководитель;
				ДокументЗаявленияОбъект.ДолжностьРуководителя = ДокументОбъект.ДолжностьРуководителя;
				ДокументЗаявленияОбъект.Комментарий = НСтр("ru = 'Импортирован'") + ": " + Формат(ТекущаяДатаСеанса(), "ДЛФ=D");
				
				СсылкаНовогоЗаявления = Документы.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.ПолучитьСсылку();
				
				Пока Выборка.Следующий() Цикл
					
					ЗаполнитьЗначенияСвойств(ДокументЗаявленияОбъект.Сотрудники.Добавить(), Выборка);
					
					СтрокаСотрудника = ДокументОбъект.Сотрудники.Найти(Выборка.НомерСтроки, "НомерСтроки");
					Если СтрокаСотрудника <> Неопределено Тогда
						
						Если Выборка.ВидЗаявления = Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.ВедениеБумажнойТрудовойКнижки Тогда
							СтрокаСотрудника.ЗаявлениеОПродолжении = СсылкаНовогоЗаявления;
							СтрокаСотрудника.ЗаявлениеОПродолженииОтмена = (Выборка.СтатусЗаявления = 2);
						Иначе
							СтрокаСотрудника.ЗаявлениеОПредоставлении = СсылкаНовогоЗаявления;
							СтрокаСотрудника.ЗаявлениеОПредоставленииОтмена = (Выборка.СтатусЗаявления = 2);
						КонецЕсли;
						
						Если Выборка.СтатусЗаявления = 2 Тогда
							
							СтрокаОтозванного = ОтозванныеЗаявления.Добавить();
							СтрокаОтозванного.Сотрудник = Выборка.Сотрудник;
							СтрокаОтозванного.Заявление = СсылкаНовогоЗаявления;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Попытка
					ДокументЗаявленияОбъект.УстановитьСсылкуНового(СсылкаНовогоЗаявления);
					ДокументЗаявленияОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), , , , Отказ);
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Не Отказ
			И ОтозванныеЗаявления.Количество() > 0 Тогда
			
			Запрос.УстановитьПараметр("ОтозванныеЗаявления", ОтозванныеЗаявления);
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ОтозванныеЗаявления.Сотрудник КАК Сотрудник,
				|	ОтозванныеЗаявления.Заявление КАК Заявление
				|ПОМЕСТИТЬ ВТОтозванныеЗаявления
				|ИЗ
				|	&ОтозванныеЗаявления КАК ОтозванныеЗаявления
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ОтозванныеЗаявления.Сотрудник КАК Сотрудник,
				|	ОтозванныеЗаявления.Заявление КАК Заявление
				|ИЗ
				|	ВТОтозванныеЗаявления КАК ОтозванныеЗаявления
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаявленияОВеденииТрудовыхКнижекОтозванные КАК ЗаявленияОВеденииТрудовыхКнижекОтозванные
				|		ПО ОтозванныеЗаявления.Сотрудник = ЗаявленияОВеденииТрудовыхКнижекОтозванные.ФизическоеЛицо
				|			И ОтозванныеЗаявления.Заявление = ЗаявленияОВеденииТрудовыхКнижекОтозванные.Заявление
				|ГДЕ
				|	ЗаявленияОВеденииТрудовыхКнижекОтозванные.Заявление ЕСТЬ NULL";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() > 0 Тогда
				
				ДокументОтзывЗаявленийОбъект = Документы.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности.СоздатьДокумент();
				ДокументОтзывЗаявленийОбъект.Дата = ДокументОбъект.Дата;
				ДокументОтзывЗаявленийОбъект.Организация = ДокументОбъект.Организация;
				ДокументОтзывЗаявленийОбъект.Ответственный = ДокументОбъект.Ответственный;
				ДокументОтзывЗаявленийОбъект.Комментарий = НСтр("ru = 'Импортирован'") + ": " + Формат(ТекущаяДатаСеанса(), "ДЛФ=D");
				
				Пока Выборка.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(ДокументОтзывЗаявленийОбъект.Сотрудники.Добавить(), Выборка);
				КонецЦикла;
				
				Попытка
					ДокументОтзывЗаявленийОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ОбщегоНазначения.СообщитьПользователю(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), , , , Отказ);
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ОснованиеУвольнения(Часть, Статья, Пункт, Подпункт)
	
	СтатьиУвольнения = СтатьиУвольненияСАдресами();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Часть", Часть);
	СтруктураПоиска.Вставить("Статья", Статья);
	СтруктураПоиска.Вставить("Пункт", Пункт);
	СтруктураПоиска.Вставить("Подпункт", Подпункт);
	
	НайденныеСтатьи = СтатьиУвольнения.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтатьи.Количество() > 0 Тогда
		Возврат НайденныеСтатьи[0].Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтатьиУвольненияСАдресами()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОснованияУвольнения.Ссылка КАК Ссылка,
		|	ОснованияУвольнения.Статья КАК Статья,
		|	ОснованияУвольнения.Часть КАК Часть,
		|	ОснованияУвольнения.Пункт КАК Пункт,
		|	ОснованияУвольнения.Подпункт КАК Подпункт
		|ИЗ
		|	Справочник.ОснованияУвольнения КАК ОснованияУвольнения";
	
	Статьи = Запрос.Выполнить().Выгрузить();
	Статьи.Индексы.Добавить("Часть,Статья,Пункт,Подпункт");
	
	Возврат Статьи;
	
КонецФункции

#КонецОбласти

#Область РаботаСXML

Функция ПутьКДаннымОшибки(ПутьДоЭлемента)
	
	Если Не ЗначениеЗаполнено(ПутьДоЭлемента) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ОписаниеПутейУДанным = Новый Массив;
	
	ПутиКДанным = СтрРазделить(ПутьДоЭлемента, "/", Ложь);
	
	ЭлементыКУдалению = Новый Массив;
	Для Каждого ПутьКДанным Из ПутиКДанным Цикл
		
		Если СтрНачинаетсяС(ПутьКДанным, "ЭДПФР") Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНачинаетсяС(ПутьКДанным, "СЗВ-ТД") Тогда
			Продолжить;
		КонецЕсли;
		
		ПозицияСкобки = СтрНайти(ПутьКДанным, "[");
		Если ПозицияСкобки > 0 Тогда
			
			ИмяЭлемента = Лев(ПутьКДанным, ПозицияСкобки - 1);
			СтрокаНомером = Сред(ПутьКДанным, ПозицияСкобки + 1);
			
			Попытка
				НомерСтроки = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Лев(СтрокаНомером, СтрДлина(СтрокаНомером) - 1));
			Исключение
				НомерСтроки = 0;
			КонецПопытки;
			
		Иначе
			ИмяЭлемента = ПутьКДанным;
			НомерСтроки = 0;
		КонецЕсли;
		
		ОписаниеПутейУДанным.Добавить(Новый Структура("ИмяЭлемента,НомерСтроки", ИмяЭлемента, НомерСтроки));
		
	КонецЦикла;
	
	Возврат ОписаниеПутейУДанным;
	
КонецФункции

Функция ОписаниеДанных()
	
	ОписаниеЭлементов = Новый Соответствие;
	ОписаниеЭлементов.Вставить("ОтчетныйПериод", ОписаниеЭлемента("ОтчетныйПериод" , Ложь));
	ОписаниеЭлементов.Вставить("ОтчетныйПериод", ОписаниеЭлемента("ОтчетныйПериод" , Ложь));
	ОписаниеЭлементов.Вставить("ЗЛ", ОписаниеЭлемента("Сотрудники[%1]" , Истина));
	ОписаниеЭлементов.Вставить("ФИО", ОписаниеЭлемента(".Сотрудник" , Ложь));
	ОписаниеЭлементов.Вставить("УТ2:СНИЛС", ОписаниеЭлемента(".СтраховойНомерПФР" , Ложь));
	ОписаниеЭлементов.Вставить("УТ2:ДатаРождения", ОписаниеЭлемента(".ДатаРождения" , Ложь));
	ОписаниеЭлементов.Вставить("СтатусЗаявленияОПродолжении", ОписаниеЭлемента(".СтатусЗаявленияОПродолжении" , Ложь));
	ОписаниеЭлементов.Вставить("ЗаявлениеОПредоставлении", ОписаниеЭлемента(".ЗаявлениеОПредоставлении" , Ложь));
	ОписаниеЭлементов.Вставить("Мероприятие", ОписаниеЭлемента(".Сотрудник" , Истина));
	ОписаниеЭлементов.Вставить("МероприятиеОтменяемое", ОписаниеЭлемента(".Сотрудник" , Истина));
	ОписаниеЭлементов.Вставить("UUID", ОписаниеЭлемента(".Сотрудник" , Ложь));
	
	Возврат ОписаниеЭлементов;
	
КонецФункции

Функция ОписаниеЭлемента(Путь,Множественное)
	
	Возврат Новый Структура("Путь,Множественное", Путь, Множественное);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
