
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЧекаЗавершение", ЭтотОбъект, Новый Структура("Форма", ПараметрыВыполненияКоманды.Источник));
	
	ПечатьФискальныхДокументовКлиент.НапечататьЧек(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧекаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат.Успешно Тогда
		Форма =  ДополнительныеПараметры.Форма;
		Объект = Форма.Объект;
		
		Объект.НомерЧекаККМ = Результат.НомерЧекаККМ;
		
		// Параметры операции при оплате картой
		ЗаполнитьЗначенияСвойств(Объект, Результат.ПараметрыОплаты);
		
		ГруппаПредупреждениеОПечатиЧека = Форма.Элементы.Найти("ПредупреждениеОПечатиЧека");
		Если ГруппаПредупреждениеОПечатиЧека <> Неопределено Тогда
			ГруппаПредупреждениеОПечатиЧека.Видимость = Ложь;
		КонецЕсли; 
		
		Форма.Записать();
		
		Оповестить("ВыполненаЗаписьДокумента", Новый Структура("ДокументСсылка", Объект.Ссылка));
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка);
		
	ИначеЕсли ЗначениеЗаполнено(Результат.СообщениеОбОшибке) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.СообщениеОбОшибке);
	КонецЕсли; 
КонецПроцедуры 
