
&НаКлиенте
Процедура ЦветНажатие(Команда)
	
	ВыбранныйЦвет = ЭтаФорма.ТекущийЭлемент.ЦветФона;
	Красный = ВыбранныйЦвет.Красный;
	Зеленый = ВыбранныйЦвет.Зеленый;
	Синий = ВыбранныйЦвет.Синий;
	ОбновитьЦветКнопки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦветКнопки()
	
	ТекущийЦвет = Новый Цвет(Красный, Зеленый, Синий);
	Элементы.КнопкаЦвет.ЦветФона = ТекущийЦвет;
	
КонецПроцедуры

&НаКлиенте
Процедура КрасныйПриИзменении(Элемент)
	
	ОбновитьЦветКнопки();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОКНажатие(Команда)
	
	Закрыть(Новый Цвет(Красный, Зеленый, Синий));
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтменаНажатие(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЦветКнопки();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Красный", Красный);
	Параметры.Свойство("Зеленый", Зеленый);
	Параметры.Свойство("Синий", Синий);
	
КонецПроцедуры
