#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = НачалоМесяца(ТекущаяДатаСеанса());
	ДатаСтрокой = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		Дата, КонецМесяца(Дата), Истина);

	Организация = Параметры.Организация;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Период = Новый Структура("НачалоПериода, КонецПериода, ВидПериода, ИмяФормы");
	Период.НачалоПериода = НачалоМесяца(Дата);
		Период.КонецПериода = КонецМесяца(Дата);
		Период.ВидПериода = ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц");
		Период.ИмяФормы = "ВыборСтандартногоПериодаМесяц";
		
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму(
			СтрШаблон("ОбщаяФорма.%1","ВыборСтандартногоПериодаМесяц"),
			Период,
			ЭтотОбъект, , , ,
			Новый ОписаниеОповещения("ПериодЗавершениеВыбора", ЭтотОбъект));

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	Закрыть(Дата);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПериодЗавершениеВыбора(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		
		ДатаСтрокой = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
			РезультатВыбора.НачалоПериода, РезультатВыбора.КонецПериода, Истина);
		Дата = РезультатВыбора.НачалоПериода;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти