
#Область УведомленияПоСобытиям

Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.АР_ОтправкаПочтовыхУведомлений;
	
КонецПроцедуры

#КонецОбласти

#Область ВариантыОтчетов

Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АР_ОтчетПоНачислениямИВыплатамАренднойПлаты);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АР_СтруктураРасчетовПоАренде);
		
КонецПроцедуры

#КонецОбласти
