
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверим, что даты расположены в хронологическом порядке
	ИмяСписка = НСтр("ru = 'График ставок'");
	Для Сч = 1 По ГрафикСтавок.Количество() - 1 Цикл
		Если ГрафикСтавок[Сч - 1].Дата >= ГрафикСтавок[Сч].Дата Тогда
			Префикс = "ГрафикСтавок[" + Формат(Сч, "ЧН=0; ЧГ=") + "].";
			ТекстСообщения = НСтр("ru = 'В строке """ + Строка(Сч) + """ дата не меньше, чем в строке """ + Строка(Сч + 1) + """'");
			ТекстСообщения = ОбщегоНазначенияБПКлиентСервер.ПолучитьТекстСообщения("Колонка", "Корректность", НСтр("ru = 'Дата'"),
			Сч, ИмяСписка, ТекстСообщения);
			Поле = Префикс + "Дата";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
