
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запись.ИзмененоВручную = Истина;
	Запись.Автор = Пользователи.ТекущийПользователь();
	Запись.ДатаСоздания = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствующееЗначениеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Запись.СоответствующееЗначение) Тогда
		Запись.ТипЗначения = РаспознаваниеДокументовСлужебныйВызовСервера.ПолучитьТипЗначенияСтрокой(Запись.СоответствующееЗначение);
	ИначеЕсли Запись.СоответствующееЗначение = Неопределено Тогда
		Запись.ТипЗначения = "";
	КонецЕсли;
	
КонецПроцедуры
