#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Исключаем из проверки реквизиты, заполнение которых стало необязательным:
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ВидОперации = 0 Тогда
		Если ДатаПродленияФиксирована = 0 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Период");
			МассивНепроверяемыхРеквизитов.Добавить("КоличествоПериодов");
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияДоговора");
		КонецЕсли;
		МассивНепроверяемыхРеквизитов.Добавить("СтавкиНаУслуги.Услуга");
		МассивНепроверяемыхРеквизитов.Добавить("СтавкиНаУслуги.СпособНачисления");
	ИначеЕсли ВидОперации = 1 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Период");
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоПериодов");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияДоговора");
	ИначеЕсли ВидОперации = 2 Тогда
		Если ДатаПродленияФиксирована = 0 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Период");
			МассивНепроверяемыхРеквизитов.Добавить("КоличествоПериодов");
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияДоговора");
		КонецЕсли;
	КонецЕсли;
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецЕсли
