
&НаСервере
Процедура ОбработкаЗаписиНовогоНаСервере()
	Объект.Наименование=Объект.НомерСклада+"/"+Прав("0"+Строка(Объект.НомерРяда),2)+Прав("0"+Строка(Объект.НомерПолки),2)+Прав("0"+Строка(Объект.НомерЯчейки),2);
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ОбработкаЗаписиНовогоНаСервере();
КонецПроцедуры

&НаСервере
Процедура НомерПолкиПриИзмененииНаСервере()
	Объект.Наименование=Прав("00"+Строка(Объект.НомерСклада),2)+"/"+Прав("00"+Строка(Объект.НомерРяда),2)+"/"+Прав("00"+Строка(Объект.НомерПолки),2);
КонецПроцедуры

&НаКлиенте
Процедура НомерПолкиПриИзменении(Элемент)
	НомерПолкиПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НомерЯчейкиПриИзменении(Элемент)
	ОбработкаЗаписиНовогоНаСервере();
КонецПроцедуры



