#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьСтатусОбработкиЗадания(ИдентификаторЗадания, Статус) Экспорт
	
	Запись = РегистрыСведений.СостоянияЗаданийРаспознаваниеДокументов.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторЗадания = ИдентификаторЗадания;
	Запись.Прочитать();
	Если Запись.ИдентификаторЗадания = "" Тогда
		Запись.ИдентификаторЗадания = ИдентификаторЗадания;
	КонецЕсли;
	Запись.Статус = Статус;
	Запись.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
