
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектАренды", ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "РеестрОбъектов");
	ПараметрыФормы.Вставить("СброситьПользовательскиеНастройки", Истина);
 	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "КонтекстныйОтчет");
  	ПараметрыФормы.Вставить("КлючПользовательскихНастроек", "КонтекстныйОтчет");	
	
	ОткрытьФорму("Отчет.АР_РеестрОбъектовАренды.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "1" + ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
