
Процедура ДобавитьЭлемент(Наименование, СообщатьОСоздании, Код)
	
	Ссылка = Справочники.АР_КатегорииЗемель.НайтиПоКоду(Код);
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Объект = Справочники.АР_КатегорииЗемель.СоздатьЭлемент();
		Объект.Наименование = Наименование;
		Объект.Код = Код;
		Объект.Записать();
		Ссылка = Объект.Ссылка;
		
		Если СообщатьОСоздании Тогда
			НаименованиеСправочника = Объект.Метаданные().Синоним;
			ТекстСообщения = "Создан элемент справочника """ + НаименованиеСправочника + """ с наименованием """ + Наименование + """";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект);
		КонецЕсли;
	Иначе                                       
		Если Не Наименование = Ссылка.Наименование Тогда
			ТекстСообщения = "Элемент с кодом " + Код + " уже существует. Категория """ + Наименование + """ пропущена";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Первоначальное заполнение справочника
Процедура ПервоначальноеЗаполнениеСправочника(СообщатьОСоздании = Ложь) Экспорт
	
	ДобавитьЭлемент("Земли сельскохозяйственного назначения", СообщатьОСоздании, "100");
	ДобавитьЭлемент("Земли населенных пунктов", СообщатьОСоздании, "200");
	ДобавитьЭлемент("Земли промышленности, энергетики, транспорта, связи, радиовещания, телевидения, информатики, космической деят-ти, обороны, безоп-ти и иного спецназн.", СообщатьОСоздании, "300");
	ДобавитьЭлемент("Земли особо охраняемых территорий и объектов", СообщатьОСоздании, "400");
	ДобавитьЭлемент("Земли лесного фонда", СообщатьОСоздании, "500");
	ДобавитьЭлемент("Земли водного фонда", СообщатьОСоздании, "600");                                
	ДобавитьЭлемент("Земли запаса", СообщатьОСоздании, "700");
	
КонецПроцедуры
