///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ДОПОЛНИТЕЛЬНЫМИ КНОПКАМИ

&НаСервере
// Процедура дополняет таблицу печатных форма (ТаблицаМакетов) объекта
// из справочника "Дополнительные печатные формы"
//
// Параметры:
//  ДеревоМакетов - Дерево значений
//  СсылкаОбъекта - Ссылка объекта метаданных
//  Действие - Действие. Действие кнопки (процедура должна быть описана в форме объекта, на который навешивается подменю)
//  ВнутренниеПечатныеФормы - ТаблицаЗначений, Структура
//  ДобавлятьВДеревоРазделительИПечатьПоУмолчанию - булево
//  ПредставлениеПечатнойФормы - Строка, Наименование элемента справочника ВнешниеОбработки
//
Процедура ЗаполнитьПечатныеФормы()
	
	МетаданныеОбъекта = Объект.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипДокумента", Перечисления.АР_ТипыДокументовПечатныхФорм[МетаданныеОбъекта.Имя]);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АР_ШаблоныДокументов.Наименование,
	|	АР_ШаблоныДокументов.Код
	|ИЗ
	|	Справочник.АР_ШаблоныДокументов КАК АР_ШаблоныДокументов
	|ГДЕ
	|	НЕ АР_ШаблоныДокументов.ПометкаУдаления
	|	И АР_ШаблоныДокументов.ТипДокумента = &ТипДокумента";
				
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаКнопки = ДеревоМакетовПечати.Добавить();
		СтрокаКнопки.Текст = Выборка.Наименование;
		СтрокаКнопки.Код = Выборка.Код;
		
	КонецЦикла;
				
КонецПроцедуры // ДобавитьВДеревоМакетовДополнительныеФормы()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект = Параметры.Объект;
	
	// Установить заголовок
	Заголовок = "Печать: " + Строка(Объект);
	
	// Сформировать дерево макетов печати
	ЗаполнитьПечатныеФормы();
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ ФОРМЫ

&НаКлиенте
Процедура Печать(Команда)
	
	ТекущиеДанные = Элементы.ДеревоМакетовПечати.ТекущиеДанные;
	Результат = Неопределено;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Результат = Новый Структура("Код, УИД", ТекущиеДанные.Код, УникальныйИдентификатор);
	КонецЕсли;
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМакетовПечатиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоМакетовПечати.ТекущиеДанные;
	Результат = Новый Структура("Код, УИД", ТекущиеДанные.Код, УникальныйИдентификатор);
	Закрыть(Результат);
	
КонецПроцедуры




