
#Область ПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УправлениеФормойДоговора(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоАрендныйДоговор = Объект.АР_АрендныйДоговор;
	ВестиВзаиморасчетыПоПериодам = Объект.АР_ВестиВзаиморасчетыПоПериодам;
	Элементы.АР_Периодичность.Видимость = ЭтоАрендныйДоговор И ВестиВзаиморасчетыПоПериодам;
	Элементы.АР_ВестиВзаиморасчетыПоОбъектам.Видимость = ЭтоАрендныйДоговор;
	Элементы.АР_ВестиВзаиморасчетыПоПериодам.Видимость = ЭтоАрендныйДоговор;
	Элементы.АР_ВестиВзаиморасчетыПоСчетамПост.Видимость = ЭтоАрендныйДоговор;
	Элементы.АР_ВестиВзаиморасчетыПоСчетамПерем.Видимость = ЭтоАрендныйДоговор;
	Элементы.АР_ВестиВзаиморасчетыПоУслугам.Видимость = ЭтоАрендныйДоговор;
	Элементы.АР_Субаренда.Видимость = ЭтоАрендныйДоговор;
	
КонецПроцедуры

Процедура УправлениеФормойПлатежныйДокумент(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Параметры.ПараметрыФормы.Шапка;
	КонецЕсли;
	
	ДоступнаОплатаАренды = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПКО.ОплатаПокупателя")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.ВозвратПокупателю")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю");
	
	ВозвратПлатежа = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.ВозвратПокупателю")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю");
		
	ОплатаАренды = Объект.АР_ОплатаАренды И ДоступнаОплатаАренды;
	
	ЭтоФормаРасшифровки = Найти(Форма.ИмяФормы, "ФормаРасшифровкаПлатежа") > 0;
	
	Если НЕ ЭтоФормаРасшифровки Тогда
		Элементы.АР_ОплатаАренды.Видимость = ДоступнаОплатаАренды;
	КонецЕсли;
	Элементы.РасшифровкаПлатежаАР_УслугаАренды.Видимость = ОплатаАренды;
	Элементы.РасшифровкаПлатежаАР_ОбъектАренды.Видимость = ОплатаАренды;
	Элементы.РасшифровкаПлатежаАР_ПериодАренды.Видимость = ОплатаАренды;
	Элементы.РасшифровкаПлатежаАР_СчетНаАренду.Видимость = ОплатаАренды;
	Элементы.РасшифровкаПлатежаАР_Депозит.Видимость = ОплатаАренды;
	Если ЭтоФормаРасшифровки Тогда
		ОбособленныйУчетПени = АР_ПроцедурыНачисления.ПоДоговорамЕстьОбособленныйУчетПени(Объект, Форма.РасшифровкаПлатежа);
		НеВедетсяОбособленныйУчетПени = АР_ПроцедурыНачисления.ПоДоговорамНеВедетсяОбособленныйУчетПени(Объект, Форма.РасшифровкаПлатежа);
	Иначе
		ОбособленныйУчетПени = АР_ПроцедурыНачисления.ПоДоговорамЕстьОбособленныйУчетПени(Объект);
		НеВедетсяОбособленныйУчетПени = АР_ПроцедурыНачисления.ПоДоговорамНеВедетсяОбособленныйУчетПени(Объект);
	КонецЕсли;
	
	Элементы.РасшифровкаПлатежаАР_Пени.Видимость = ОплатаАренды И (ОбособленныйУчетПени ИЛИ ВозвратПлатежа);
	
	Если НЕ Элементы.Найти("РасшифровкаПлатежаАР_СчетПеней") = Неопределено Тогда
		Элементы.РасшифровкаПлатежаАР_СчетПеней.Видимость = ОплатаАренды И НеВедетсяОбособленныйУчетПени;
	КонецЕсли;
	
	Если ОбособленныйУчетПени ИЛИ ВозвратПлатежа Тогда
		Элементы.РасшифровкаПлатежаАР_Депозит.Заголовок = "Депозит / Пени";
	Иначе
		Элементы.РасшифровкаПлатежаАР_Депозит.Заголовок = "Депозит";
	КонецЕсли;
	
	Если НЕ Элементы.Найти("АР_РасшифровкаПлатежаЗаполнить") = Неопределено Тогда
		Элементы.АР_РасшифровкаПлатежаЗаполнить.Видимость = ОплатаАренды;
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеФормойПлатежныйДокументОднострочный(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ДоступнаОплатаАренды = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя")
						ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПКО.ОплатаПокупателя")
						ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.ВозвратПокупателю")
						ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю");
	
	ВозвратПлатежа = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРКО.ВозвратПокупателю")
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю");
		
	ОплатаАренды = Объект.АР_ОплатаАренды И ДоступнаОплатаАренды;
	
	Элементы.АР_ОплатаАренды.Видимость = ДоступнаОплатаАренды;
	Элементы.ГруппаРеквизитыАренды.Видимость = ОплатаАренды;
	Элементы.АР_УслугаАренды.Видимость = ОплатаАренды;
	Элементы.АР_ОбъектАренды.Видимость = ОплатаАренды;                   
	Элементы.ГруппаПериодДепозитПени.Видимость = ОплатаАренды;
	Элементы.АР_СчетНаАренду.Видимость = ОплатаАренды;
	
	ДоговорКонтрагента = Форма.РасшифровкаПлатежаДоговорКонтрагента;
	
	Элементы.АР_Пени.Видимость = ОплатаАренды И (АР_ПроцедурыНачисления.ПоДоговорамЕстьОбособленныйУчетПени(Объект,, ДоговорКонтрагента) ИЛИ ВозвратПлатежа);
	Если НЕ Элементы.Найти("АР_СчетПеней") = Неопределено Тогда
		Элементы.АР_СчетПеней.Видимость = ОплатаАренды И АР_ПроцедурыНачисления.ПоДоговорамНеВедетсяОбособленныйУчетПени(Объект,, ДоговорКонтрагента);
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеФормойКорректировкаРеализации(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	//Элементы.ГруппаТовары.Видимость = Элементы.ГруппаТовары.Видимость И НЕ (Форма.АР_ИсправлениеАренды ИЛИ Форма.АР_ИсправлениеПени); 
	
КонецПроцедуры

#КонецОбласти
