
&НаСервере
Процедура СоздатьПлатежкиНаСервере()
	Для Каждого ЭлЗаявка из Объект.Заявки Цикл 
		Если ЭлЗаявка.выбран Тогда 
			ПП = Документы.ПлатежноеПоручение.СоздатьДокумент();
			ПП.Заполнить(ЭлЗаявка.Заявка);
			Попытка 
				ПП.Записать(РежимЗаписиДокумента.Проведение);
				Сообщить("Создан и проведен документ " + ПП,СтатусСообщения.Информация);
				
			Исключение
				Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПлатежки(Команда)
	СоздатьПлатежкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаявкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходованиеСредств.Ссылка КАК Заявка,
		|	ЛОЖЬ КАК выбран
		|ИЗ
		|	Документ.ЗаявкаНаРасходованиеСредств КАК ЗаявкаНаРасходованиеСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ПО (ПлатежноеПоручение.ДокументОснование = ЗаявкаНаРасходованиеСредств.Ссылка)
		|ГДЕ
		|	ЗаявкаНаРасходованиеСредств.УтвержденнаяДатаОплаты = &УтвержденнаяДатаОплаты
		|	И ЗаявкаНаРасходованиеСредств.Проведен = ИСТИНА
		|	И ЗаявкаНаРасходованиеСредств.ЭтапСогласования = &ЭтапСогласования
		|	И ПлатежноеПоручение.Ссылка ЕСТЬ NULL
		|	И ЗаявкаНаРасходованиеСредств.Организация = &Организация";
	
	Запрос.УстановитьПараметр("УтвержденнаяДатаОплаты", Объект.ДатаОплаты);
	Запрос.УстановитьПараметр("ЭтапСогласования", Перечисления.ЭтапыСогласованияЗаявки.ФинДиректор);
    Запрос.УстановитьПараметр("Организация",Объект.Организация);
	
	Объект.Заявки.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
	
		

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаявки(Команда)
	ЗаполнитьЗаявкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлатежкамиНаСервере()
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежноеПоручение.Ссылка КАК Заявка,
		|	ЛОЖЬ КАК выбран
		|ИЗ
		|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|		ПО (СписаниеСРасчетногоСчета.ДокументОснование = ПлатежноеПоручение.Ссылка)
		|ГДЕ
		|	ПлатежноеПоручение.Проведен = ИСТИНА
		|	И СписаниеСРасчетногоСчета.Ссылка ЕСТЬ NULL
		|	И ПлатежноеПоручение.Дата >= &Дата1
		|	И ПлатежноеПоручение.Дата <= &Дата2
		|	И ПлатежноеПоручение.Организация = &Организация";
	
    Запрос.УстановитьПараметр("Дата1", НачалоДня(Объект.Дата));
    Запрос.УстановитьПараметр("Дата2", КонецДня(Объект.Дата));
    Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Объект.Заявки.Загрузить(Запрос.Выполнить().Выгрузить());
	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлатежками(Команда)
	ЗаполнитьПлатежкамиНаСервере();
КонецПроцедуры
