
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Подсистемы, ИмяФормы, КартинкаФормы");
	ПараметрыФормы.Подсистемы    = Неопределено;
	ПараметрыФормы.ИмяФормы      = "Классификаторы по недвижимости";
	ПараметрыФормы.КартинкаФормы = Неопределено;
	ОткрытьФорму("ОбщаяФорма.АР_ПанельКлассификаторов", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
