Функция РассчитатьНеустойку(ДатаРасчета, ОстатокЗадолжненности, НачалоПериодаПросрочки, КонецПериодаПросрочки, ПорядокРасчетаПени, СтрокаТЧ, ПроцентНеустойкиПоДоговору) Экспорт
	КоличествоДнейПросрочки = (КонецДня(КонецПериодаПросрочки) - НачалоДня(НачалоПериодаПросрочки))/86400;
	Если СтрокаТЧ.КоличествоДнейПросрочки < 0 Тогда СтрокаТЧ.КоличествоДнейПросрочки = 0 КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.ДатаФактическойОплаты) Тогда
		КлючеваяСтавка = КлючеваяСтавка(СтрокаТЧ.ДатаФактическойОплаты);
	Иначе
		КлючеваяСтавка = КлючеваяСтавка(ДатаРасчета);
	КонецЕсли;
	
	
	Коэффициент130 = 1/130;
	Коэффициент300 = 1/300;
	Коэффициент360 = 1/360;
	Коэффициент01 = ПроцентНеустойкиПоДоговору/100;
	
	СтрокаТЧ.КлючеваяСтавка     = КлючеваяСтавка;
	КлючеваяСтавка = КлючеваяСтавка/100;
	
	СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки     = "";
	СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки     = "";
	СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки30   = "";
	СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки3090 = "";
	СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки90   = "";
	
	База = ?(СтрокаТЧ.СуммаУчтеннойОплаты > 0, СтрокаТЧ.СуммаУчтеннойОплаты, ОстатокЗадолжненности);
	
	Если ПорядокРасчетаПени = 0 Тогда
		//Коэффициент130 = 1/130;
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = Окр(База*Коэффициент130*КлючеваяСтавка,2);
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30   = 0;
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0;
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90   = 0;
		
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки     = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = 0,"","1/130");
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки30   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30 = 0,"0","0");
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки3090 = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0,"","1/300");
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки90   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0,"","1/130");
		
		Возврат СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки*КоличествоДнейПросрочки;
	ИначеЕсли ПорядокРасчетаПени = 3 Тогда
		//Коэффициент130 = 1/360;
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = Окр(База*Коэффициент360*КлючеваяСтавка,2);
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30   = 0;
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0;
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90   = 0;
		
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки     = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = 0,"","1/360");
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки30   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30 = 0,"0","0");
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки3090 = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0,"","1/360");
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки90   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0,"","1/360");
		
		//База = ?(СтрокаТЧ.СуммаУчтеннойОплаты > 0, СтрокаТЧ.СуммаУчтеннойОплаты, ОстатокЗадолжненности);
		
		Возврат СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки*КоличествоДнейПросрочки;
		
	ИначеЕсли ПорядокРасчетаПени = 4 Тогда
		//Коэффициент130 = 1/10;
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = Окр(База*Коэффициент01,2);
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30   = 0;
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0;
		СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90   = 0;
		
		ТекстПроцентаНеустойкиПоДоговору = Формат(ПроцентНеустойкиПоДоговору, "ЧЦ=5; ЧДЦ=2");
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки     = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = 0,"",ТекстПроцентаНеустойкиПоДоговору);
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки30   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30 = 0,"0","0");
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки3090 = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0,"",ТекстПроцентаНеустойкиПоДоговору);
		СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки90   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0,"",ТекстПроцентаНеустойкиПоДоговору);
		
		//База = ?(СтрокаТЧ.СуммаУчтеннойОплаты > 0, СтрокаТЧ.СуммаУчтеннойОплаты, ОстатокЗадолжненности);
		Возврат СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки * КоличествоДнейПросрочки;
	Иначе
		Если КоличествоДнейПросрочки < 31 Тогда
			
			СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = 0;
			СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30   = 0;
			СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0;
			СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90   = 0;
			
			СтрокаТЧ.КоличествоДнейПросрочки30 = КоличествоДнейПросрочки;
			СтрокаТЧ.КоличествоДнейПросрочки3090 = 0;
			СтрокаТЧ.КоличествоДнейПросрочки90 = 0;
			
			СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки     = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = 0,"","1/130");
			СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки30   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30 = 0,?(СтрокаТЧ.КоличествоДнейПросрочки30=0, "", "0"),"0");
			СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки3090 = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0,"","1/300");
			СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки90   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90 = 0,"","1/130");
			
			
			Возврат 0;
		Иначе
			СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = 0;
			Если КоличествоДнейПросрочки > 90 Тогда 
				КоличествоДнейСверх90 = КоличествоДнейПросрочки - 90;
								
				СтрокаТЧ.КоличествоДнейПросрочки30 = 30;
				СтрокаТЧ.КоличествоДнейПросрочки3090 = 90;
				СтрокаТЧ.КоличествоДнейПросрочки90 = КоличествоДнейСверх90;
								
				СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30   = 0;
				СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 =  База*Коэффициент300*КлючеваяСтавка;
				СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90   = База*Коэффициент130*КлючеваяСтавка;
				
				РазмерНеустойкиСверх = СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090*90 +  
								СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90*КоличествоДнейСверх90;
								
				СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки     = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = 0,"","1/130");
				СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки30   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30 = 0,"0","0");
				СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки3090 = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0,"","1/300");
				СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки90   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90 = 0,"","1/130");
				
				Возврат  Окр(РазмерНеустойкиСверх,2);
			Иначе
				
								
				СтрокаТЧ.КоличествоДнейПросрочки30 = 30;
				СтрокаТЧ.КоличествоДнейПросрочки3090 = КоличествоДнейПросрочки-30;
				СтрокаТЧ.КоличествоДнейПросрочки90 = 0;
				
				СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30   = 0;
				СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = База*Коэффициент300*КлючеваяСтавка;
				СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90   = 0;
				
				СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки     = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки = 0,"","1/130");
				СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки30   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки30 = 0,"0","0");
				СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки3090 = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090 = 0,"","1/300");
				СтрокаТЧ.ПроцентНеустойкиЗаДеньПросрочки90   = ?(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки90 = 0,"","1/130");
				
				//База = ?(СтрокаТЧ.СуммаУчтеннойОплаты > 0, СтрокаТЧ.СуммаУчтеннойОплаты, ОстатокЗадолжненности);
				Возврат  Окр(СтрокаТЧ.РазмерНеустойкиЗаДеньПросрочки3090*(КоличествоДнейПросрочки-30),2);
			КонецЕсли;
		КонецЕсли;
				

	КонецЕсли;
		
			
КонецФункции

Функция КлючеваяСтавка(Дата)
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлючеваяСтавкаСрезПоследних.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.КлючеваяСтавка.СрезПоследних(&Период, ) КАК КлючеваяСтавкаСрезПоследних";
	Запрос.УстановитьПараметр("Период", Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат 0;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	

КонецФункции // КлючеваяСтавка()

Функция БанковскийСчетПоДоговору(ДоговорКонтрагента) Экспорт
	
	//Если ДоговорКонтрагента.Деятельность = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию("Деятельность РО" Тогда
	//	Возврат Справочники.БанковскиеСчета.
	//Иначе
	//	Возврат 
	//
	
КонецФункции
