#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Источник) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоИсточнику(Параметры.Источник);
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыЭтапыОбмена

&НаКлиенте
Процедура ЭтапыОбменаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыОбмена.ТекущиеДанные;
	
	Если (ТекущиеДанные = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент.Очистить();
	ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.Запрос);
	ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ЗапросЗаголовки);
	Если Не ПустаяСтрока(ТекущиеДанные.ЗапросТело) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ЗапросТело);
	КонецЕсли;
	
	ТекстовыйДокумент.ДобавитьСтроку("");
	Если Не ПустаяСтрока(ТекущиеДанные.ОтветЗаголовки) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ОтветЗаголовки);
	КонецЕсли;
	Если Не ПустаяСтрока(ТекущиеДанные.ОтветТело) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ОтветТело);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоИсточнику(Источник)
	
	ПротоколОбмена = Неопределено;
	
	Если ТипЗнч(Источник) = Тип("Строка") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОчередьСообщенийИСМП.ДатаСоздания                 КАК ДатаСоздания,
		|	ОчередьСообщенийИСМП.Документ                     КАК Документ,
		|	ОчередьСообщенийИСМП.Операция                     КАК Операция,
		|	ОчередьСообщенийИСМП.ПротоколОбмена               КАК ПротоколОбмена,
		|	ОчередьСообщенийИСМП.РеквизитыИсходящегоСообщения КАК РеквизитыИсходящегоСообщения,
		|	ОчередьСообщенийИСМП.ИдентификаторЗаявки          КАК ИдентификаторЗапроса
		|ИЗ
		|	РегистрСведений.ОчередьСообщенийИСМП              КАК ОчередьСообщенийИСМП
		|ГДЕ
		|	ОчередьСообщенийИСМП.Сообщение = &Сообщение");
		Запрос.УстановитьПараметр("Сообщение", Источник);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "ДатаСоздания, Документ, Операция, ИдентификаторЗапроса");
			ПротоколОбмена = Выборка.ПротоколОбмена.Получить();
			
			Если ПротоколОбмена = Неопределено Тогда
				РеквизитыСообщения = Выборка.РеквизитыИсходящегоСообщения.Получить();
				
				ПротоколОбмена = Новый Массив;
				
				СтрокаПротокола = Новый Структура;
				СтрокаПротокола.Вставить("ЗапросТело",        РеквизитыСообщения.ТекстСообщенияJSON);
				СтрокаПротокола.Вставить("ОтветТело",         "");
				СтрокаПротокола.Вставить("Операция",          Выборка.Операция);
				СтрокаПротокола.Вставить("ДатаУниверсальная", Выборка.ДатаСоздания);
				
				ПротоколОбмена.Добавить(СтрокаПротокола);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИСМППрисоединенныеФайлы.ДатаСоздания         КАК ДатаСоздания,
		|	ИСМППрисоединенныеФайлы.Документ             КАК Документ,
		|	ИСМППрисоединенныеФайлы.Операция             КАК Операция,
		|	ИСМППрисоединенныеФайлы.Описание             КАК Ошибка,
		|	ИСМППрисоединенныеФайлы.ФорматОбмена         КАК ФорматОбмена,
		|	ИСМППрисоединенныеФайлы.ИдентификаторЗапроса КАК ИдентификаторЗапроса
		|ИЗ
		|	Справочник.ИСМППрисоединенныеФайлы КАК ИСМППрисоединенныеФайлы
		|ГДЕ
		|	ИСМППрисоединенныеФайлы.Ссылка = &Сообщение");
		
		Запрос.УстановитьПараметр("Сообщение", Источник);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "ДатаСоздания, Документ, Операция, ИдентификаторЗапроса");
			ПротоколОбмена = ОбщегоНазначения.ЗначениеИзСтрокиXML(
				ИнтеграцияИС.ТекстСообщенияXMLИзПротокола(Источник))
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПротоколОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Для Каждого ЭлементДанных Из ПротоколОбмена Цикл
			
			СтрокаТЧ = ЭтапыОбмена.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЭлементДанных);
			СтрокаТЧ.Дата = ЭлементДанных.ДатаУниверсальная + (ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата());
			
			ОбъектJSON = ИнтерфейсМОТПСлужебный.ТекстJSONВОбъект(ЭлементДанных.ЗапросТело, Истина);
			Если ОбъектJSON <> Неопределено Тогда
				СтрокаТЧ.ЗапросТело = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ОбъектJSON);
			Иначе
				СтрокаТЧ.ЗапросТело = ЭлементДанных.ЗапросТело;
			КонецЕсли;
			
			ОбъектJSON = ИнтерфейсМОТПСлужебный.ТекстJSONВОбъект(ЭлементДанных.ОтветТело, Истина);
			Если ОбъектJSON <> Неопределено Тогда
				СтрокаТЧ.ОтветТело = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ОбъектJSON);
			Иначе
				СтрокаТЧ.ОтветТело = ЭлементДанных.ОтветТело;
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ЭтапыОбмена.Очистить();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти