
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает ручную корректировку по переданному документу.
// При включении учета по подразделениям на счете 44 для ряда документов некуда переносить подразделение из субконто.
// И чтобы при перепроведении оно не слетало, зафиксируем проводки ручной корректировкой.
// Количество таких документов не должно быть большим.
//
// Параметры:
//  Ссылка    - ДокументСсылка - Регистратор набора записей
//  Процессор - Структура - Конструктор состояния обработки (обновления) данных порциями,
//                             см ОбновлениеИнформационнойБазыПорционное.НовыйПроцессорПорционнойОбработки() 
//
Процедура УстановитьРучнуюКорректировкуДляДокументовБезПодразделенияЗатрат(Ссылка, Процессор) Экспорт
	
	ДокументыБезПодразделенияЗатрат = Процессор.ОбщиеДанные.ДокументыБезПодразделенияЗатрат;
	СписокСчетов = Процессор.ОбщиеДанные.СписокСчетов; // Список счетов 44, на которых установлено субконто "Подразделение"
	ТолькоГоловнойУзел = Процессор.ТолькоГоловнойУзел;
	
	Если ДокументыБезПодразделенияЗатрат.Найти(ТипЗнч(Ссылка)) <> Неопределено Тогда
		// Для документов ТребованиеНакладная и ОтчетПроизводстваЗаСмену ручная корректировка только в случае заполненного счета списания НДС
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ТребованиеНакладная")
			Или ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену") Тогда
			Если СписокСчетов.Найти(Ссылка.СчетСписанияНДС) = Неопределено Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ДокОбъект = Ссылка.ПолучитьОбъект();
		Если ДокОбъект <> Неопределено Тогда
			ДокОбъект.РучнаяКорректировка = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокОбъект, ТолькоГоловнойУзел, Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	УправлениеДоступомБПВызовСервера.ВыполнитьПроверкуПраваДоступаКДаннымБухгалтерии();
	
КонецПроцедуры
