#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.Код КАК Код,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.Наименование,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.НаименованиеПолное,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.РегистрацияПоМестуНахожденияОрганизации,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.БазоваяДоходность,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.ИмяФизическогоПоказателя,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.ПодсказкаФизическогоПоказателя
	|ИЗ
	|	Справочник.КлассификаторВидовПредпринимательскойДеятельностиЕНВД КАК КлассификаторВидовПредпринимательскойДеятельностиЕНВД
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	ТаблицаВидовПредпринимательскойДеятельностиЕНВД = Запрос.Выполнить().Выгрузить();
	
	ТаблицаВидовПредпринимательскойДеятельностиЕНВД.Колонки.Добавить(
		"ФизическийПоказатель",
		ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	Для Каждого СтрокаТаблицы Из ТаблицаВидовПредпринимательскойДеятельностиЕНВД Цикл
		ИмяФизическогоПоказателя = СтрокаТаблицы.ИмяФизическогоПоказателя;
		Если ЗначениеЗаполнено(ИмяФизическогоПоказателя) Тогда
			СтрокаТаблицы.ФизическийПоказатель = ОбщегоНазначения.ИмяЗначенияПеречисления(ИмяФизическогоПоказателя);
		КонецЕсли;
	КонецЦикла;
	ТаблицаВидовПредпринимательскойДеятельностиЕНВД.Колонки.Удалить("ИмяФизическогоПоказателя");
	
	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаВидовПредпринимательскойДеятельностиЕНВД);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(СтрокаXML);
	
КонецПроцедуры

#КонецОбласти