#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
	Результат.Вставить("ИспользоватьПослеКомпоновкиМакета",  Истина);
	Результат.Вставить("ИспользоватьПослеВыводаРезультата",  Истина);
	Результат.Вставить("ИспользоватьДанныеРасшифровки",      Истина);
							
	Возврат Результат;
							
КонецФункции

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт 
	
	Возврат "Анализ движений денежных средств" + БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода);
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	ВидыСубконтоКД = Новый СписокЗначений;
	ВидыСубконтоКД.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоКД.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВидыСубконтоКД", ВидыСубконтоКД);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	КонецЕсли;
	
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	Если ПараметрыОтчета.ПоказательПоступление Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "СуммаПриход");
	КонецЕсли;
	Если ПараметрыОтчета.ПоказательРасход Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "СуммаРасход");
	КонецЕсли;
	
	Если Не ПараметрыОтчета.ПоказательПоступление
		И ПараметрыОтчета.ПоказательРасход Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "СуммаРасход",, ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	Если ПараметрыОтчета.ПоказательПоступление
		И Не ПараметрыОтчета.ПоказательРасход Тогда
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "СуммаПриход",, ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	
	// Группировка
	БухгалтерскиеОтчетыВызовСервера.ДобавитьГруппировки(ПараметрыОтчета, КомпоновщикНастроек);
	
	// Дополнительные данные
	БухгалтерскиеОтчетыВызовСервера.ДобавитьДополнительныеПоля(ПараметрыОтчета, КомпоновщикНастроек);
	
	БухгалтерскиеОтчетыВызовСервера.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);
	
КонецПроцедуры

Процедура ПослеКомпоновкиМакета(ПараметрыОтчета, МакетКомпоновки) Экспорт
	
	// Отключить расшифровки для всех ячеек кроме ДокументОплаты, 
	// также по этой строке установить для всех ячеек расшифровку аналогичную полю ДокументОплаты.
	Для Каждого Макет Из МакетКомпоновки.Макеты Цикл
		Если Макет.Параметры.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаМакета Из Макет.Макет Цикл
			Для Каждого ЯчейкаМакета Из СтрокаМакета.Ячейки Цикл
				Если ЯчейкаМакета.Элементы.Количество() > 0 Тогда
					ЭтоПолеДокументОплаты = Ложь;
					ЗначениеПараметра = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(ЯчейкаМакета.Оформление.Элементы, "Расшифровка");
					Если ЗначениеПараметра <> Неопределено И ЗначениеПараметра.Использование Тогда
						ПараметрРасшифровки = Макет.Параметры[Строка(ЗначениеПараметра.Значение)];
						Для Каждого ВыражениеПоля Из ПараметрРасшифровки.ВыраженияПолей Цикл
							Если ВыражениеПоля.Выражение = "ОсновнойНабор.ДокументОплаты" Тогда
								ЭтоПолеДокументОплаты = Истина;
								Для Каждого Параметр Из Макет.Параметры Цикл
									Если ТипЗнч(Параметр) = Тип("ПараметрОбластиРасшифровкаКомпоновкиДанных") Тогда
										Параметр.ВыраженияПолей.Очистить();
										
										НовоеВыражениеПоля = Параметр.ВыраженияПолей.Добавить();
										НовоеВыражениеПоля.Выражение = "ОсновнойНабор.ДокументОплаты";
										НовоеВыражениеПоля.Поле      = "ДокументОплаты";
									КонецЕсли;
								КонецЦикла;
								
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если Не ЭтоПолеДокументОплаты Тогда
							ЗначениеПараметра.Использование = Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);
	
КонецПроцедуры

Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализДвиженийДенежныхСредств").Размещение.Вставить(Метаданные.Подсистемы.Руководителю.Подсистемы.ДенежныеСредства, "");
	
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	
КонецПроцедуры

// Формирует таблицу данных для монитора руководителя по организации за период
// Параметры
// 	Организация - СправочникСсылка.Организации - Организация по которой нужны данные
// 	ДатаКон - Дата - дата конца периода
// Возвращаемое значение:
// 	ТаблицаЗначений - Таблица с данными для монитора руководителя
//
Функция ПолучитьДвижениеДенежныхСредствДляМонитораРуководителя(Организация, ДатаКон) Экспорт 
	
	НачалоГода            = НачалоГода(ДатаКон);
	НачалоМесяца          = НачалоМесяца(ДатаКон);
	НачалоПрошлогоМесяца  = ДобавитьМесяц(НачалоМесяца, -1);
	КонецПрошлогоМесяца   = КонецМесяца(НачалоПрошлогоМесяца);
	НачалоПрошлогоПериода = НачалоГода(НачалоПрошлогоМесяца);
	КонецПериода          = КонецДня(ДатаКон);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",           Организация);
	Запрос.УстановитьПараметр("НачалоГода",            НачалоГода);
	Запрос.УстановитьПараметр("НачалоМесяца",          НачалоМесяца);
	Запрос.УстановитьПараметр("НачалоПрошлогоМесяца",  НачалоПрошлогоМесяца);
	Запрос.УстановитьПараметр("НачалоПрошлогоПериода", НачалоПрошлогоПериода);
	Запрос.УстановитьПараметр("КонецПрошлогоМесяца",   КонецПрошлогоМесяца);
	Запрос.УстановитьПараметр("КонецПериода",          КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаГраница",   Новый Граница(КонецПериода));
		
	// Получим список счетов, по которым не хотим отбирать.
	СписокИсключаемыхСчетов = СчетаИсключаемыеИзРазделаМонитораРуководителя();
	
	// Получим счета подразделов.
	СписокСчетовКасса = СчетаПодразделаКассаМонитораРуководителя();
	Запрос.УстановитьПараметр("СписокСчетовКасса", СписокСчетовКасса);
	
	СписокСчетовБанк = СчетаПодразделаБанкМонитораРуководителя(СписокИсключаемыхСчетов);
	Запрос.УстановитьПараметр("СписокСчетовБанк", СписокСчетовБанк);
	
	СписокСчетовПлатежныеКарты = СчетаПодразделаПлатежныеКартыМонитораРуководителя();
	Запрос.УстановитьПараметр("СписокСчетовПлатежныеКарты", СписокСчетовПлатежныеКарты);
	
	// Получим список счетов для отбора оборотов.
	ПредопределенныйСписокСчетов = Новый Массив;
	ПредопределенныйСписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_);
	СписокСчетовДляОтбора = БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныйСписокСчетов);
	
	// Дополним счетами подразделов "Касса" и "Банк".
	// Счета подраздела "ПлатежныеКарты" не нужно включать в список счетов для отбора, т.к. данные подраздела определяются по Корсчету.
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокСчетовДляОтбора, СписокСчетовКасса);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СписокСчетовДляОтбора, СписокСчетовБанк);
	
	// Исключим из списка счета, по которым не хотим отбирать.
	СписокСчетовДляОтбора = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокСчетовДляОтбора, СписокИсключаемыхСчетов);
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовДляОтбора);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоМесяца
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеТекущийМесяц,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоМесяца
	|						И ХозрасчетныйОборотыПоМесяцам.СчетДт В (&СписокСчетовКасса)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеТекущийМесяцКасса,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоМесяца
	|						И ХозрасчетныйОборотыПоМесяцам.СчетДт В (&СписокСчетовБанк)
	|						И НЕ ХозрасчетныйОборотыПоМесяцам.СчетКт В (&СписокСчетовПлатежныеКарты)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеТекущийМесяцБанк,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоМесяца
	|						И ХозрасчетныйОборотыПоМесяцам.СчетКт В (&СписокСчетовПлатежныеКарты)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеТекущийМесяцПлатежныеКарты,
	|	0 КАК РасходТекущийМесяц,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоГода И &КонецПериода
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеТекущийГод,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоГода И &КонецПериода
	|						И ХозрасчетныйОборотыПоМесяцам.СчетДт В (&СписокСчетовКасса)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеТекущийГодКасса,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоГода И &КонецПериода
	|						И ХозрасчетныйОборотыПоМесяцам.СчетДт В (&СписокСчетовБанк)
	|						И НЕ ХозрасчетныйОборотыПоМесяцам.СчетКт В (&СписокСчетовПлатежныеКарты)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеТекущийГодБанк,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоГода И &КонецПериода
	|						И ХозрасчетныйОборотыПоМесяцам.СчетКт В (&СписокСчетовПлатежныеКарты)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеТекущийГодПлатежныеКарты,
	|	0 КАК РасходТекущийГод,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоПрошлогоМесяца
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеПрошлыйМесяц,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоПрошлогоМесяца
	|						И ХозрасчетныйОборотыПоМесяцам.СчетДт В (&СписокСчетовКасса)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеПрошлыйМесяцКасса,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоПрошлогоМесяца
	|						И ХозрасчетныйОборотыПоМесяцам.СчетДт В (&СписокСчетовБанк)
	|						И НЕ ХозрасчетныйОборотыПоМесяцам.СчетКт В (&СписокСчетовПлатежныеКарты)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеПрошлыйМесяцБанк,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоПрошлогоМесяца
	|						И ХозрасчетныйОборотыПоМесяцам.СчетКт В (&СписокСчетовПлатежныеКарты)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеПрошлыйМесяцПлатежныеКарты,
	|	0 КАК РасходПрошлыйМесяц,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоПрошлогоПериода И &КонецПрошлогоМесяца
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеПрошлыйПериод,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоПрошлогоПериода И &КонецПрошлогоМесяца
	|						И ХозрасчетныйОборотыПоМесяцам.СчетДт В (&СписокСчетовКасса)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеПрошлыйПериодКасса,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоПрошлогоПериода И &КонецПрошлогоМесяца
	|						И ХозрасчетныйОборотыПоМесяцам.СчетДт В (&СписокСчетовБанк)
	|						И НЕ ХозрасчетныйОборотыПоМесяцам.СчетКт В (&СписокСчетовПлатежныеКарты)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеПрошлыйПериодБанк,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоПрошлогоПериода И &КонецПрошлогоМесяца
	|						И ХозрасчетныйОборотыПоМесяцам.СчетКт В (&СписокСчетовПлатежныеКарты)
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПоступлениеПрошлыйПериодПлатежныеКарты,
	|	0 КАК РасходПрошлыйПериод
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПрошлогоПериода, &КонецПериодаГраница, Месяц, СчетДт В (&СписокСчетов), , НЕ СчетКт В (&СписокСчетов), , Организация = &Организация) КАК ХозрасчетныйОборотыПоМесяцам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоМесяца
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоГода И &КонецПериода
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период = &НачалоПрошлогоМесяца
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА ХозрасчетныйОборотыПоМесяцам.Период МЕЖДУ &НачалоПрошлогоПериода И &КонецПрошлогоМесяца
	|					ТОГДА ХозрасчетныйОборотыПоМесяцам.СуммаОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0)
	|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПрошлогоПериода, &КонецПериодаГраница, Месяц, НЕ СчетДт В (&СписокСчетов), , СчетКт В (&СписокСчетов), , Организация = &Организация) КАК ХозрасчетныйОборотыПоМесяцам
	|ИТОГИ
	|	СУММА(ПоступлениеТекущийМесяц),
	|	СУММА(ПоступлениеТекущийМесяцКасса),
	|	СУММА(ПоступлениеТекущийМесяцБанк),
	|	СУММА(ПоступлениеТекущийМесяцПлатежныеКарты),
	|	СУММА(РасходТекущийМесяц),
	|	СУММА(ПоступлениеТекущийГод),
	|	СУММА(ПоступлениеТекущийГодКасса),
	|	СУММА(ПоступлениеТекущийГодБанк),
	|	СУММА(ПоступлениеТекущийГодПлатежныеКарты),
	|	СУММА(РасходТекущийГод),
	|	СУММА(ПоступлениеПрошлыйМесяц),
	|	СУММА(ПоступлениеПрошлыйМесяцКасса),
	|	СУММА(ПоступлениеПрошлыйМесяцБанк),
	|	СУММА(ПоступлениеПрошлыйМесяцПлатежныеКарты),
	|	СУММА(РасходПрошлыйМесяц),
	|	СУММА(ПоступлениеПрошлыйПериод),
	|	СУММА(ПоступлениеПрошлыйПериодКасса),
	|	СУММА(ПоступлениеПрошлыйПериодБанк),
	|	СУММА(ПоступлениеПрошлыйПериодПлатежныеКарты),
	|	СУММА(РасходПрошлыйПериод)
	|ПО
	|	ОБЩИЕ";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПоступлениеТекущийМесяц  = НовыйСуммыПодразделовМонитораРуководителя();
	ПоступлениеПрошлыйМесяц  = НовыйСуммыПодразделовМонитораРуководителя();
	ПоступлениеТекущийГод    = НовыйСуммыПодразделовМонитораРуководителя();
	ПоступлениеПрошлыйПериод = НовыйСуммыПодразделовМонитораРуководителя();
	
	РасходТекущийМесяц = 0;
	РасходПрошлыйМесяц = 0;
	РасходТекущийГод  = 0;
	РасходПрошлыйГод  = 0;
	
	Если Результат.Следующий() Тогда
		
		ПоступлениеТекущийМесяц.Итого  = Результат.ПоступлениеТекущийМесяц;
		ПоступлениеПрошлыйМесяц.Итого  = Результат.ПоступлениеПрошлыйМесяц;
		ПоступлениеТекущийГод.Итого    = Результат.ПоступлениеТекущийГод;
		ПоступлениеПрошлыйПериод.Итого = Результат.ПоступлениеПрошлыйПериод;
		
		ПоступлениеТекущийМесяц.Касса  = Результат.ПоступлениеТекущийМесяцКасса;
		ПоступлениеПрошлыйМесяц.Касса  = Результат.ПоступлениеПрошлыйМесяцКасса;
		ПоступлениеТекущийГод.Касса    = Результат.ПоступлениеТекущийГодКасса;
		ПоступлениеПрошлыйПериод.Касса = Результат.ПоступлениеПрошлыйПериодКасса;
		
		ПоступлениеТекущийМесяц.Банк  = Результат.ПоступлениеТекущийМесяцБанк;
		ПоступлениеПрошлыйМесяц.Банк  = Результат.ПоступлениеПрошлыйМесяцБанк;
		ПоступлениеТекущийГод.Банк    = Результат.ПоступлениеТекущийГодБанк;
		ПоступлениеПрошлыйПериод.Банк = Результат.ПоступлениеПрошлыйПериодБанк;
		
		ПоступлениеТекущийМесяц.ПлатежныеКарты  = Результат.ПоступлениеТекущийМесяцПлатежныеКарты;
		ПоступлениеПрошлыйМесяц.ПлатежныеКарты  = Результат.ПоступлениеПрошлыйМесяцПлатежныеКарты;
		ПоступлениеТекущийГод.ПлатежныеКарты    = Результат.ПоступлениеТекущийГодПлатежныеКарты;
		ПоступлениеПрошлыйПериод.ПлатежныеКарты = Результат.ПоступлениеПрошлыйПериодПлатежныеКарты;
		
		РасходТекущийМесяц  = Результат.РасходТекущийМесяц;
		РасходПрошлыйМесяц  = Результат.РасходПрошлыйМесяц;
		РасходТекущийГод    = Результат.РасходТекущийГод;
		РасходПрошлыйПериод = Результат.РасходПрошлыйПериод;
		
	КонецЕсли;
	
	ПредставлениеТекущегоМесяца            = МониторРуководителя.ПолучитьПредставлениеПериода(НачалоМесяца, КонецПериода);
	ПредставлениеТекущегоМесяцаСНачалаГода = МониторРуководителя.ПолучитьПредставлениеПериода(НачалоГода, КонецПериода);
	ПредставлениеПрошлогоМесяца            = МониторРуководителя.ПолучитьПредставлениеПериода(НачалоПрошлогоМесяца, КонецПрошлогоМесяца);
	ПредставлениеПрошлогоМесяцаСНачалаГода = МониторРуководителя.ПолучитьПредставлениеПериода(НачалоПрошлогоПериода, КонецПрошлогоМесяца);
	
	// Поступление денежных средств.
	ТаблицаПоступлениеДенежныхСредств = МониторРуководителя.ТаблицаДанных();
	
	// Текущий месяц.
	ДополнитьТаблицуДанныхМонитораРуководителя(ТаблицаПоступлениеДенежныхСредств, ПредставлениеТекущегоМесяца, ПоступлениеТекущийМесяц, 1);
	
	// С начала года по конец текущего месяца.
	ДополнитьТаблицуДанныхМонитораРуководителя(ТаблицаПоступлениеДенежныхСредств, ПредставлениеТекущегоМесяцаСНачалаГода, ПоступлениеТекущийГод, 2);
	
	// Предыдущий месяц.
	ДополнитьТаблицуДанныхМонитораРуководителя(ТаблицаПоступлениеДенежныхСредств, ПредставлениеПрошлогоМесяца, ПоступлениеПрошлыйМесяц, 3);
	
	// С начала года по конец предыдущего месяца.
	ДополнитьТаблицуДанныхМонитораРуководителя(ТаблицаПоступлениеДенежныхСредств, ПредставлениеПрошлогоМесяцаСНачалаГода, ПоступлениеПрошлыйПериод, 4);
	
	// Расход денежных средств.
	ТаблицаРасходДенежныхСредств = МониторРуководителя.ТаблицаДанных();
	
	СтрокаТаблицы = ТаблицаРасходДенежныхСредств.Добавить();
	СтрокаТаблицы.Представление = ПредставлениеТекущегоМесяца;
	СтрокаТаблицы.Сумма 		= РасходТекущийМесяц;
	СтрокаТаблицы.Порядок		= 1;
	
	СтрокаТаблицы = ТаблицаРасходДенежныхСредств.Добавить();
	СтрокаТаблицы.Представление = ПредставлениеТекущегоМесяцаСНачалаГода;
	СтрокаТаблицы.Сумма 	    = РасходТекущийГод;
	СтрокаТаблицы.Порядок		= 2;
	
	СтрокаТаблицы = ТаблицаРасходДенежныхСредств.Добавить();
	СтрокаТаблицы.Представление = ПредставлениеПрошлогоМесяца;
	СтрокаТаблицы.Сумма 		= РасходПрошлыйМесяц;
	СтрокаТаблицы.Порядок		= 3;
	
	СтрокаТаблицы = ТаблицаРасходДенежныхСредств.Добавить();
	СтрокаТаблицы.Представление = ПредставлениеПрошлогоМесяцаСНачалаГода;
	СтрокаТаблицы.Сумма 		= РасходПрошлыйПериод;
	СтрокаТаблицы.Порядок		= 4;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТаблицаПоступлениеДенежныхСредств", ТаблицаПоступлениеДенежныхСредств);
	СтруктураДанных.Вставить("ТаблицаРасходДенежныхСредств", ТаблицаРасходДенежныхСредств);
	
	Возврат СтруктураДанных;
	
КонецФункции

//Процедура используется подсистемой варианты отчетов
//
Процедура НастройкиОтчета(Настройки) Экспорт
	
	ВариантыНастроек = ВариантыНастроек();
	Для Каждого Вариант Из ВариантыНастроек Цикл
		 Настройки.ОписаниеВариантов.Вставить(Вариант.Имя,Вариант.Представление);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьНаборПоказателей() Экспорт
	
	НаборПоказателей = Новый Массив;
	НаборПоказателей.Добавить("Поступление");
	НаборПоказателей.Добавить("Расход");

	Возврат НаборПоказателей;
	
КонецФункции

Функция ВариантыНастроек() Экспорт
	
	Массив = Новый Массив;
	
	Массив.Добавить(Новый Структура("Имя, Представление","АнализДвиженийДенежныхСредств", "Анализ движений денежных средств"));
	
	Возврат Массив;
	
КонецФункции

// Возвращает набор параметров, которые необходимо сохранять в рассылке отчетов.
// Значения параметров используются при формировании отчета в рассылке.
//
// Возвращаемое значение:
//   Структура - структура настроек, сохраняемых в рассылке с неинициализированными значениями.
//
Функция НастройкиОтчетаСохраняемыеВРассылке() Экспорт
	
	КоллекцияНастроек = Новый Структура;
	Для Каждого Показатель Из ПолучитьНаборПоказателей() Цикл
		КоллекцияНастроек.Вставить("Показатель" + Показатель, Ложь);
	КонецЦикла;
	КоллекцияНастроек.Вставить("Организация"                      , Справочники.Организации.ПустаяСсылка());
	КоллекцияНастроек.Вставить("ВключатьОбособленныеПодразделения", Ложь);
	КоллекцияНастроек.Вставить("РазмещениеДополнительныхПолей"    , 0);
	КоллекцияНастроек.Вставить("Группировка"                      , Неопределено);
	КоллекцияНастроек.Вставить("ДополнительныеПоля"               , Неопределено);
	КоллекцияНастроек.Вставить("ВыводитьЗаголовок"                , Ложь);
	КоллекцияНастроек.Вставить("ВыводитьПодвал"                   , Ложь);
	КоллекцияНастроек.Вставить("МакетОформления"                  , Неопределено);
	КоллекцияНастроек.Вставить("НастройкиКомпоновкиДанных"        , Неопределено);
	
	Возврат КоллекцияНастроек;
	
КонецФункции

// Возвращает структуру параметров, наличие которых требуется для успешного формирования отчета.
//
// Возвращаемое значение:
//   Структура - структура параметров для формирования отчета.
//
Функция ПустыеПараметрыКомпоновкиОтчета() Экспорт
	
	// Часть параметров компоновки отчета используется так же и в рассылке отчета.
	ПараметрыОтчета = НастройкиОтчетаСохраняемыеВРассылке();
	
	// Дополним параметрами, влияющими на формирование отчета.
	ПараметрыОтчета.Вставить("ПериодОтчета"         , Неопределено);
	ПараметрыОтчета.Вставить("НачалоПериода"        , Дата(1,1,1));
	ПараметрыОтчета.Вставить("КонецПериода"         , Дата(1,1,1));
	ПараметрыОтчета.Вставить("РежимРасшифровки"     , Ложь);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки"    , Неопределено);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных", Неопределено);
	ПараметрыОтчета.Вставить("ИдентификаторОтчета"  , "");
	
	Возврат ПараметрыОтчета;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция НовыйСуммыПодразделовМонитораРуководителя()
	
	СуммыПодразделов = Новый Структура;
	СуммыПодразделов.Вставить("Итого", 0);
	СуммыПодразделов.Вставить("Касса", 0);
	СуммыПодразделов.Вставить("Банк", 0);
	СуммыПодразделов.Вставить("ПлатежныеКарты", 0);
	
	Возврат СуммыПодразделов;
	
КонецФункции

Процедура ДополнитьТаблицуДанныхМонитораРуководителя(ТаблицаДанных, ПредставлениеПоказателя, СуммыПоказателей, Порядок)
	
	СтрокаТаблицы = ТаблицаДанных.Добавить();
	СтрокаТаблицы.Представление = ПредставлениеПоказателя;
	СтрокаТаблицы.Сумма 		= СуммыПоказателей.Итого;
	СтрокаТаблицы.Порядок		= Порядок;
	
	СтрокаТаблицы = ТаблицаДанных.Добавить();
	СтрокаТаблицы.ПодразделМонитора = Перечисления.ПодразделыМонитораРуководителя.Касса;
	СтрокаТаблицы.Представление = ПредставлениеПоказателя;
	СтрокаТаблицы.Сумма 		= СуммыПоказателей.Касса;
	СтрокаТаблицы.Порядок		= Порядок;
	
	СтрокаТаблицы = ТаблицаДанных.Добавить();
	СтрокаТаблицы.ПодразделМонитора = Перечисления.ПодразделыМонитораРуководителя.Банк;
	СтрокаТаблицы.Представление = ПредставлениеПоказателя;
	СтрокаТаблицы.Сумма 		= СуммыПоказателей.Банк;
	СтрокаТаблицы.Порядок		= Порядок;
	
	СтрокаТаблицы = ТаблицаДанных.Добавить();
	СтрокаТаблицы.ПодразделМонитора = Перечисления.ПодразделыМонитораРуководителя.ПлатежныеКарты;
	СтрокаТаблицы.Представление = ПредставлениеПоказателя;
	СтрокаТаблицы.Сумма 		= СуммыПоказателей.ПлатежныеКарты;
	СтрокаТаблицы.Порядок		= Порядок;
	
КонецПроцедуры

Функция СчетаИсключаемыеИзРазделаМонитораРуководителя()
	
	ГруппыИсключаемыхСчетов = Новый Массив;
	ГруппыИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ДенежныеДокументы);             // 50.03
	ГруппыИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ДенежныеДокументыВал);          // 50.23
	ГруппыИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты); // 57.02
	ГруппыИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам);      // 57.03
	ГруппыИсключаемыхСчетов.Добавить(ПланыСчетов.Хозрасчетный.РеализацияИностраннойВалюты);   // 57.22
	
	ИсключаемыеСчета = БухгалтерскийУчет.СформироватьМассивСубсчетов(ГруппыИсключаемыхСчетов);
	
	Возврат ИсключаемыеСчета;
	
КонецФункции

Функция СчетаПодразделаКассаМонитораРуководителя()
	
	ГруппыСчетов = Новый Массив;
	ГруппыСчетов.Добавить(ПланыСчетов.Хозрасчетный.Касса); // 50
	
	СписокСчетов = БухгалтерскийУчет.СформироватьМассивСубсчетов(ГруппыСчетов);
	
	Возврат СписокСчетов;
	
КонецФункции

Функция СчетаПодразделаБанкМонитораРуководителя(ИсключаемыеСчета)
	
	ГруппыСчетов = Новый Массив;
	ГруппыСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);   // 51
	ГруппыСчетов.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);    // 52
	ГруппыСчетов.Добавить(ПланыСчетов.Хозрасчетный.СпециальныеСчета); // 55
	ГруппыСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПереводыВПути_);   // 57
	
	СписокСчетов = БухгалтерскийУчет.СформироватьМассивСубсчетов(ГруппыСчетов);
	СписокСчетов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокСчетов, ИсключаемыеСчета);
	
	Возврат СписокСчетов;
	
КонецФункции

Функция СчетаПодразделаПлатежныеКартыМонитораРуководителя()
	
	ГруппыСчетов = Новый Массив;
	ГруппыСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам); // 57.03
	
	СписокСчетов = БухгалтерскийУчет.СформироватьМассивСубсчетов(ГруппыСчетов);
	
	Возврат СписокСчетов;
	
КонецФункции

#КонецЕсли