
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура(
		"Организация, Период",
		НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Организация,
		НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.Период);
		
	Оповестить("Запись_НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС", ПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти