
#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьНавигационнуюСсылкуПодробноОСервисе() Экспорт
	
	ИнформационнаяСсылка = "https://welcome.1c-cabinet.ru/app/info?state=about";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИнформационнаяСсылка);

КонецПроцедуры

Процедура ОткрытьНавигационнуюСсылкуОписаниеДоступаКДанным() Экспорт

	ИнформационнаяСсылка = "https://welcome.1c-cabinet.ru/app/info?state=security";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИнформационнаяСсылка);	

КонецПроцедуры

Процедура ОткрытьНавигационнуюСсылкуПоддерживаемыеБраузеры() Экспорт

	ИнформационнаяСсылка = "https://welcome.1c-cabinet.ru/app/info?state=technicalinfo";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИнформационнаяСсылка);

КонецПроцедуры

#КонецОбласти
