
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДоговорКонтрагента", ПолучитьСписокДоговоров(ПараметрКоманды));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "РасчетыПоАренде");
	ПараметрыФормы.Вставить("СброситьПользовательскиеНастройки", Истина);
 	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "КонтекстныйОтчет");
  	ПараметрыФормы.Вставить("КлючПользовательскихНастроек", "КонтекстныйОтчет");	
	
	ОткрытьФорму("Отчет.АР_ОтчетПоНачислениямИВыплатамАренднойПлаты.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокДоговоров(ОбъектАренды)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АР_СтатусыОбъектовАрендыСрезПоследних.Договор
	|ИЗ
	|	РегистрСведений.АР_СтатусыОбъектовАренды.СрезПоследних(, ОбъектАренды В ИЕРАРХИИ(&ОбъектАренды)) КАК АР_СтатусыОбъектовАрендыСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектАренды", ОбъектАренды);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");
	
КонецФункции

