#Область ПрограммныйИнтерфейс

// Конструктор структуры параметров метода получения видов деятельности ПСН
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыМетодаВидыДеятельностиПСН() Экспорт
	
	Возврат Новый Структура("КодРегиона", "");
	
КонецФункции

// Конструктор структуры параметров метода получения ставок ПСН
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыМетодаСтавкиПСН() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодРегиона", "");
	Результат.Вставить("КодВидаДеятельности", "");
	Результат.Вставить("Период", '00010101');
	
	Возврат Результат;
	
КонецФункции

// Конструктор структуры параметров метода получения краткого описания ставок ПСН
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыМетодаОписаниеСтавокПСН() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодРегиона", "");
	Результат.Вставить("КодВидаДеятельности", "");
	Результат.Вставить("Период", '00010101');
	
	Возврат Результат;
	
КонецФункции

// Конструктор структуры параметров метода получения ставок УСН
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыМетодаСтавкиУСН() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодРегиона", "");
	Результат.Вставить("ЭтоЮрЛицо", Ложь);
	Результат.Вставить("КодВидаДеятельности", "");
	Результат.Вставить("ПрименяетсяУСНДоходы", Ложь);
	Результат.Вставить("ПрименяетсяУСНДоходыРасходы", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Конструктор структуры параметров метода получения краткого описания ставок УСН
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыМетодаОписаниеСтавокУСН() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодРегиона", "");
	Результат.Вставить("ЭтоЮрЛицо", Ложь);
	Результат.Вставить("КодВидаДеятельности", "");
	Результат.Вставить("ПрименяетсяУСНДоходы", Ложь);
	Результат.Вставить("ПрименяетсяУСНДоходыРасходы", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Конструктор структуры параметров отчета "Ставки налога в вашем регионе"
//
// Возвращаемое значение:
//  Структура
//
Функция ПараметрыОтчетаСтавкиНалогаВВашемРегионе() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Налог", "");
	Результат.Вставить("Режим", "");
	Результат.Вставить("КодРегиона", "");
	Результат.Вставить("НаименованиеРегиона", "");
	Результат.Вставить("КодВидаДеятельности", "");
	Результат.Вставить("НаименованиеВидаДеятельности", "");
	Результат.Вставить("ЭтоЮрЛицо", Ложь);
	Результат.Вставить("ПрименяетсяУСНДоходы", Ложь);
	Результат.Вставить("ПрименяетсяУСНДоходыРасходы", Ложь);
	Результат.Вставить("Период", '00010101');
	Результат.Вставить("ПоказыватьПрименить", Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОписаниеСтавокНалога

Процедура ПолучитьОписаниеСтавокУСНВФоне(Форма, ДекорацияОписание, ДекорацияДлительнаяОперация, ПараметрыМетода, Обработчик) Экспорт

	ДлительнаяОперация = РегиональныеСтавкиНалоговВызовСервера.ПолучитьОписаниеСтавокУСНВФоне(
		ПараметрыМетода, Форма.УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		
		ДекорацияДлительнаяОперация.Видимость = Истина;
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		
	Иначе
		ОбработкаОшибкиПолученияОписанияСтавокНалога(ДекорацияОписание, ДекорацияДлительнаяОперация);
	КонецЕсли;

КонецПроцедуры

Процедура ПолучитьОписаниеСтавокПСНВФоне(Форма, ДекорацияОписание, ДекорацияДлительнаяОперация, ПараметрыМетода, Обработчик) Экспорт

	ДлительнаяОперация = РегиональныеСтавкиНалоговВызовСервера.ПолучитьОписаниеСтавокПСНВФоне(
		ПараметрыМетода, Форма.УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		
		ДекорацияДлительнаяОперация.Видимость = Истина;
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		НастройкиОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
		
	Иначе
		ОбработкаОшибкиПолученияОписанияСтавокНалога(ДекорацияОписание, ДекорацияДлительнаяОперация);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПолученияОписанияСтавокНалога(ДлительнаяОперация, ДекорацияОписание, ДекорацияДлительнаяОперация) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" И ЭтоАдресВременногоХранилища(ДлительнаяОперация.АдресРезультата) Тогда
		
		ДекорацияДлительнаяОперация.Видимость = Ложь;
		Результат = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
		
		Если Результат.КодСостояния = 200 Тогда
			
			ТекстЗаголовка = СтрШаблон(
				"%1
				|<a href = СтавкиНалогаВВашемРегионе >%2</a>", 
				Результат.Ответ, НСтр("ru='Подробнее'"));
			ДекорацияОписание.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ТекстЗаголовка);
			
		Иначе
			ОбработкаОшибкиПолученияОписанияСтавокНалога(ДекорацияОписание, ДекорацияДлительнаяОперация);
		КонецЕсли;
	Иначе
		ОбработкаОшибкиПолученияОписанияСтавокНалога(ДекорацияОписание, ДекорацияДлительнаяОперация);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОшибкиПолученияОписанияСтавокНалога(ДекорацияОписание, ДекорацияДлительнаяОперация)
	
	ДекорацияОписание.Заголовок = НСтр("ru='Не удалось получить данные сервиса'");
	ДекорацияДлительнаяОперация.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
