
&НаСервере
Процедура ПриОткрытииНаСервере()

	
	Если Параметры.Ключ.Пустая() Тогда
		Ответственный=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() и ЗначениеЗаполнено(Ответственный) и не РольДоступна("РедактированиеПланов") и Ответственный<>ПараметрыСеанса.ТекущийПользователь Тогда
		ТолькоПросмотр=Истина;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Установитьвидимость();

	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Установитьвидимость()
	ПеремДата=НачалоМесяца(Объект.Дата);
	ПервыйДень=1;
	Пока Месяц(Объект.Дата)= Месяц(ПеремДата) Цикл
		НомерКолонки="Д"+Строка(ПервыйДень);
		ПервыйДень=ПервыйДень+1;
		Если Не Объект.ВсеДаты Тогда
			Если ДеньНедели(ПеремДата)<=5 ТОгда
				Элементы.Календарь.Колонки[НомерКолонки].Видимость=Истина;
			Иначе
				Элементы.Календарь.Колонки[НомерКолонки].Видимость=Ложь;
			КонецЕсли;
				
		Иначе
			Элементы.Календарь.Колонки[НомерКолонки].Видимость=Истина;
		КонецЕсли;
		Элементы.Календарь.Колонки[НомерКолонки].ТекстШапки=ФОрмат(ПеремДата,"ДФ=dd.MM.yyyy");
		ПеремДата=ПеремДата+86400;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСтатьиПриходамиНаСервере()

		
    Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	СтатьиДвиженияДенежныхСредств.Ссылка
	             |ИЗ
	             |	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	             |ГДЕ
	             |	СтатьиДвиженияДенежныхСредств.ПометкаУдаления = ЛОЖЬ
	             |	И СтатьиДвиженияДенежныхСредств.КодОтчета <> &Пустойкод
	             |	И СтатьиДвиженияДенежныхСредств.Ссылка В ИЕРАРХИИ(&Папка)
	             |	И СтатьиДвиженияДенежныхСредств.ЭтоГруппа = ЛОЖЬ
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СтатьиДвиженияДенежныхСредств.КодОТчета
	             |АВТОУПОРЯДОЧИВАНИЕ";		
	Запрос.УстановитьПараметр("Пустойкод","");
	Запрос.УстановитьПараметр("Папка",Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000085"));
	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий()Цикл
		Если Объект.ВсеСтатьи Тогда
			НовСтр= Объект.Календарь.Добавить();
			НовСтр.СтатьяДС=Выборка.Ссылка;
		иначе
			Нашли=Ложь;
			для Каждого стр из выборка.ссылка.ОтветственныеЗаПланирование Цикл
				Если стр.Пользователь=Объект.Ответственный Тогда
					Нашли=истина;
				КонецЕсли;
				Если Нашли Тогда
					НовСтр=Объект.Календарь.Добавить();
					НовСтр.СтатьяДС=Выборка.Ссылка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСтатьиПриходами(Команда)
	ЗаполнитьСтатьиПриходамиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСтатьямиРасходаНаСервере()
	 Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	СтатьиДвиженияДенежныхСредств.Ссылка
	             |ИЗ
	             |	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	             |ГДЕ
	             |	СтатьиДвиженияДенежныхСредств.ПометкаУдаления = ЛОЖЬ
	             |	И СтатьиДвиженияДенежныхСредств.КодОтчета <> &Пустойкод
	             |	И СтатьиДвиженияДенежныхСредств.Ссылка В ИЕРАРХИИ(&Папка)
	             |	И СтатьиДвиженияДенежныхСредств.ЭтоГруппа = ЛОЖЬ
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	СтатьиДвиженияДенежныхСредств.КодОТчета
	             |АВТОУПОРЯДОЧИВАНИЕ";		
	Запрос.УстановитьПараметр("Пустойкод","");
	Запрос.УстановитьПараметр("Папка",Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000120"));
	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий()Цикл
		Если Объект.ВсеСтатьи Тогда
			НовСтр=Объект.Календарь.Добавить();
			НовСтр.СтатьяДС=Выборка.Ссылка;
		иначе
			Нашли=Ложь;
			для Каждого стр из выборка.ссылка.ОтветственныеЗаПланирование Цикл
				Если стр.Пользователь=Объект.Ответственный Тогда
					Нашли=истина;
				КонецЕсли;
				Если Нашли Тогда
					НовСтр=Объект.Календарь.Добавить();
					НовСтр.СтатьяДС=Выборка.Ссылка;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСтатьямиРасхода(Команда)
	ЗаполнитьСтатьямиРасходаНаСервере();
КонецПроцедуры

