#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьФайлыНаРаспознавание(Файлы) Экспорт
	
	ДлительныеОперации.СообщитьПрогресс(, НСтр("ru = 'Создание задания распознавания документов...'"));
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Пользователь", Пользователи.ТекущийПользователь());
	
	Источник = Перечисления.ИсточникиПолученияФайлов.Вручную;
	Результат = РаспознаваниеДокументов.СоздатьЗаданиеДляРаспознавания(Файлы, Источник, Неопределено, ПараметрыЗадания);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда 
		ВызватьИсключение 
			НСтр("ru = 'Произошла ошибка при отправке:
			           |Возможно подключение к сети Интернет отсутствует.
			           |Обратитесь к администратору.'");
	КонецЕсли;
	
	// Замер производительности
	РезультатОбратнойСвязи = РаспознаваниеДокументов.ОписаниеОбратнойСвязи("Отправлен");
	Пакет = Новый Структура("created", РезультатОбратнойСвязи);
	РаспознаваниеДокументовКоннекторСлужебный.ПередатьОбратнуюСвязь(Результат, Пакет);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
