
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ДокументВладелец", ДокументВладелец);
	Параметры.Свойство("Услуга", Услуга);
	Параметры.Свойство("ОбъектАренды", ОбъектАренды);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧасти

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ДокументВладелец", ДокументВладелец);
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);

		ФормаГрафика = ПолучитьФорму("Справочник.АР_СпискиСчетчиков.ФормаОбъекта", ПараметрыФормы);
		ФормаГрафика.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументВладелец", ДокументВладелец);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);

	ФормаСчетчика = ПолучитьФорму("Справочник.АР_СпискиСчетчиков.ФормаОбъекта", ПараметрыФормы, Элемент);
	ФормаСчетчика.Объект.Владелец = АР_ОбщиеПроцедуры.ЗначениеРеквизитаОбъекта(ДокументВладелец, "ДоговорКонтрагента");
	ФормаСчетчика.Объект.Документ = ДокументВладелец;
	ФормаСчетчика.Объект.Наименование = "Счетчики по услуге """ + Услуга + """ и объекту """ + ОбъектАренды + """";
	
	Если Копирование Тогда
		ПолучитьСписокСчетчиковНаСервере(ТекущиеДанные.Ссылка);
		Для Каждого Строк Из СписокСчетчиков Цикл
			Стр = ФормаСчетчика.Объект.СписокСчетчиков.Добавить();
			Стр.Счетчик = Строк.Счетчик;
			Стр.КоэффициентОтнесенияСчетчика = Строк.КоэффициентОтнесенияСчетчика;
		КонецЦикла;
	КонецЕсли;
	
	ФормаСчетчика.ЗакрыватьПриВыборе = Ложь;
	ФормаСчетчика.Открыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьСписокСчетчиковНаСервере(Ссылка)
	
	СписокСчетчиков.Очистить();
	Для Каждого Строк Из Ссылка.СписокСчетчиков Цикл
		Стр = СписокСчетчиков.Добавить();
		Стр.Счетчик = Строк.Счетчик;
		Стр.КоэффициентОтнесенияСчетчика = Строк.КоэффициентОтнесенияСчетчика;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

