
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	текПользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыСогласованияЗаявок.ТекущийЭтап КАК ТекущийЭтап,
		|	МАКСИМУМ(ЭтапыСогласованияЗаявок.МогутВидетьВсеЗаявки) КАК МогутВидетьВсеЗаявки,
		|	ЭтапыСогласованияЗаявок.ЦФО КАК ЦФО
		|ИЗ
		|	РегистрСведений.ЭтапыСогласованияЗаявок КАК ЭтапыСогласованияЗаявок
		|ГДЕ
		|	ЭтапыСогласованияЗаявок.Пользователь = &Пользователь
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭтапыСогласованияЗаявок.ТекущийЭтап,
		|	ЭтапыСогласованияЗаявок.ЦФО";
	
	Запрос.УстановитьПараметр("Пользователь", текПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ЦФО =  Справочники.ЦФО.ПустаяСсылка();

	ТекущиеЭтапы = Новый СписокЗначений;
	РД = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущиеЭтапы.Добавить(ВыборкаДетальныеЗаписи.ТекущийЭтап);
		Если ВыборкаДетальныеЗаписи.МогутВидетьВсеЗаявки Тогда 
		РД =  РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		КонецЕсли;
		ЦФО =  ВыборкаДетальныеЗаписи.ЦФО ;

	КонецЦикла;
	//ХранилищеСистемныхНастроек.Удалить("документ.ЗаявкаНаРасходованиеСредств.Форма.ФормаСпискаУправляемая.Список" + "/ТекущиеПользовательскиеНастройки", "", текПользователь);
	Если ТекущиеЭтапы.Количество()>0  Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЦФО",  Справочники.ЦФО.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.Равно,,Ложь,РД);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапСогласования",  Перечисления.ЭтапыСогласованияЗаявки.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.Равно,,Ложь,РД);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ответственный",  Справочники.Пользователи.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.Равно,,Ложь,РД);
		Если ЗначениеЗаполнено(ЦФО) Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЦФО",  ЦФО, ВидСравненияКомпоновкиДанных.Равно,,Истина,РД);
		Иначе 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапСогласования",  ТекущиеЭтапы, ВидСравненияКомпоновкиДанных.ВСписке,,Истина,РД);
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ответственный",  текПользователь, ВидСравненияКомпоновкиДанных.ВСписке,,Истина,РД);
	КонецЕсли;


	
КонецПроцедуры








