#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Определяет код показателя. Нумерация основана на Приложении 1 ПБУ 18.
//
// Параметры:
//  Показатель      - ПеречисленияСсылка.ПоказателиОтложенногоНалога
//  КодыПоказателей - Соответствие - при вызове функции в цикле можно организовать кеш;
//                    Переменную кеша не следует инициализировать до вызова функции (должна иметь значение Неопределено)
// 
// Возвращаемое значение:
//  Строка - код показателя
//
Функция Код(Показатель, КодыПоказателей = Неопределено) Экспорт
	
	Если КодыПоказателей = Неопределено Тогда
		КодыПоказателей = КодыПоказателей();
	КонецЕсли;
	
	Код = КодыПоказателей[Показатель];
	
	Если Код = Неопределено Тогда
		// Показатели без кода используются для сохранения информации, позволяющей найти ошибки в сложных случаях.
		// Они не являются частью регистров бухгалтерского учета.
		Возврат НСтр("");
	Иначе
		Возврат Код;
	КонецЕсли;
	
КонецФункции

// Содержит коды показателей. Нумерация основана на Приложении 1 ПБУ 18.
//
// Возвращаемое значение:
//  Соответствие - коды показателей. Ключ - показатель, Значение - представление.
//
Функция КодыПоказателей() Экспорт
	
	КодыПоказателей = Новый Соответствие;
	
	КодыПоказателей.Вставить(
		ПрибыльДоНалогообложения,
		НСтр("ru = 'А'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалоговыйАктивНачалоПериода,
		НСтр("ru = 'Б'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенноеНалоговоеОбязательствоНачалоПериода,
		НСтр("ru = 'В'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалоговыйАктивКонецПериода,
		НСтр("ru = 'Г'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенноеНалоговоеОбязательствоКонецПериода,
		НСтр("ru = 'Д'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПостояннаяРазница,
		НСтр("ru = 'Е'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалогНачалоПериода,
		НСтр("ru = '1'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалогКонецПериода,
		НСтр("ru = '2'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалог,
		НСтр("ru = '3'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияВременныхРазниц,
		НСтр("ru = '3А'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияСтавкиТекущегоНалога,
		НСтр("ru = '3Б'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияСтавкиБудущегоНалога,
		НСтр("ru = '3В'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ТекущийНалог,
		НСтр("ru = '4'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		РасходПоНалогу,
		НСтр("ru = '5'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ДоходПоНалогу,
		НСтр("ru = '5'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		УсловныйРасход,
		НСтр("ru = '6'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		УсловныйДоход,
		НСтр("ru = '6'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПостоянныйНалоговыйРасход,
		НСтр("ru = '7'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПостоянныйНалоговыйДоход,
		НСтр("ru = '7'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЧистаяПрибыль,
		НСтр("ru = '8'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	Возврат КодыПоказателей;
	
КонецФункции

#КонецЕсли
