#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрыОтбораСписка") Тогда
		ПараметрыОтбораСписка = Параметры.ПараметрыОтбораСписка;
		
		Если ПараметрыОтбораСписка.Свойство("Организация") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЭтаФорма.Список, "Организация", ПараметрыОтбораСписка.Организация, ВидСравненияКомпоновкиДанных.Равно, , Истина, 
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли; 
		
		Если ПараметрыОтбораСписка.Свойство("ВидМестаВыплаты") Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЭтаФорма.Список, "ВидМестаВыплаты", ПараметрыОтбораСписка.ВидМестаВыплаты, ВидСравненияКомпоновкиДанных.Равно, , Истина, 
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
		
		Если ПараметрыОтбораСписка.Свойство("СпособРасчетов") Тогда
			СпособыРасчетовСФизическимиЛицами = Новый СписокЗначений;
			СпособыРасчетовСФизическимиЛицами.Добавить(ПараметрыОтбораСписка.СпособРасчетов);
			Если ЗначениеЗаполнено(ПараметрыОтбораСписка.СпособРасчетов) Тогда
				СпособыРасчетовСФизическимиЛицами.Добавить(Перечисления.СпособыРасчетовСФизическимиЛицами.ПустаяСсылка());
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ЭтаФорма.Список, "СпособРасчетов", СпособыРасчетовСФизическимиЛицами, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, 
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		КонецЕсли;
		
	КонецЕсли;
	
	ПомеченныеНаУдаление.СкрытьПомеченныеНаУдаление(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ПомеченныеНаУдалениеКлиент.ПриИзмененииСписка(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки, ИспользуютсяСтандартныеНастройки)
	
	ПомеченныеНаУдаление.УдалитьОтборПометкаУдаления(Настройки);
	
КонецПроцедуры

#КонецОбласти
