// До версии 3.0.75 в перечислении был элемент БалансовыйМетод.
// В версии 3.0.75 он переименован в БалансовыйМетодПостоянныеРазницы.
// Таким образом, внутренний идентификатор элемента БалансовыйМетод версии 3.0.74
// совпадает с внутренним идентификатором элемента БалансовыйМетодПостоянныеРазницы в версии 3.0.75.
// Это нужно, чтобы упростить (исключить) обработку обновления:
// то, что пользователи называли "балансовым методом" до версии 3.0.75,
// теперь называется "балансовым методом с постоянными и временными разницами".

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет, что переданный вариант учета соответствует одной из разновидностей балансового метода.
//
// Параметры:
//  ВариантУчета - ПеречислениеСсылка.ВариантыУчетаОтложенногоНалога
// 
// Возвращаемое значение:
//  Булево - Истина, если соответствует.
//
Функция ЭтоБалансовыйМетод(ВариантУчета) Экспорт
	
	Возврат ВариантУчета = БалансовыйМетод Или ВариантУчета = БалансовыйМетодПостоянныеРазницы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
