#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ВерсияИзменений(ТипЗаявки) Экспорт
	
	ВерсияИзменений = 0;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВерсииЗаявокКабинетСотрудника.ВерсияИзменений КАК Версия
	|ИЗ
	|	РегистрСведений.ВерсииЗаявокКабинетСотрудника КАК ВерсииЗаявокКабинетСотрудника
	|ГДЕ
	|	ВерсииЗаявокКабинетСотрудника.ТипЗаявки = &ТипЗаявки");
	Запрос.УстановитьПараметр("ТипЗаявки", ТипЗаявки);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ВерсияИзменений = Выборка.Версия;
	КонецЕсли;
	
	Возврат ВерсияИзменений;
	
КонецФункции

Процедура ЗаписатьВерсию(ТипЗаявки, Версия) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ВерсииЗаявокКабинетСотрудника.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ТипЗаявки = ТипЗаявки;
	МенеджерЗаписи.ВерсияИзменений = Версия;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
