
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбработатьПереданныеПараметры();
	ИнтеграцияИСПереопределяемый.ЗаполнитьПараметрыУказанияСерий(ПараметрыУказанияСерий, Метаданные.ОбщиеФормы.УточнениеСоставаУпаковкиИС, ЭтотОбъект);
	ВывестиПоясняющийТекст();
	
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(ЭтотОбъект,   "ДанныеДляУточненияХарактеристика", "Элементы.ДанныеДляУточнения.ТекущиеДанные.Номенклатура");
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСНоменклатурой(ЭтотОбъект,   "ДанныеДляУточненияСерия", "Элементы.ДанныеДляУточнения.ТекущиеДанные.Номенклатура");
	СобытияФормИСПереопределяемый.УстановитьСвязиПараметровВыбораСХарактеристикой(ЭтотОбъект, "ДанныеДляУточненияСерия", "Элементы.ДанныеДляУточнения.ТекущиеДанные.Характеристика");
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьТекущие(Команда)
	
	Если Элементы.ДанныеДокумента.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбратьТекущиеНаСервере(Элементы.ДанныеДокумента.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	ЗакрытьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДанныеДляУточненияПриАктивизацииСтроки(Элемент)
	
	Если Не Элементы.ДанныеДокумента.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.ДанныеДляУточнения.ВыделенныеСтроки;
	Отбор = Новый Структура;
	ДопустимОбщийВыбор = Истина;
	Для Счетчик=1 По ВыделенныеСтроки.Количество() Цикл
		Строка = ДанныеДляУточнения.НайтиПоИдентификатору(ВыделенныеСтроки[Счетчик-1]);
		ДопустимОбщийВыбор = ДопустимОбщийВыбор И ПроверитьРеквизитВыделенныхСтрок(Строка, Отбор, "Номенклатура");
		ДопустимОбщийВыбор = ДопустимОбщийВыбор И ПроверитьРеквизитВыделенныхСтрок(Строка, Отбор, "Характеристика");
		ДопустимОбщийВыбор = ДопустимОбщийВыбор И ПроверитьРеквизитВыделенныхСтрок(Строка, Отбор, "Серия");
		ДопустимОбщийВыбор = ДопустимОбщийВыбор И ПроверитьРеквизитВыделенныхСтрок(Строка, Отбор, "ИдентификаторПроисхожденияВЕТИС");
		ДопустимОбщийВыбор = ДопустимОбщийВыбор И ПроверитьРеквизитВыделенныхСтрок(Строка, Отбор, "СрокГодности");
	КонецЦикла;
	
	Если Не ДопустимОбщийВыбор Тогда
		Отбор = Новый Структура("Выбрать", Неопределено);
	КонецЕсли;
		
	Если Отбор.Количество() Тогда
		Элементы.ДанныеДокумента.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	Иначе
		Элементы.ДанныеДокумента.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоясняющийТекстОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтеграцияИСКлиент.СкопироватьШтрихКодВБуферОбмена(Элементы.БуферОбмена, КодМаркировки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляУточненияНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеДляУточнения.ТекущиеДанные;
	ТекущиеДанныеСтруктурой = Новый Структура("Номенклатура,Характеристика,Серия,ХарактеристикиИспользуются,
	|   СтатусУказанияСерий,ТипНоменклатуры,Склад");
	ЗаполнитьЗначенияСвойств(ТекущиеДанныеСтруктурой, ТекущиеДанные);
	ТекущиеДанныеСтруктурой.Склад = Склад;
	СобытияФормИСМПКлиентПереопределяемый.ПриИзмененииНоменклатуры(
		ЭтотОбъект, ТекущиеДанныеСтруктурой, Неопределено, ПараметрыУказанияСерий);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ТекущиеДанныеСтруктурой);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляУточненияНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеСтроки = Элементы.ДанныеДляУточнения.ТекущиеДанные;
	
	ВидыПродукции = ПараметрыСканирования.ДопустимыеВидыПродукции;
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоШтрихкодВводаОстатков(КодМаркировки) Тогда
		ВидыПродукцииПоКодуМаркировкиОстатков(ВидыПродукции, КодМаркировки, ПараметрыСканирования.Организация);
	КонецЕсли;
	
	СобытияФормИСМПКлиентПереопределяемый.ПриНачалеВыбораНоменклатуры(
		Элемент, ДанныеСтроки, СтандартнаяОбработка, ВидыПродукции);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтотОбъект,
		"ДанныеДляУточненияХарактеристика", "ДанныеДляУточнения.ХарактеристикиИспользуются");
	СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтотОбъект,
		"ДанныеДляУточненияСерия", "ДанныеДляУточнения.СтатусУказанияСерий", "ДанныеДляУточнения.ТипНоменклатуры");
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДанныеДляУточненияНоменклатура.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Элементы.ДанныеДляУточненияНоменклатура.ПутьКДанным);
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ДанныеДляУточнения.ПредставлениеНоменклатуры"));
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	АдресДереваУпаковок    = Параметры.АдресДереваУпаковок;
	КодМаркировки          = Параметры.КодМаркировки;
	ПараметрыСканирования  = ОбщегоНазначения.СкопироватьРекурсивно(Параметры.ПараметрыСканирования);
	ПараметрыУказанияСерий = ПараметрыСканирования.ПараметрыУказанияСерий;
	Склад                  = ПараметрыСканирования.Склад;
	ДеревоУпаковок = ПолучитьИзВременногоХранилища(АдресДереваУпаковок);
	Упаковка = НайтиСтрокуДереваПоКодуМаркировки(ДеревоУпаковок, КодМаркировки);
	ЗаполнитьТребующиеУточненияДанныеУпаковки(Упаковка);
	ИнтеграцияИСПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(ЭтотОбъект, ДанныеДляУточнения);
	
	ОбработатьРежимВыбораИзДокумента();
	
	Если Не (ПараметрыСканирования.Свойство("ЗаполнятьДанныеВЕТИС")
		И ПараметрыСканирования.ЗаполнятьДанныеВЕТИС) Тогда
		
		Элементы.ДанныеДляУточненияИдентификаторПроисхожденияВЕТИС.Видимость = Ложь;
		Элементы.ДанныеДляУточненияСрокГодности.Видимость = Ложь;;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиПоясняющийТекст()
	
	Элементы.ПоясняющийТекст.Высота = 2;
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Обработка кода упаковки:'"),, ЦветаСтиля.ПоясняющийТекст));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(КодМаркировки, Новый Шрифт(,,,,Истина), ЦветаСтиля.ЦветГиперссылкиГосИС,, "СкопироватьКодМаркировкиВБуферОбмена"));
	МассивСтрок.Добавить(". ");
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Требуется уточнить коды маркировки.'"),, ЦветаСтиля.ПоясняющийТекст));
	
	ПоясняющийТекст = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРежимВыбораИзДокумента()
	
	ПредставлениеВыбираемыхДанных = Новый Массив;
	Колонки = Новый Массив;
	
	Если Параметры.ДанныеДокумента.Количество() Тогда
		Элемент = Параметры.ДанныеДокумента[0];
		// Настроим колонки таблицы выбора
		Для Каждого Колонка Из ДанныеДокумента.Выгрузить().Колонки Цикл
			Если Элементы.Найти("ДанныеДокумента"+Колонка.Имя)=Неопределено Тогда
			ИначеЕсли Не Элемент.Свойство(Колонка.Имя) Тогда
				Элементы["ДанныеДокумента"+Колонка.Имя].Видимость = Ложь;
			Иначе
				ПредставлениеВыбираемыхДанных.Добавить(Элементы["ДанныеДокумента"+Колонка.Имя].Заголовок);
				Колонки.Добавить(Колонка.Имя);
			КонецЕсли;
		КонецЦикла;
		
		Элементы.ДанныеДокументаВыбрать.Заголовок = СтрСоединить(ПредставлениеВыбираемыхДанных, ", ");
		
		// Загрузим данные документа для выбора
		Для Каждого ВариантВыбора Из Параметры.ДанныеДокумента Цикл
			НоваяСтрока = ДанныеДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВариантВыбора);
		КонецЦикла;
		
		ТаблицаДанныеДокумента = ДанныеДокумента.Выгрузить();
		ТаблицаДанныеДокумента.Свернуть("Номенклатура,Характеристика,Серия,ИдентификаторПроисхожденияВЕТИС,СрокГодности","Количество");
		ДанныеДокумента.Загрузить(ТаблицаДанныеДокумента);
		Для Каждого СтрокаДанныеДокумента Из ДанныеДокумента Цикл
			ЭтоПустаяСтрока = Истина;
			Для Каждого ВидимаяКолонка Из Колонки Цикл
				ЭтоПустаяСтрока = ЭтоПустаяСтрока И Не ЗначениеЗаполнено(СтрокаДанныеДокумента[ВидимаяКолонка]);
			КонецЦикла;
			Если ЭтоПустаяСтрока Тогда
				СтрокаДанныеДокумента.ПредставлениеПустого = НСтр("ru = '<Без уточнения>'")
			КонецЕсли;
		КонецЦикла;
	Иначе
		Элементы.ДанныеДокумента.Видимость = Ложь;
		Элементы.КоманднаяПанельУточнитьПоДаннымДокумента.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТребующиеУточненияДанныеУпаковки(СтрокаДерева)
	
	Если СтрокаДерева.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар Тогда
		
		ТребуетсяУточнение = Не ЗначениеЗаполнено(СтрокаДерева.Номенклатура);
		
		Если Не ТребуетсяУточнение И Не ЗначениеЗаполнено(СтрокаДерева.Серия) И ПараметрыУказанияСерий <> Неопределено Тогда
			ДанныеДляРасчетаСерии = Новый Структура("Склад, Номенклатура, Характеристика", Склад, СтрокаДерева.Номенклатура, СтрокаДерева.Характеристика);
			ШтрихкодированиеИСПереопределяемый.ПриОпределенииНеобходимостиВыбораСерии(
				ДанныеДляРасчетаСерии, ПараметрыУказанияСерий, ТребуетсяУточнение, ПараметрыСканирования.КэшированныеЗначения);
		КонецЕсли;
		
		Если Не ТребуетсяУточнение И ПараметрыСканирования.Свойство("ЗаполнятьДанныеВЕТИС") И ПараметрыСканирования.ЗаполнятьДанныеВЕТИС
			И (Не ЗначениеЗаполнено(СтрокаДерева.ИдентификаторПроисхожденияВЕТИС)
				Или Не ЗначениеЗаполнено(СтрокаДерева.ГоденДо)) Тогда
			ТребуетсяУточнение = Истина;
		КонецЕсли;
		
		Если ТребуетсяУточнение Тогда
			НоваяСтрока = ДанныеДляУточнения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
			Если ПараметрыСканирования.Свойство("ЗаполнятьДанныеВЕТИС") И ПараметрыСканирования.ЗаполнятьДанныеВЕТИС Тогда
				НоваяСтрока.СрокГодности = СтрокаДерева.ГоденДо;
			КонецЕсли;
			НоваяСтрока.НомерСтроки = ДанныеДляУточнения.Количество();
		КонецЕсли;
		
	Иначе
		
		Для Каждого ВложеннаяСтрока Из СтрокаДерева.Строки Цикл
			ЗаполнитьТребующиеУточненияДанныеУпаковки(ВложеннаяСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция ПроверитьРеквизитВыделенныхСтрок(Строка, Отбор, ИмяРеквизита, ДополнитьОтбор = Истина)
	Если ЗначениеЗаполнено(Строка[ИмяРеквизита]) Тогда
		Если Не Отбор.Свойство(ИмяРеквизита) Тогда
			Если ДополнитьОтбор Тогда
				Отбор.Вставить(ИмяРеквизита, Строка[ИмяРеквизита]);
			КонецЕсли;
		ИначеЕсли Строка[ИмяРеквизита] <> Отбор[ИмяРеквизита] Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаСервере
Функция НайтиСтрокуДереваПоКодуМаркировки(ДеревоУпаковок, КодМаркировки)
	
	Возврат ДеревоУпаковок.Строки.Найти(КодМаркировки, "ШтрихКод", Истина);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ВидыПродукцииПоКодуМаркировкиОстатков(ВидыПродукции, КодМаркировки, Организация)
	
	Если ВидыПродукции.Количество() = 1
		Или Не ЗначениеЗаполнено(КодМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ГосИС.ИСМП") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ШтрихкодированиеИСМП");
		ВидыПродукцииКодаМаркировки = Модуль.ВидыПродукцииПоКодуМаркировкиОстатков(КодМаркировки, Организация);
		Если ВидыПродукцииКодаМаркировки <> Неопределено Тогда
			ВидыПродукции = ИнтеграцияИС.ПересечениеМассивов(ВидыПродукции, ВидыПродукцииКодаМаркировки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьТекущиеНаСервере(СтрокаДанныеДокумента)
	
	ТекущиеДанные = ДанныеДокумента.НайтиПоИдентификатору(СтрокаДанныеДокумента);
	КэшированныеЗначения = Неопределено;
	Для Каждого Идентификатор Из Элементы.ДанныеДляУточнения.ВыделенныеСтроки Цикл
		СтрокаТаблицы = ДанныеДляУточнения.НайтиПоИдентификатору(Идентификатор);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ТекущиеДанные);
		СобытияФормИСМППереопределяемый.ПриИзмененииНоменклатуры(ЭтотОбъект, СтрокаТаблицы, КэшированныеЗначения, ПараметрыУказанияСерий);
	КонецЦикла;
	
КонецПроцедуры

#Область ЗавершениеОбработки

&НаКлиенте
Процедура ЗакрытьФорму()
	
	Если Не ПроверитьЗаполнениеНаКлиенте() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбновитьИзмененныеОбъекты() Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(КодМаркировки);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеНаКлиенте()
	
	Результат = Истина;
	Для Каждого СтрокаТаблицы Из ДанныеДляУточнения Цикл
		Индекс = ДанныеДляУточнения.Индекс(СтрокаТаблицы);
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура)
			И Не ПараметрыСканирования.РазрешенаОбработкаКодовСПустойНоменклатурой Тогда
			Результат = Ложь;
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Требуется уточнение номенклатуры кода маркировки'"),,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДанныеДляУточнения", Индекс, "Номенклатура"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Серия)
			И ИнтеграцияИСКлиентСервер.НеобходимоУказатьСерию(СтрокаТаблицы.СтатусУказанияСерий) Тогда
			Результат = Ложь;
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Требуется уточнение серии номенклатуры'"),,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДанныеДляУточнения", Индекс, "Серия"));
		КонецЕсли;
		Если ПараметрыСканирования.Свойство("ЗаполнятьДанныеВЕТИС") И ПараметрыСканирования.ЗаполнятьДанныеВЕТИС Тогда
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторПроисхожденияВЕТИС) Тогда
				Результат = Ложь;
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("ru = 'Требуется уточнение идентификатора происхождения ВетИС'"),,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДанныеДляУточнения", Индекс, "ИдентификаторПроисхожденияВЕТИС"));
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.СрокГодности) Тогда
				Результат = Ложь;
				ОбщегоНазначенияКлиент.СообщитьПользователю(
					НСтр("ru = 'Требуется уточнение срока годности'"),,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДанныеДляУточнения", Индекс, "СрокГодности"));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбновитьИзмененныеОбъекты()
	
	Отказ = ОбновитьЗаполненныеШтрихкодыУпаковок();
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбновитьДанныеУпаковокПоАдресуДереваУпаковок();
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ОбновитьЗаполненныеШтрихкодыУпаковок()
	
	ДеревоУпаковок = ПолучитьИзВременногоХранилища(АдресДереваУпаковок);
	Для Каждого СтрокаРезультат Из ДанныеДляУточнения Цикл
		СтрокаДерева = НайтиСтрокуДереваПоКодуМаркировки(ДеревоУпаковок, СтрокаРезультат.Штрихкод);
		Если (СтрокаДерева.Номенклатура <> СтрокаРезультат.Номенклатура
				Или СтрокаДерева.Характеристика <> СтрокаРезультат.Характеристика
				Или СтрокаДерева.Серия <> СтрокаРезультат.Серия)
			И (ЗначениеЗаполнено(СтрокаДерева.ШтрихкодУпаковки)
				Или ПараметрыСканирования.СоздаватьШтрихкодУпаковки) Тогда
			
			ИсходныеРеквизиты = Новый Структура("Номенклатура,Характеристика,Серия");
			ЗаполнитьЗначенияСвойств(ИсходныеРеквизиты, СтрокаДерева);
			ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаРезультат);
			
			НачатьТранзакцию();
			Попытка
				ШтрихкодированиеИС.ОбновитьСоздатьШтрихкодУпаковкиДанныхШтрихкода(СтрокаДерева, Неопределено, ПараметрыСканирования);
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ИмяСобытияЖурналРегистрации = НСтр("ru = 'ГосИС: Запись штрихкода упаковки'", ОбщегоНазначения.КодОсновногоЯзыка());
				ЗаписьЖурналаРегистрации(ИмяСобытияЖурналРегистрации, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
				Возврат Истина;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеУпаковокПоАдресуДереваУпаковок()
	
	ДеревоУпаковок = ПолучитьИзВременногоХранилища(АдресДереваУпаковок);
	Для Каждого СтрокаРезультат Из ДанныеДляУточнения Цикл
		СтрокаДерева = НайтиСтрокуДереваПоКодуМаркировки(ДеревоУпаковок, СтрокаРезультат.Штрихкод);
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаРезультат);
		Если ПараметрыСканирования.Свойство("ЗаполнятьДанныеВЕТИС") И ПараметрыСканирования.ЗаполнятьДанныеВЕТИС Тогда
			СтрокаДерева.ГоденДо = СтрокаРезультат.СрокГодности;
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыСканирования.Свойство("ЗаполнятьДанныеВЕТИС") И ПараметрыСканирования.ЗаполнятьДанныеВЕТИС Тогда
		СтрокаДерева = НайтиСтрокуДереваПоКодуМаркировки(ДеревоУпаковок, КодМаркировки);
		ЗаполнитьДанныеВЕТИСВУпаковках(СтрокаДерева);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ДеревоУпаковок, АдресДереваУпаковок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеВЕТИСВУпаковках(СтрокаДерева)
	
	Для Каждого ВложеннаяСтрока Из СтрокаДерева.Строки Цикл
		ЗаполнитьДанныеВЕТИСВУпаковках(ВложеннаяСтрока);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаДерева.ИдентификаторПроисхожденияВЕТИС) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщиеДанные = Новый Структура("Заполнено,ИдентификаторПроисхожденияВЕТИС,ГоденДо");
	
	Для Каждого ВложеннаяСтрока Из СтрокаДерева.Строки Цикл
		Если Не ЗначениеЗаполнено(ВложеннаяСтрока.ИдентификаторПроисхожденияВЕТИС) Тогда
			ОбщиеДанные.Заполнено = Ложь;
		ИначеЕсли ОбщиеДанные.Заполнено = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ОбщиеДанные, ВложеннаяСтрока);
			ОбщиеДанные.Заполнено = Истина;
		Иначе
			ОбщиеДанные.Заполнено = ОбщиеДанные.Заполнено
				И ВложеннаяСтрока.ИдентификаторПроисхожденияВЕТИС = ОбщиеДанные.ИдентификаторПроисхожденияВЕТИС
				И ВложеннаяСтрока.ГоденДо = ОбщиеДанные.ГоденДо;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщиеДанные.Заполнено = Истина Тогда
		СтрокаДерева.ИдентификаторПроисхожденияВЕТИС = ОбщиеДанные.ИдентификаторПроисхожденияВЕТИС;
		СтрокаДерева.ГоденДо = ОбщиеДанные.ГоденДо;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
