
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Функция возвращает Истину, если необходимо заполнить измерение ДокументаРасчетов 
// в регистре РеализованныеТоварыКомитентов 
// 
// Параметры
// Период - дата, на которую нужно проверить необходимость заполнения измерения
//
// Возвращаемые параметры
// Булево - Истина, если необходимо заполнить измерение ДокументРасчетов 
// в регистре РеализованныеТоварыКомитентов 

Функция ЗаполнятьДокументРасчетов(Период) Экспорт

	Возврат Период >= '20200101';

КонецФункции

#КонецОбласти

#КонецЕсли
