////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Вариант = 1;
	Параметры.Свойство("Вариант", Вариант);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Если Вариант = 1 Тогда
		Заголовок = "Печать по шаблонам";
		ДанныеФайла = ОбработкаОбъект.ПолучитьМакет("ПечатьПоШаблонам");
	ИначеЕсли Вариант = 2 Тогда
		Заголовок = "Планировки";
		ДанныеФайла = ОбработкаОбъект.ПолучитьМакет("Планировки");
	Иначе
		ДанныеФайла = Неопределено;		
	КонецЕсли;
	
	Если ДанныеФайла <> Неопределено Тогда
		HTMLТекст = ДанныеФайла.ПолучитьТекст();
	КонецЕсли;
	
КонецПроцедуры

