
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Металлолом Расход
	Движения.Металлолом.Записывать = Истина;
	Для Каждого ТекСтрокаМеталлолом Из Металлолом Цикл
		Движение = Движения.Металлолом.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаМеталлолом.Номенклатура;
		Движение.Количество = ТекСтрокаМеталлолом.Количество;
		Движение.Киллограммы = ТекСтрокаМеталлолом.Киллограммы;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Если ТекСтрокаТовары.Событие = Перечисления.СобытиеПеремещения.Металлолом Тогда 	
				НоваяСтрока = Металлолом.Добавить();
				НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
				НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
