#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СостояниеПодключенияКСервису() Экспорт
	
	Настройки = РегистрыСведений.СостояниеОтложенногоПодключенияКСервису.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.СостояниеОтложенногоПодключенияКСервису);
							
	Возврат СтруктураНастроек;

КонецФункции

#КонецОбласти

#КонецЕсли
