
&НаКлиенте
Процедура ВызовВнешнейОбработки(ЭтоНовыйЭлемент, Родитель = Неопределено)
	
	#Если Не ТолстыйКлиентОбычноеПриложение Тогда
		Если Не мИспользоватьМенеджерЛицензий Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Нарушение прав доступа!'"));
			Возврат;
		ИначеЕсли Не АР_ОбщиеПроцедурыКлиент.ДоступнаРаботаMSOffice(1) Тогда
			Возврат;
		КонецЕсли;
	#КонецЕсли
	#Если ВебКлиент	Тогда
	ПоказатьПредупреждение(, НСтр("ru = 'Редактирование шаблонов не возможно из веб-клиента.'"));
	Возврат;
	#КонецЕсли

	Если ЭтоНовыйЭлемент Тогда
		ОткрытьФорму("Обработка.АР_ЗаполнениеПолейШаблона.Форма.ФормаУправляемая", Новый Структура("Родитель", Родитель), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ОткрытьФорму("Обработка.АР_ЗаполнениеПолейШаблона.Форма.ФормаУправляемая", Новый Структура("Шаблон", Элементы.Список.ТекущаяСтрока), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЭтоГруппа = АР_ОбщиеПроцедуры.ЗначениеРеквизитаОбъекта(ВыбраннаяСтрока, "ЭтоГруппа");
	Если НЕ ЭтоГруппа Тогда
		СтандартнаяОбработка = Ложь;
		ВызовВнешнейОбработки(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Группа Тогда
		Отказ = Истина;
		ВызовВнешнейОбработки(Истина, Родитель);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Сообщить("Данный справочник нельзя открыть в обычном приложении", СтатусСообщения.Важное);		
		Отказ = Истина;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ШаблонВорд" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;	
	
КонецПроцедуры
