#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользоватьПередКомпоновкойМакета", Истина);
	Результат.Вставить("ИспользоватьПриВыводеЗаголовка",     Истина);
	Результат.Вставить("ИспользоватьДанныеРасшифровки",      Истина);
	Результат.Вставить("ИспользоватьПослеВыводаРезультата",  Истина);
							
	Возврат Результат;
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
//
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	БухгалтерскиеОтчетыВызовСервера.УстановитьПараметрОрганизация(КомпоновщикНастроек, ПараметрыОтчета.ОрганизацияРасшифровки);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоГода",    ПараметрыОтчета.НачалоГода);
	
	// Схемы расшифровок содержат запасную строку с обозначением периода
	ПредставлениеПериода = ПараметрыОтчета.ПредставлениеПериода;
	СправкиРасчеты.ДополнитьПериодОтчетаПримечанием(ПредставлениеПериода, ПараметрыОтчета);
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПредставлениеПериода", ПредставлениеПериода);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(
		КомпоновщикНастроек,
		"Период",
		Новый Граница(КонецДня(ПараметрыОтчета.КонецПериода), 
		ВидГраницы.Включая));
		
	Если ПараметрыОтчета.ТолькоОшибки Тогда	
		БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "Контроль", , ВидСравненияКомпоновкиДанных.Заполнено);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт 
	
	Возврат ЗаголовокОтчета(ПараметрыОтчета, Истина);
	
КонецФункции	

Процедура ПриВыводеЗаголовка(ПараметрыОтчета, КомпоновщикНастроек, Результат) Экспорт 
	
	Макет = Отчеты.АнализСостоянияНалоговогоУчетаПоНалогуНаПрибыль.ПолучитьМакет("МакетЗаголовкаРасшифровки");
	
	ОбластьОтчета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьОтчета.Параметры.ТекстЗаголовка = ПолучитьТекстЗаголовка(ПараметрыОтчета);
	
	Результат.Вывести(ОбластьОтчета);
	
КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	Если СправкиРасчеты.ТребуетсяДополнитьПериодОтчетаПримечанием(ПараметрыОтчета) Тогда
		
		СправкиРасчеты.ДобавитьПримечание(Результат, ПараметрыОтчета.ИнформацияНалоговыйПериод);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьОтчет(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументСхемы = ПолучитьМакет(ПараметрыОтчета.ИмяСхемы);
	
	Расшифровка = ПараметрыОтчета.Расшифровка;
	
	КэшПараметровОтчета = ПараметрыОтчета.КэшПараметровОтчета;
	НомерТекущейСхемы = ПараметрыОтчета.НомерТекущейСхемы;
	
	Если НЕ КэшПараметровОтчета.Свойство("КэшМакетов") Тогда	
		КэшПараметровОтчета.Вставить("КэшМакетов"     , Новый Структура);
		КэшПараметровОтчета.Вставить("ИсторияОткрытий", Новый СписокЗначений);		
	КонецЕсли;
	
	Если ТипЗнч(Расшифровка) = Тип("Соответствие") Тогда
		ПараметрыОтчета.ОрганизацияРасшифровки = Расшифровка.Получить("Организация");
		
		СтруктураВП = Новый Структура;
		СтруктураВП.Вставить("НомерТекущейСхемы", НомерТекущейСхемы);
		СтруктураВП = ПолучитьСтруктуруВременныхПараметров(ПараметрыОтчета, СтруктураВП, НомерТекущейСхемы);		
	Иначе		
		СтруктураВП = ПолучитьСтруктуруВременныхПараметров(ПараметрыОтчета, , НомерТекущейСхемы);		
	КонецЕсли;
	
	СтруктураВП.Вставить("НомерТекущейСхемы",	НомерТекущейСхемы);
	КэшПараметровОтчета.Вставить("СтруктураВП",	СтруктураВП);
	
	// установим формируемую схему
	Если НомерТекущейСхемы = 0 ИЛИ НомерТекущейСхемы = 20 Тогда		
		СформироватьРасчетНалогаНаПрибыль(ПараметрыОтчета, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 1 ИЛИ НомерТекущейСхемы = 21 Тогда		
		СформироватьДоходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		                                             
	ИначеЕсли НомерТекущейСхемы = 2 ИЛИ НомерТекущейСхемы = 22 Тогда		
		СформироватьРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 3 ИЛИ НомерТекущейСхемы = 23 Тогда		
		СформироватьРасходыПоТоварам(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 4 ИЛИ НомерТекущейСхемы = 24 Тогда			
		СформироватьРасходыПроизводства(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 5 ИЛИ НомерТекущейСхемы = 25 Тогда		
		СформироватьТранспортныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 6 ИЛИ НомерТекущейСхемы = 26 Тогда		
		СформироватьКосвенныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 7 ИЛИ НомерТекущейСхемы = 27 Тогда		
		СформироватьПрочиеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 8 ИЛИ НомерТекущейСхемы = 28 Тогда		
		СформироватьРаспределяемыеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 9 ИЛИ НомерТекущейСхемы = 29 Тогда		
		СформироватьСтоимостьЗапасов(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);		
	ИначеЕсли НомерТекущейСхемы = 10 ИЛИ НомерТекущейСхемы = 30 Тогда		
		СформироватьОбычныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПараметрыОтчета.ИнформацияНалоговыйПериод) Тогда
		ЭлементНазваниеОрганизации = ДокументСхемы.ЭлементыГрафическойСхемы.Найти("НазваниеОрганизации");
		Если ЭлементНазваниеОрганизации <> Неопределено Тогда
			ЭлементНазваниеОрганизации.Подсказка = ПараметрыОтчета.ИнформацияНалоговыйПериод;
		КонецЕсли;
	КонецЕсли;
	
	КэшПараметровОтчета.ИсторияОткрытий.Добавить(НомерТекущейСхемы);
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("КэшПараметровОтчета",   КэшПараметровОтчета);
	РезультатВыполнения.Вставить("РезультатСхемы",        ДокументСхемы);
	РезультатВыполнения.Вставить("Результат",             ДокументРезультат);
	РезультатВыполнения.Вставить("ИдентификаторСтраницы", НомерТекущейСхемы);
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

Процедура СформироватьРасшифровку(Знач ПараметрыОтчета, АдресХранилища) Экспорт
	
	КэшПараметровОтчета = ПараметрыОтчета.КэшПараметровОтчета;
	
	ПараметрыОтчета.ОрганизацияРасшифровки = КэшПараметровОтчета.ТекущаяРасшифровка["Организация"];
	
	ИдентификаторСтраницы = КэшПараметровОтчета.ТекущаяРасшифровка["НомерТекущейСхемы"];
	
	СхемаКомпоновкиДанных = ПолучитьМакет(ИдентификаторСтраницы);
	Если ЭтоРасшифровкаСМакетами(ИдентификаторСтраницы) Тогда
		ЗапретитьРасчетНедоступныхПолей(СхемаКомпоновкиДанных, ПараметрыОтчета);
	Иначе
		ВыполнитьОбщиеНастройкиСхемыКомпоновкиДанныхРасшифровки(СхемаКомпоновкиДанных);
	КонецЕсли;
	
	НеРазворачиватьПоРегистраторам = КэшПараметровОтчета.ТекущаяРасшифровка["НеРазворачиватьПоРегистраторам"];
	Если НеРазворачиватьПоРегистраторам = Истина Тогда
		ВариантыНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("БезРегистратора");
	Иначе
		ВариантыНастроек = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Основной");
	КонецЕсли;
	
	Если ВариантыНастроек = Неопределено Тогда
		ВариантНастройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Иначе
		ВариантНастройки = ВариантыНастроек.Настройки;
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(ВариантНастройки);
	
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал");
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВыводитьПодвал = Ложь;
	
	УстановитьПараметрыРасшифровкиСчетаВыручкиСебестоимости(
		КомпоновщикНастроек.Настройки.ПараметрыДанных,
		СхемаКомпоновкиДанных,
		ПараметрыОтчета.КонецПериода,
		ПараметрыОтчета.ОрганизацияРасшифровки);
		
	Если Не ЭтоРасшифровкаСМакетами(ИдентификаторСтраницы) Тогда
		НастроитьИспользованиеКолонок(КомпоновщикНастроек, ПараметрыОтчета);
	КонецЕсли;
	
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных",     СхемаКомпоновкиДанных);
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных", КомпоновщикНастроек.ПолучитьНастройки());
	
	БухгалтерскиеОтчеты.НастроитьОбъединениеЗаголовкаГруппировокТаблицы(
		ПараметрыОтчета.НастройкиКомпоновкиДанных,
		СтрШаблон(НСтр("ru = 'Обороты за %1'"), ПараметрыОтчета.ПредставлениеПериода),
		"ОбъединенныйЗаголовок");
	
	ВременныйАдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	БухгалтерскиеОтчетыВызовСервера.СформироватьОтчет(ПараметрыОтчета, ВременныйАдресХранилища);
	РезультатВыполнения = ПолучитьИзВременногоХранилища(ВременныйАдресХранилища);
	ДокументРезультат   = РезультатВыполнения.Результат;
	
	ДанныеРасшифровки   = "";
	Если РезультатВыполнения.Свойство("ДанныеРасшифровки") Тогда
		ДанныеРасшифровки = РезультатВыполнения.ДанныеРасшифровки;
	КонецЕсли;
	
	РезультатВыполнения.Вставить("ИдентификаторСтраницы", ИдентификаторСтраницы);
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьСтруктуруВременныхПараметров(ПараметрыОтчета, СтруктураВП = Неопределено, НомерТекущейСхемы)
	
	Если СтруктураВП = Неопределено Тогда
		СтруктураВП = Новый Структура;
		
		Если НомерТекущейСхемы > 20 И ЗначениеЗаполнено(ПараметрыОтчета.Организация.ГоловнаяОрганизация) Тогда
			ПараметрыОтчета.ОрганизацияРасшифровки = ПараметрыОтчета.Организация.ГоловнаяОрганизация;	
		Иначе
			ПараметрыОтчета.ОрганизацияРасшифровки = ПараметрыОтчета.Организация;
		КонецЕсли;	
	КонецЕсли;
	
	СтруктураВП.Вставить("ГоловнаяОрганизация", ПараметрыОтчета.ОрганизацияРасшифровки.ГоловнаяОрганизация);
	СтруктураВП.Вставить("ПоказыватьЛегенду",   Ложь);	
	
	Возврат СтруктураВП;  
	
КонецФункции

Процедура СформироватьРасчетНалогаНаПрибыль(ПараметрыОтчета, Документ, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	ВсеПоляСтраницы = Новый Массив;
	ВсеПоляСтраницы.Добавить("Доходы");
	ВсеПоляСтраницы.Добавить("Расходы");
	ВсеПоляСтраницы.Добавить("База");
	ВсеПоляСтраницы.Добавить("Налог");
	
	Документ          = ГрафическаяСхемаОтчета("РасчетНалогаНаПрибыль", ВсеПоляСтраницы, ПараметрыОтчета);
	ЭлементыСхемы 	  = Документ.ЭлементыГрафическойСхемы;
	РасшифровкаМакета = Новый Структура;
	
	НалогНаПрибыль = ПланыСчетов.Хозрасчетный.РасчетНалогаНаПрибыль;
	
	СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Счет99_2Хозрасчетный = ПланыСчетов.Хозрасчетный.ПрибылиИУбытки_НалогНаПрибыль;
		
	ОрганизацияГоловная = ?(ПараметрыОтчета.ВключатьОбособленныеПодразделения, СтруктураВП.ГоловнаяОрганизация,
		ПараметрыОтчета.ОрганизацияРасшифровки);
		
	Запрос = Новый Запрос;	// Запрос переиспользуется. Для одного из выполнений запроса ниже устанавливается МенеджерВременныхТаблиц
	Запрос.УстановитьПараметр("Счет99_2Хозрасчетный",	   Счет99_2Хозрасчетный);
	Запрос.УстановитьПараметр("ОрганизацияГоловная",  	   ОрганизацияГоловная);
	Запрос.УстановитьПараметр("НачалоПериода",     	       ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",     	       КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",         	   СписокОП);
	Запрос.УстановитьПараметр("НалогНаПрибыль",			   НалогНаПрибыль);
	
	// Доходы
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК ДоходыБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК ДоходыНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт КАК ДоходыПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт КАК ДоходыВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаНеЕНВД)), , Организация В (&Организация), НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация В (&Организация)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходыИРасходы)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	-ХозрасчетныйОбороты.СуммаОборотДт,
	|	-ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	-ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	-ХозрасчетныйОбороты.СуммаВРОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_Акцизы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_ЭкспортныеПошлины)), , Организация В (&Организация), НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	-ХозрасчетныйОбороты.СуммаОборотДт,
	|	-ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	-ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	-ХозрасчетныйОбороты.СуммаВРОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация В (&Организация)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов))
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке)),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.ДоходыБУ), 0) КАК ДоходыБУ,
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.ДоходыНУ), 0) КАК ДоходыНУ,
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.ДоходыПР), 0) КАК ДоходыПР,
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.ДоходыВР), 0) КАК ДоходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный";
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("Доходы");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Доходы = ПоказателиСтраницы(Запрос.Выполнить());
	
	// В бухгалтерском и налоговом учете возвраты прошлых лет отражаются существенно разными способами
	// (см. НалоговыйУчет.СкорректироватьПроводкиВозвратТоваровПрибылиУбыткиПрошлыхЛет).
	// Чтобы можно было убедиться в корректности учета, в отчете показываем эти суммы по одинаковым правилам (бухгалтерского учета).
	// Для этого суммы доходов и расходов НУ должны быть скорректированы на суммы убытков и прибыли, отраженных по возвратам прошлых лет.
	ВозвратыПрошлыхЛет = ПрибыльУбытокВозвратыПрошлыхЛет(
		ПараметрыОтчета.НачалоПериода,
		КонецДня(ПараметрыОтчета.КонецПериода),
		ОрганизацияГоловная,
		СписокОП);
		
	// Скорректируем сумму доходов на прибыли и убытки по возвратам прошлых лет так,
	// чтобы сумма доходов была рассчитана по правилам бухгалтерского учета.
	// В налоговом учете в составе доходов отражена прибыль по возвратам прошлых лет.
	// Поэтому прибыль нужно вычесть из суммы доходов.
	// В бухгалтерском учете доходы уменьшены на сумму выручки по возвращенным товарам,
	// которые в налоговом учете отражаются в составе убытка.
	// Поэтому сумму доходов налогового учета также уменьшим на эту величину - вычтем убыток.
	Доходы.ДоходыНУ = Доходы.ДоходыНУ - ВозвратыПрошлыхЛет.Прибыль - ВозвратыПрошлыхЛет.Убыток;
	
	УстановитьПоказатели(Документ, Доходы);
	
	РасшифровкаМакета.Вставить("РасшифровкаДоходы",  ПереходКСхеме(ПараметрыОтчета, 1, СтруктураВП, Истина));
		
	// Расходы
	МенеджерВременныхТаблицДолиЕНВД = Новый МенеджерВременныхТаблиц;
	Налоговыйучет.СоздатьДолиЕНВД(
		МенеджерВременныхТаблицДолиЕНВД,
		Запрос.Параметры.НачалоПериода,
		Запрос.Параметры.КонецПериода,
		Запрос.Параметры.Организация); 
		
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблицДолиЕНВД; // Очищается после выполнения запроса
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК РасходыБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт КАК РасходыНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт КАК РасходыПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт КАК РасходыВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД)), , Организация В (&Организация), НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи)), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация В (&Организация)
	|				И НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов))
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения),
	|			,
	|			) КАК ХозрасчетныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолиЕНВД КАК ДолиЕНВД
	|		ПО ХозрасчетныйОбороты.Период = ДолиЕНВД.МесяцЕНВД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов),
	|			Организация В (&Организация)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.РасходыБудущихПериодов).ВидРБП В (ЗНАЧЕНИЕ(Перечисление.ВидыРБП.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(Перечисление.ВидыРБП.УбыткиОтРеализацииАмортизируемогоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыРБП.УбыткиПрошлыхЛетОбслуживающихПроизводствИХозяйств)),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация В (&Организация)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов))
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке)),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.РасходыБУ), 0) КАК РасходыБУ,
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.РасходыНУ), 0) КАК РасходыНУ,
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.РасходыПР), 0) КАК РасходыПР,
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.РасходыВР), 0) КАК РасходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный";
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("Расходы");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат 		= Запрос.Выполнить();
	МенеджерВременныхТаблицДолиЕНВД.Закрыть();
	Запрос.МенеджерВременныхТаблиц = Неопределено;
	
	Расходы = ПоказателиСтраницы(Результат);
	
	// Скорректируем сумму расходов на прибыли и убытки по возвратам прошлых лет так,
	// чтобы сумма расходов была рассчитана по правилам бухгалтерского учета.
	// В налоговом учете в составе расходов отражен убыток по возвратам прошлых лет.
	// Поэтому убыток нужно вычесть из суммы расходов.
	// В бухгалтерском учете расходы уменьшены на сумму себестоимости возвращенных товаров,
	// которые в налоговом учете отражаются в составе прибыли.
	// Поэтому сумму расходов налогового учета также уменьшим на эту величину - вычтем прибыль.
	Расходы.РасходыНУ = Расходы.РасходыНУ - ВозвратыПрошлыхЛет.Прибыль - ВозвратыПрошлыхЛет.Убыток;
	
	УстановитьПоказатели(Документ, Расходы);
	
	РасшифровкаМакета.Вставить("РасшифровкаРасходы", ПереходКСхеме(ПараметрыОтчета, 2, СтруктураВП, Истина));
		
	// Прибыль
	
	НалоговаяБаза = Новый Структура;
	НалоговаяБаза.Вставить("БазаБУ", Доходы.ДоходыБУ - Расходы.РасходыБУ);
	НалоговаяБаза.Вставить("БазаНУ", Доходы.ДоходыНУ - Расходы.РасходыНУ);
	НалоговаяБаза.Вставить("БазаПР", Доходы.ДоходыПР - Расходы.РасходыПР);
	НалоговаяБаза.Вставить("БазаВР", 0);
	Если Доходы.Свойство("ДоходыВР") И Расходы.Свойство("РасходыВР") Тогда
		НалоговаяБаза.БазаВР = Доходы.ДоходыВР - Расходы.РасходыВР;
	КонецЕсли;
		
	
	УстановитьПоказатели(Документ, НалоговаяБаза);
	
	ЭлементыРасхождений = Новый Массив;
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("База", "БазаРасшифровка");
	ДополнитьЭлементыРасхождений(ЭлементыРасхождений, ЭлементыСхемы, НалоговаяБаза, ПроверяемыеБлоки, ПараметрыОтчета);
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПостоянноеНалоговоеОбязательство))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПостоянноеНалоговоеОбязательство))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НалогПР,
	|	0 КАК НалогВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (&НалогНаПРибыль), , Организация = &ОрганизацияГоловная, КорСчет В ИЕРАРХИИ (&Счет99_2Хозрасчетный), ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (&НалогНаПРибыль),
	|			,
	|			Организация = &ОрганизацияГоловная
	|				И НЕ КорСубконто1 = ЗНАЧЕНИЕ(Перечисление.ВидыАктивовИОбязательств.УбытокТекущегоПериода),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивы))
	|				ИЛИ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОтложенныеНалоговыеОбязательства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыАктивовИОбязательств)) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.НалогБУ), 0) КАК НалогБУ,
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.НалогПР), 0) КАК НалогПР,
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.НалогВР), 0) КАК НалогВР,
	|	ЕСТЬNULL(СУММА(ВТХозрасчетный.НалогБУ), 0) + ЕСТЬNULL(СУММА(ВТХозрасчетный.НалогПР), 0) + ЕСТЬNULL(СУММА(ВТХозрасчетный.НалогВР), 0) КАК НалогБУКор
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный";
	
	Результат = Запрос.Выполнить();
	Налог = ПоказателиСтраницы(Результат);
	
	СтавкаНалогаНаПрибыль = СтавкаНалога(ПараметрыОтчета.КонецПериода, ПараметрыОтчета.Организация);
	
	Если СтавкаНалогаНаПрибыль <> Неопределено Тогда
		Налог.Вставить("НалогНУ", НалоговаяБаза.БазаНУ * СтавкаНалогаНаПрибыль / 100);
	Иначе
		
		// Определить единую ставку корректно не получится, например, с учетом закрытых подразделений.
		// Поэтому для иллюстрации расчета выведем ставку обратным счетом - исходя из суммы налога
		СуммаНалога = РассчитаннаяСуммаНалога(
			ПараметрыОтчета.НачалоПериода,
			ПараметрыОтчета.КонецПериода,
			ПараметрыОтчета.Организация);
			
		Налог.Вставить("НалогНУ", СуммаНалога);
		Если НалоговаяБаза.БазаНУ = 0 Тогда
			СтавкаНалогаНаПрибыль = 0;
		Иначе
			СтавкаНалогаНаПрибыль = СуммаНалога / НалоговаяБаза.БазаНУ * 100;
		КонецЕсли;
		
	КонецЕсли;

	Если Не УчетПостоянныхРазниц(ПараметрыОтчета) Тогда
		Налог.НалогБУ    = НалоговаяБаза.БазаБУ * СтавкаНалогаНаПрибыль / 100;
		Налог.НалогПР    = Налог.НалогБУ - Налог.НалогНУ;
		Налог.НалогБУКор = Налог.НалогНУ;
	КонецЕсли;
	
	УстановитьПоказатели(Документ, Налог);
	
	ЭлементыСхемы.СтавкаНалогаНаПрибыль.Наименование = Строка(СтавкаНалогаНаПрибыль) + "%";
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("Налог",   "РасшифровкаНалог");
	
	// Если ведется учет разниц, то на счете 68.04.2 иллюстрируется числовая сверка сумм налога
	// - рассчитанной по данным налогового учета
	// - рассчитанной корректировкой условного расхода на показатели ОНА, ОНО, ПНР, ПНД.
	// Такая сверка выполняется по формуле НУ = БУ + ПР + ВР, что не позволяет применять обычный подход,
	// основанный на формуле БУ = НУ + ПР + ВР.
	// Поэтому здесь сравниваем отображаемые пользователю показатели.
	Налог.НалогПР = 0;
	Налог.НалогВР = 0;
	Налог.НалогБУ = Налог.НалогБУКор;
	
	ДополнитьЭлементыРасхождений(ЭлементыРасхождений, ЭлементыСхемы, Налог, ПроверяемыеБлоки, ПараметрыОтчета);
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("Доходы",  "РасшифровкаДоходы");
	ДополнитьЭлементыРасхождений(ЭлементыРасхождений, ЭлементыСхемы, Доходы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("Расходы", "РасшифровкаРасходы");
	ДополнитьЭлементыРасхождений(ЭлементыРасхождений, ЭлементыСхемы, Расходы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	ОтобразитьПодсветкуРасхождений(ЭлементыРасхождений, ЭлементыСхемы, ПараметрыОтчета);
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, "РасчетНалогаНаПрибыль", РасшифровкаМакета);
	
КонецПроцедуры

#Область РасчетНалога

Функция СтавкаНалога(Период, Организация)
	
	// Алгоритм для затратного метода
	РасчетСтавкиНалогаНаПрибыль = Неопределено;
	НалоговыйУчетОбособленныхПодразделений.ВыполнитьЗапросРасчетСтавкиНалогаНаПрибыльЗаМесяц(
		РасчетСтавкиНалогаНаПрибыль,
		Организация,
		КонецДня(Период));
	
	СтрокаСтавки = Неопределено;
	Если РасчетСтавкиНалогаНаПрибыль <> Неопределено Тогда
		ТаблицаСтавок = РасчетСтавкиНалогаНаПрибыль.Выгрузить();
		СтрокаСтавки = ТаблицаСтавок.Найти(Организация, "Организация");
	КонецЕсли;
	
	Если СтрокаСтавки <> Неопределено Тогда
		
		Возврат Окр(СтрокаСтавки.Ставка, 6);
		
	КонецЕсли;
	
	// Актуальный алгоритм
	
	// При применении ПБУ 18 опираемся на ставку, используемую в его целях.
	// Потому что отчет показывает не только сумму налога, но и показатели ПБУ 18.
	Ставка = РегистрыСведений.ПримененныеСтавкиОтложенногоНалога.ПрочитатьСтавки(
		Период,
		Организация,
		"Процент",
		Перечисления.ВидыСтавокОтложенногоНалога.ТекущийНалог);

	Если ТипЗнч(Ставка) = Тип("Число") Тогда
		Возврат Ставка;
	КонецЕсли;
	
	Если ФактическиИспользуетсяНесколькоСтавокНалога(Период, Организация) Тогда
		// Определить единую ставку корректно не получится, например, с учетом закрытых подразделений
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РасчетНалогаНаПрибыль.СуммарнаяУстановленнаяСтавкаНалога(Период, Организация, "Процент");
	
КонецФункции

Функция РассчитаннаяСуммаНалога(НачалоПериода, КонецПериода, Организация)
	
	// При применении ПБУ 18 налог начисляется проводкой
	// Дт 68.04.2 Кт 68.04.1
	// или
	// Дт 99.02.Т Кт 68.04.1
	//
	// Без ПБУ 18 налог начисляется проводкой
	// Дт 99.01   Кт 68.04.1
	
	СчетаТекущегоНалога = НалогНаПрибыльБухгалтерскийУчет.СчетаТекущегоНалога(); // Для ПБУ 18
	СчетаТекущегоНалога.Добавить(ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД); // Без ПБУ 18
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",       НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",        КонецМесяца(КонецПериода));
	Запрос.УстановитьПараметр("Организация",         Организация);
	Запрос.УстановитьПараметр("СчетаТекущегоНалога", СчетаТекущегоНалога);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ХозрасчетныйОборотыДтКт.СуммаОборот), 0) КАК НачисленныйНалог
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &КонецПериода, , СчетДт В (&СчетаТекущегоНалога), , СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСБюджетом), , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НачисленныйНалог;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ФактическиИспользуетсяНесколькоСтавокНалога(Период, Организация)
	
	Расчет = Неопределено;
	НалоговыйУчетОбособленныхПодразделений.ПрочитатьРасчетРаспределенияНалоговойБазы(Расчет, Период, Организация);
	
	Если Расчет = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтавкиРегиональныйБюджет = Новый Соответствие;
	НалоговыйУчетОбособленныхПодразделений.ЗаполнитьНалоговыеСтавкиРегиональныйБюджет(
		СтавкиРегиональныйБюджет,
		Период,
		Организация,
		Расчет.ВыгрузитьКолонку("РегистрацияВНалоговомОргане"));
		
	ЕдинаяСтавка = Неопределено;
		
	Для Каждого Запись Из Расчет Цикл
		
		Ставка = СтавкиРегиональныйБюджет[Запись.РегистрацияВНалоговомОргане];
		Если Ставка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЕдинаяСтавка = Неопределено Тогда
			ЕдинаяСтавка = Ставка;
		ИначеЕсли ЕдинаяСтавка <> Ставка Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь; // Во всех регионах ставка одинаковая
	
КонецФункции

#КонецОбласти

Процедура СформироватьДоходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	УстановитьПараметрыСчетаВыручкиСебестоимости(Запрос, ПараметрыОтчета.КонецПериода, ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтатьиПрибылиУбыткиПрошлыхЛет
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|ГДЕ
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрибыльУбытокПрошлыхЛет)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК Доходы90БУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт КАК Доходы90НУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт КАК Доходы90ПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт КАК Доходы90ВР,
	|	0 КАК Доходы91УчБУ,
	|	0 КАК Доходы91УчНУ,
	|	0 КАК Доходы91УчПР,
	|	0 КАК Доходы91УчВР,
	|	0 КАК Доходы91НЕБУ,
	|	0 КАК Доходы91НЕНУ,
	|	0 КАК Доходы91НЕПР,
	|	0 КАК Доходы91НЕВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаНеЕНВД)), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)),
	|			,
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	-ХозрасчетныйОбороты.СуммаОборотДт,
	|	-ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	-ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	-ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_Акцизы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_ЭкспортныеПошлины)), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА -ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА -ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА -ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА -ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА -ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА -ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА -ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА -ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат В (ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Прибыли.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	-ЕСТЬNULL(СУММА(Прибыли.СуммаНУОборотКт), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт В (&СчетаСебестоимостьПродаж),
	|			,
	|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И СубконтоКт1 В
	|					(ВЫБРАТЬ
	|						СтатьиПрибылиУбыткиПрошлыхЛет.Ссылка
	|					ИЗ
	|						СтатьиПрибылиУбыткиПрошлыхЛет)) КАК Прибыли
	|
	|СГРУППИРОВАТЬ ПО
	|	Прибыли.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Убытки.Организация,
	|	0,
	|	-ЕСТЬNULL(СУММА(Убытки.СуммаНУОборотДт), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			СчетКт В (&СчетаВыручка),
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						СтатьиПрибылиУбыткиПрошлыхЛет.Ссылка
	|					ИЗ
	|						СтатьиПрибылиУбыткиПрошлыхЛет)) КАК Убытки
	|
	|СГРУППИРОВАТЬ ПО
	|	Убытки.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.Доходы90БУ) КАК Доходы90БУ,
	|	СУММА(ВТХозрасчетный.Доходы90НУ) КАК Доходы90НУ,
	|	СУММА(ВТХозрасчетный.Доходы90ПР) КАК Доходы90ПР,
	|	СУММА(ВТХозрасчетный.Доходы90ВР) КАК Доходы90ВР,
	|	СУММА(ВТХозрасчетный.Доходы91УчБУ) КАК Доходы91УчБУ,
	|	СУММА(ВТХозрасчетный.Доходы91УчНУ) КАК Доходы91УчНУ,
	|	СУММА(ВТХозрасчетный.Доходы91УчПР) КАК Доходы91УчПР,
	|	СУММА(ВТХозрасчетный.Доходы91УчВР) КАК Доходы91УчВР,
	|	СУММА(ВТХозрасчетный.Доходы91НЕБУ) КАК Доходы91НЕБУ,
	|	СУММА(ВТХозрасчетный.Доходы91НЕНУ) КАК Доходы91НЕНУ,
	|	СУММА(ВТХозрасчетный.Доходы91НЕПР) КАК Доходы91НЕПР,
	|	СУММА(ВТХозрасчетный.Доходы91НЕВР) КАК Доходы91НЕВР,
	|	СУММА(ВТХозрасчетный.Доходы91УчБУ + ВТХозрасчетный.Доходы91НЕБУ) КАК Доходы91БУ,
	|	СУММА(ВТХозрасчетный.Доходы91УчНУ + ВТХозрасчетный.Доходы91НЕНУ) КАК Доходы91НУ,
	|	СУММА(ВТХозрасчетный.Доходы91УчПР + ВТХозрасчетный.Доходы91НЕПР) КАК Доходы91ПР,
	|	СУММА(ВТХозрасчетный.Доходы91УчВР + ВТХозрасчетный.Доходы91НЕВР) КАК Доходы91ВР,
	|	СУММА(ВТХозрасчетный.Доходы90БУ + ВТХозрасчетный.Доходы91УчБУ) КАК Доходы9091БУ,
	|	СУММА(ВТХозрасчетный.Доходы90НУ + ВТХозрасчетный.Доходы91УчНУ) КАК Доходы9091НУ,
	|	СУММА(ВТХозрасчетный.Доходы90ПР + ВТХозрасчетный.Доходы91УчПР) КАК Доходы9091ПР,
	|	СУММА(ВТХозрасчетный.Доходы90ВР + ВТХозрасчетный.Доходы91УчВР) КАК Доходы9091ВР,
	|	СУММА(ВТХозрасчетный.Доходы90БУ + ВТХозрасчетный.Доходы91УчБУ + ВТХозрасчетный.Доходы91НЕБУ) КАК ДоходыБУ,
	|	СУММА(ВТХозрасчетный.Доходы90НУ + ВТХозрасчетный.Доходы91УчНУ + ВТХозрасчетный.Доходы91НЕНУ) КАК ДоходыНУ,
	|	СУММА(ВТХозрасчетный.Доходы90ПР + ВТХозрасчетный.Доходы91УчПР + ВТХозрасчетный.Доходы91НЕПР) КАК ДоходыПР,
	|	СУММА(ВТХозрасчетный.Доходы90ВР + ВТХозрасчетный.Доходы91УчВР + ВТХозрасчетный.Доходы91НЕВР) КАК ДоходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		Запрос.УстановитьПараметр("Организация", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("Доходы90");
	ПоляСтраницы.Добавить("Доходы91Уч");
	ПоляСтраницы.Добавить("Доходы91НЕ");
	ПоляСтраницы.Добавить("Доходы91");
	ПоляСтраницы.Добавить("Доходы9091");
	ПоляСтраницы.Добавить("Доходы");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(), 
			"Доходы", 1, "Доходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ИмяМакета     = "Доходы" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, ПоляСтраницы, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);
		
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("Доходы", 	"РасшифровкаНалог");
	ПроверяемыеБлоки.Вставить("Доходы9091", "Расшифровка9091");
	ПроверяемыеБлоки.Вставить("Доходы91НЕ", "Расшифровка91Не");
	ПроверяемыеБлоки.Вставить("Доходы91Уч", "Расшифровка91Уч");
	ПроверяемыеБлоки.Вставить("Доходы90",   "Расшифровка90");
	ПроверяемыеБлоки.Вставить("Доходы91",   "Расшифровка91");
	
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	Если НЕ ПараметрыОтчета.ВключатьОбособленныеПодразделения Тогда
		
		РасшифровкаМакета.Вставить("РасшифровкаНалог", ПереходКСхеме(ПараметрыОтчета, 0, СтруктураВП));
		ЭлементыСхемы.РасшифровкаНалог.Гиперссылка = Истина;
		
	КонецЕсли;	
		
	РасшифровкаМакета.Вставить("Расшифровка90",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаВыручкаПоОбычнымВидамДеятельности"));
	РасшифровкаМакета.Вставить("Расшифровка9091", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаДоходыУчитываемыеПриОпределенииНалоговойБазы"));
	РасшифровкаМакета.Вставить("Расшифровка91НЕ", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаДоходыНеУчитываемыеВНалоговойБазе"));
	РасшифровкаМакета.Вставить("Расшифровка91Уч", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеДоходыУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("Расшифровка91",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеДоходы"));
		
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);
	
КонецПроцедуры

Процедура СформироватьРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; // Для СоздатьДолиЕНВД().
	
	СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	Запрос.УстановитьПараметр("СписокОП", 	   СписокОП);
	
	УстановитьПараметрыСчетаВыручкиСебестоимости(Запрос, ПараметрыОтчета.КонецПериода, ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Налоговыйучет.СоздатьДолиЕНВД(
		Запрос.МенеджерВременныхТаблиц,
		Запрос.Параметры.НачалоПериода,
		Запрос.Параметры.КонецПериода,
		Запрос.Параметры.СписокОП); 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтатьиПрибылиУбыткиПрошлыхЛет
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|ГДЕ
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрибыльУбытокПрошлыхЛет)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыТоварыУчБУ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыТоварыУчНУ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыТоварыУчПР,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыТоварыУчВР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыУслугиБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыУслугиНУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыУслугиПР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыУслугиВР,
	|	0 КАК ТранспортныеРасходыБУ,
	|	0 КАК ТранспортныеРасходыНУ,
	|	0 КАК ТранспортныеРасходыПР,
	|	0 КАК ТранспортныеРасходыВР,
	|	0 КАК КосвенныеРасходыНЕБУ,
	|	0 КАК КосвенныеРасходыНеНУ,
	|	0 КАК КосвенныеРасходыНеПР,
	|	0 КАК КосвенныеРасходыНеВР,
	|	0 КАК КосвенныеРасходыУчБУ,
	|	0 КАК КосвенныеРасходыУчНУ,
	|	0 КАК КосвенныеРасходыУчПР,
	|	0 КАК КосвенныеРасходыУчВР,
	|	0 КАК ПрочиеРасходыУчБУ,
	|	0 КАК ПрочиеРасходыУчНУ,
	|	0 КАК ПрочиеРасходыУчПР,
	|	0 КАК ПрочиеРасходыУчВР,
	|	0 КАК ПрочиеРасходыНеБУ,
	|	0 КАК ПрочиеРасходыНеНУ,
	|	0 КАК ПрочиеРасходыНеПР,
	|	0 КАК ПрочиеРасходыНеВР,
	|	0 КАК ПрямыеРасходыТоварыНеБУ,
	|	0 КАК ПрямыеРасходыТоварыНеНУ,
	|	0 КАК ПрямыеРасходыТоварыНеПР,
	|	0 КАК ПрямыеРасходыТоварыНеВр,
	|	0 КАК КосвенныеРасходыРаспрБУ,
	|	0 КАК КосвенныеРасходыРаспрНУ,
	|	0 КАК КосвенныеРасходыРаспрПР,
	|	0 КАК КосвенныеРасходыРаспрВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД)), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов)),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|						ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|					ИНАЧЕ 0
	|				КОНЕЦ + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|						ТОГДА ХозрасчетныйОбороты.СуммаОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|						ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|					ИНАЧЕ 0
	|				КОНЕЦ + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|						ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|						ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|					ИНАЧЕ 0
	|				КОНЕЦ + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|						ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|						ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|					ИНАЧЕ 0
	|				КОНЕЦ + ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|						ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|				И НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов)),
	|			,
	|			) КАК ХозрасчетныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолиЕНВД КАК ДолиЕНВД
	|		ПО ХозрасчетныйОбороты.Период = ДолиЕНВД.МесяцЕНВД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД)), , Организация = &Организация, , ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД)),
	|			,
	|			Организация = &Организация
	|				И КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|				И НЕ КорСубконто1.ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения),
	|			,
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов),
	|			Организация = &Организация
	|				И Субконто1.ВидРБП В (ЗНАЧЕНИЕ(Перечисление.ВидыРБП.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(Перечисление.ВидыРБП.УбыткиОтРеализацииАмортизируемогоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыРБП.УбыткиПрошлыхЛетОбслуживающихПроизводствИХозяйств)),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Прибыли.Организация,
	|	0,
	|	-ЕСТЬNULL(СУММА(Прибыли.СуммаНУОборотКт), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт В (&СчетаСебестоимостьПродаж),
	|			,
	|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И СубконтоКт1 В
	|					(ВЫБРАТЬ
	|						СтатьиПрибылиУбыткиПрошлыхЛет.Ссылка
	|					ИЗ
	|						СтатьиПрибылиУбыткиПрошлыхЛет)) КАК Прибыли
	|
	|СГРУППИРОВАТЬ ПО
	|	Прибыли.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Убытки.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	-ЕСТЬNULL(СУММА(Убытки.СуммаНУОборотДт), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			СчетКт В (&СчетаВыручка),
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						СтатьиПрибылиУбыткиПрошлыхЛет.Ссылка
	|					ИЗ
	|						СтатьиПрибылиУбыткиПрошлыхЛет)) КАК Убытки
	|
	|СГРУППИРОВАТЬ ПО
	|	Убытки.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчБУ) КАК ПрямыеРасходыТоварыУчБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчНУ) КАК ПрямыеРасходыТоварыУчНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчПР) КАК ПрямыеРасходыТоварыУчПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчВР) КАК ПрямыеРасходыТоварыУчВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиБУ) КАК ПрямыеРасходыУслугиБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиНУ) КАК ПрямыеРасходыУслугиНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиПР) КАК ПрямыеРасходыУслугиПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиВР) КАК ПрямыеРасходыУслугиВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчБУ) КАК ПрочиеРасходыУчБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчНУ) КАК ПрочиеРасходыУчНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчПР) КАК ПрочиеРасходыУчПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыУчВР) КАК ПрочиеРасходыУчВР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыБУ) КАК ТранспортныеРасходыБУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыНУ) КАК ТранспортныеРасходыНУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыПР) КАК ТранспортныеРасходыПР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыВР) КАК ТранспортныеРасходыВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНЕБУ) КАК КосвенныеРасходыНЕБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеНУ) КАК КосвенныеРасходыНеНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеПР) КАК КосвенныеРасходыНеПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеВР) КАК КосвенныеРасходыНеВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчБУ) КАК КосвенныеРасходыУчБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчНУ) КАК КосвенныеРасходыУчНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчПР) КАК КосвенныеРасходыУчПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчВР) КАК КосвенныеРасходыУчВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеБУ) КАК ПрочиеРасходыНеБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеНУ) КАК ПрочиеРасходыНеНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеПР) КАК ПрочиеРасходыНеПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеВР) КАК ПрочиеРасходыНеВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНеБУ) КАК ПрямыеРасходыТоварыНеБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНеНУ) КАК ПрямыеРасходыТоварыНеНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНеПР) КАК ПрямыеРасходыТоварыНеПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНеВр) КАК ПрямыеРасходыТоварыНеВр,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыРаспрБУ) КАК КосвенныеРасходыРаспрБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыРаспрНУ) КАК КосвенныеРасходыРаспрНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыРаспрПР) КАК КосвенныеРасходыРаспрПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыРаспрВР) КАК КосвенныеРасходыРаспрВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчБУ + ВТХозрасчетный.ПрямыеРасходыУслугиБУ + ВТХозрасчетный.ПрочиеРасходыУчБУ + ВТХозрасчетный.ТранспортныеРасходыБУ + ВТХозрасчетный.КосвенныеРасходыНЕБУ + ВТХозрасчетный.КосвенныеРасходыУчБУ + ВТХозрасчетный.ПрочиеРасходыНеБУ + ВТХозрасчетный.ПрямыеРасходыТоварыНеБУ + ВТХозрасчетный.КосвенныеРасходыРаспрБУ) КАК РасходыБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчНУ + ВТХозрасчетный.ПрямыеРасходыУслугиНУ + ВТХозрасчетный.ПрочиеРасходыУчНУ + ВТХозрасчетный.ТранспортныеРасходыНУ + ВТХозрасчетный.КосвенныеРасходыНеНУ + ВТХозрасчетный.КосвенныеРасходыУчНУ + ВТХозрасчетный.ПрочиеРасходыНеНУ + ВТХозрасчетный.ПрямыеРасходыТоварыНеНУ + ВТХозрасчетный.КосвенныеРасходыРаспрНУ) КАК РасходыНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчПР + ВТХозрасчетный.ПрямыеРасходыУслугиПР + ВТХозрасчетный.ПрочиеРасходыУчПР + ВТХозрасчетный.ТранспортныеРасходыПР + ВТХозрасчетный.КосвенныеРасходыНеПР + ВТХозрасчетный.КосвенныеРасходыУчПР + ВТХозрасчетный.ПрочиеРасходыНеПР + ВТХозрасчетный.ПрямыеРасходыТоварыНеПР + ВТХозрасчетный.КосвенныеРасходыРаспрПР) КАК РасходыПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыУчВР + ВТХозрасчетный.ПрямыеРасходыУслугиВР + ВТХозрасчетный.ПрочиеРасходыУчВР + ВТХозрасчетный.ТранспортныеРасходыВР + ВТХозрасчетный.КосвенныеРасходыНеВР + ВТХозрасчетный.КосвенныеРасходыУчВР + ВТХозрасчетный.ПрочиеРасходыНеВР + ВТХозрасчетный.ПрямыеРасходыТоварыНеВр + ВТХозрасчетный.КосвенныеРасходыРаспрВР) КАК РасходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("ПрямыеРасходыТоварыУч");
	ПоляСтраницы.Добавить("ПрямыеРасходыУслуги");
	ПоляСтраницы.Добавить("ПрочиеРасходыУч");
	ПоляСтраницы.Добавить("ТранспортныеРасходы");
	ПоляСтраницы.Добавить("КосвенныеРасходыНЕ");
	ПоляСтраницы.Добавить("КосвенныеРасходыУч");
	ПоляСтраницы.Добавить("ПрочиеРасходыНе");
	ПоляСтраницы.Добавить("ПрямыеРасходыТоварыНе");
	ПоляСтраницы.Добавить("КосвенныеРасходыРаспр");
	ПоляСтраницы.Добавить("Расходы");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(), 
			"Расходы", 2, "Расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ЭтоЕНВД       = УчетнаяПолитика.ПлательщикЕНВД(ПараметрыОтчета.ОрганизацияРасшифровки, ПараметрыОтчета.КонецПериода);
		ИмяМакета	  = ?(ЭтоЕНВД, "РасходыЕНВД", "Расходы") + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, ПоляСтраницы, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("Расходы",               "РасшифровкаНалог");
	ПроверяемыеБлоки.Вставить("ПрямыеРасходыТоварыУч", "РасшифровкаРасходыТовары");
	ПроверяемыеБлоки.Вставить("ПрочиеРасходыУч",       "РасшифровкаПрочиеРасходы");
	ПроверяемыеБлоки.Вставить("ПрямыеРасходыУслуги",   "РасшифровкаРасходыПроизводства");
	ПроверяемыеБлоки.Вставить("ПрочиеРасходыНе",       "РасшифровкаПрочиеРасходы_1");
	ПроверяемыеБлоки.Вставить("ТранспортныеРасходы",   "РасшифровкаТраспортныеРасходы");
	ПроверяемыеБлоки.Вставить("ПрямыеРасходыТоварыНе", "РасшифровкаРасходыТовары_1");
	ПроверяемыеБлоки.Вставить("КосвенныеРасходыУч",    "РасшифровкаКосвенныеРасходы");
	ПроверяемыеБлоки.Вставить("КосвенныеРасходыНе",    "РасшифровкаКосвенныеРасходы_1");
	
	Если ЭтоЕНВД Тогда
		
		ПроверяемыеБлоки.Вставить("КосвенныеРасходыРаспр", "РасшифровкаРаспределяемыеРасходы");
		
	КонецЕсли;
	
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	
	Если НЕ ПараметрыОтчета.ВключатьОбособленныеПодразделения Тогда
		
		РасшифровкаМакета.Вставить("РасшифровкаНалог", ПереходКСхеме(ПараметрыОтчета, 0, СтруктураВП));
		
	КонецЕсли;
	
	РасшифровкаМакета.Вставить("РасшифровкаРасходыТовары",         ПереходКСхеме(ПараметрыОтчета, 3,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыПроизводства",   ПереходКСхеме(ПараметрыОтчета, 4,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаТраспортныеРасходы",    ПереходКСхеме(ПараметрыОтчета, 5,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходы",      ПереходКСхеме(ПараметрыОтчета, 6,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходы",         ПереходКСхеме(ПараметрыОтчета, 7,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходы", ПереходКСхеме(ПараметрыОтчета, 8,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыОбычные",        ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);
	
КонецПроцедуры

Процедура СформироватьОбычныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	
	МассивСтатьиЗатратНомГруппы = Новый Массив;
	МассивСтатьиЗатратНомГруппы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	МассивСтатьиЗатратНомГруппы.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериодаПрошлого", '20000101');
	Запрос.УстановитьПараметр("КонецПериодаПрошлого",  НачалоДня(ПараметрыОтчета.НачалоПериода) - 1);
	Запрос.УстановитьПараметр("НачалоПериода",		   ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",		   КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация", 		   ПараметрыОтчета.ОрганизацияРасшифровки);
	Запрос.УстановитьПараметр("СтатьиЗатратНомГруппы", МассивСтатьиЗатратНомГруппы);
	                                                                                    
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.НоменклатурныеГруппы) КАК Субконто1
	|ПОМЕСТИТЬ ВТНоменклатурныеГруппы
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы), Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Субконто1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
	|	0 КАК РасходыТранспортныеБУ,
	|	0 КАК РасходыТранспортныеНУ,
	|	0 КАК РасходыТранспортныеПР,
	|	0 КАК РасходыТранспортныеВР,
	|	0 КАК РасходыТранспортныеНачБУ,
	|	0 КАК РасходыТранспортныеНачНУ,
	|	0 КАК РасходыТранспортныеНачПР,
	|	0 КАК РасходыТранспортныеНачВР,
	|	0 КАК Расходы1БУ,
	|	0 КАК Расходы1НУ,
	|	0 КАК Расходы1ПР,
	|	0 КАК Расходы1Вр,
	|	0 КАК Расходы2БУ,
	|	0 КАК Расходы2НУ,
	|	0 КАК Расходы2Пр,
	|	0 КАК Расходы2ВР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК РасходыПрямыеБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток КАК РасходыПрямыеНУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток КАК РасходыПрямыеПР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток КАК РасходыПрямыеВР,
	|	0 КАК РасходыКосвенныеБУ,
	|	0 КАК РасходыКосвенныеНУ,
	|	0 КАК РасходыКосвенныеПР,
	|	0 КАК РасходыКосвенныеВР,
	|	0 КАК АмортизацияБУ,
	|	0 КАК АмортизацияНУ,
	|	0 КАК АмортизацияПР,
	|	0 КАК АмортизацияВР,
	|	0 КАК Расходы3БУ,
	|	0 КАК Расходы3НУ,
	|	0 КАК Расходы3ПР,
	|	0 КАК Расходы3ВР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК НЗПБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток КАК НЗПНУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток КАК НЗППР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток КАК НЗПВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы),
	|			НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.НоменклатурныеГруппы) В
	|						(ВЫБРАТЬ
	|							ВТНоменклатурныеГруппы.Субконто1
	|						ИЗ
	|							ВТНоменклатурныеГруппы КАК ВТНоменклатурныеГруппы)
	|				И Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|					И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|					И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|					И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|					И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНУОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаПРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаВРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|				И НЕ ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|				И НЕ ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|				И НЕ ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)
	|				И НЕ ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья)), , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	-ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	-ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД)),
	|			) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.СуммаВРОборотКт < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериодаПрошлого,
	|			&КонецПериодаПрошлого,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ В (ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ПредставительскиеРасходы), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов), ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.РасходыНаРекламуНормируемые)),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация,
	|	СУММА(ВТХозрасчетный.РасходыТранспортныеБУ) КАК РасходыТранспортныеБУ,
	|	СУММА(ВТХозрасчетный.РасходыТранспортныеНУ) КАК РасходыТранспортныеНУ,
	|	СУММА(ВТХозрасчетный.РасходыТранспортныеПР) КАК РасходыТранспортныеПР,
	|	СУММА(ВТХозрасчетный.РасходыТранспортныеВР) КАК РасходыТранспортныеВР,
	|	СУММА(ВТХозрасчетный.РасходыТранспортныеНачБУ) КАК РасходыТранспортныеНачБУ,
	|	СУММА(ВТХозрасчетный.РасходыТранспортныеНачНУ) КАК РасходыТранспортныеНачНУ,
	|	СУММА(ВТХозрасчетный.РасходыТранспортныеНачПР) КАК РасходыТранспортныеНачПР,
	|	СУММА(ВТХозрасчетный.РасходыТранспортныеНачВР) КАК РасходыТранспортныеНачВР,
	|	СУММА(ВТХозрасчетный.Расходы1БУ) КАК Расходы1БУ,
	|	СУММА(ВТХозрасчетный.Расходы1НУ) КАК Расходы1НУ,
	|	СУММА(ВТХозрасчетный.Расходы1ПР) КАК Расходы1ПР,
	|	СУММА(ВТХозрасчетный.Расходы1Вр) КАК Расходы1Вр,
	|	СУММА(ВТХозрасчетный.Расходы2БУ) КАК Расходы2БУ,
	|	СУММА(ВТХозрасчетный.Расходы2НУ) КАК Расходы2НУ,
	|	СУММА(ВТХозрасчетный.Расходы2Пр) КАК Расходы2Пр,
	|	СУММА(ВТХозрасчетный.Расходы2ВР) КАК Расходы2ВР,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеБУ) КАК РасходыПрямыеБУ,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеНУ) КАК РасходыПрямыеНУ,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеПР) КАК РасходыПрямыеПР,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеВР) КАК РасходыПрямыеВР,
	|	СУММА(ВТХозрасчетный.РасходыКосвенныеБУ) КАК РасходыКосвенныеБУ,
	|	СУММА(ВТХозрасчетный.РасходыКосвенныеНУ) КАК РасходыКосвенныеНУ,
	|	СУММА(ВТХозрасчетный.РасходыКосвенныеПР) КАК РасходыКосвенныеПР,
	|	СУММА(ВТХозрасчетный.РасходыКосвенныеВР) КАК РасходыКосвенныеВР,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеБУ + ВТХозрасчетный.РасходыКосвенныеБУ + ВТХозрасчетный.РасходыТранспортныеБУ) КАК РасходыБУ,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеНУ + ВТХозрасчетный.РасходыКосвенныеНУ + ВТХозрасчетный.РасходыТранспортныеНУ) КАК РасходыНУ,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеПР + ВТХозрасчетный.РасходыКосвенныеПР + ВТХозрасчетный.РасходыТранспортныеПР) КАК РасходыПР,
	|	СУММА(ВТХозрасчетный.РасходыПрямыеВР + ВТХозрасчетный.РасходыКосвенныеВР + ВТХозрасчетный.РасходыТранспортныеВР) КАК РасходыВР,
	|	СУММА(ВТХозрасчетный.АмортизацияБУ) КАК АмортизацияБУ,
	|	СУММА(ВТХозрасчетный.АмортизацияНУ) КАК АмортизацияНУ,
	|	СУММА(ВТХозрасчетный.АмортизацияПР) КАК АмортизацияПР,
	|	СУММА(ВТХозрасчетный.АмортизацияВР) КАК АмортизацияВР,
	|	СУММА(ВТХозрасчетный.Расходы3БУ) КАК Расходы3БУ,
	|	СУММА(ВТХозрасчетный.Расходы3НУ) КАК Расходы3НУ,
	|	СУММА(ВТХозрасчетный.Расходы3ПР) КАК Расходы3ПР,
	|	СУММА(ВТХозрасчетный.Расходы3ВР) КАК Расходы3ВР,
	|	СУММА(ВТХозрасчетный.НЗПБУ) КАК НЗПБУ,
	|	СУММА(ВТХозрасчетный.НЗПНУ) КАК НЗПНУ,
	|	СУММА(ВТХозрасчетный.НЗППР) КАК НЗППР,
	|	СУММА(ВТХозрасчетный.НЗПВР) КАК НЗПВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		Запрос.УстановитьПараметр("Организация", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("РасходыТранспортные");
	ПоляСтраницы.Добавить("РасходыТранспортныеНач");
	ПоляСтраницы.Добавить("Расходы1");
	ПоляСтраницы.Добавить("Расходы2");
	ПоляСтраницы.Добавить("РасходыПрямые");
	ПоляСтраницы.Добавить("РасходыКосвенные");
	ПоляСтраницы.Добавить("Расходы");
	ПоляСтраницы.Добавить("Амортизация");
	ПоляСтраницы.Добавить("Расходы3");
	ПоляСтраницы.Добавить("НЗП");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(), "Расходы", 10, 
			"Расходы по обычным видам деятельности", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ИмяМакета     = "РасходыОбычные" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, ПоляСтраницы, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("РасходыПрямые",          "РасшифровкаРасходыПрямые");
	ПроверяемыеБлоки.Вставить("РасходыКосвенные",       "РасшифровкаРасходыКосвенные");
	ПроверяемыеБлоки.Вставить("РасходыТранспортные",    "РасшифровкаРасходыТранспортные");
	ПроверяемыеБлоки.Вставить("Расходы1",               "РасшифровкаРасходы1");
	ПроверяемыеБлоки.Вставить("Амортизация",            "РасшифровкаАмортизация");
	ПроверяемыеБлоки.Вставить("Расходы2",               "РасшифровкаРасходы2");
	ПроверяемыеБлоки.Вставить("РасходыТранспортныеНач", "РасшифровкаРасходыТранспортныеНач");
	ПроверяемыеБлоки.Вставить("Расходы3",               "РасшифровкаРасходы3");
	ПроверяемыеБлоки.Вставить("НЗП",                    "РасшифровкаНЗП");
	ПроверяемыеБлоки.Вставить("Расходы",                "Расходы");
	
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	РасшифровкаМакета.Вставить("РасшифровкаРасходы1",               ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаСтоимостьТоваровРБП"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыПрямые",          ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрямыеПроизводственныеРасходы"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыКосвенные",       ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходы"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыТранспортные",    ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаТранспортныхРасходов"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыТранспортныеНач", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаТранспортныхРасходовОтнесенныхНаНачалоПериода"));
	РасшифровкаМакета.Вставить("РасшифровкаАмортизация",            ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаАмортизация"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходы2",               ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаУслугиСтороннихОрганизаций"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходы3",               ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыНеВключенные"));
	РасшифровкаМакета.Вставить("РасшифровкаНЗП",                    ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаНезавершенноеПроизводствоПрошлыхЛет"));
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование 	= ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);

КонецПроцедуры

Процедура СформироватьПрочиеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;

	СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц; // Для СоздатьДолиЕНВД()
	
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	Запрос.УстановитьПараметр("СписокОП",      СписокОП);
	
	УстановитьПараметрыСчетаВыручкиСебестоимости(Запрос, ПараметрыОтчета.КонецПериода, ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Налоговыйучет.СоздатьДолиЕНВД(
		Запрос.МенеджерВременныхТаблиц,
		Запрос.Параметры.НачалоПериода,
		Запрос.Параметры.КонецПериода,
		Запрос.Параметры.СписокОП); 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтатьиПрибылиУбыткиПрошлыхЛет
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|ГДЕ
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрибыльУбытокПрошлыхЛет)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК ПрочиеРасходыОСБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт КАК ПрочиеРасходыОСНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт КАК ПрочиеРасходыОСПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт КАК ПрочиеРасходыОСВР,
	|	0 КАК ПрочиеРасходыДрБУ,
	|	0 КАК ПрочиеРасходыДрНУ,
	|	0 КАК ПрочиеРасходыДрПР,
	|	0 КАК ПрочиеРасходыДрВР,
	|	0 КАК ПрочиеРасходыНеБУ,
	|	0 КАК ПрочиеРасходыНеНУ,
	|	0 КАК ПрочиеРасходыНеПР,
	|	0 КАК ПрочиеРасходыНеВР,
	|	0 КАК ПрочиеРасходыРаспрБУ,
	|	0 КАК ПрочиеРасходыРаспрНУ,
	|	0 КАК ПрочиеРасходыРаспрПР,
	|	0 КАК ПрочиеРасходыРаспрВР,
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК ПрочиеРасходыНеЕНВДБУ,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт КАК ПрочиеРасходыНеЕНВДНУ,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт КАК ПрочиеРасходыНеЕНВДПР,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт КАК ПрочиеРасходыНеЕНВДВР,
	|	0 КАК ПрочиеРасходыЕНВДБУ,
	|	0 КАК ПрочиеРасходыЕНВДНУ,
	|	0 КАК ПрочиеРасходыЕНВДПР,
	|	0 КАК ПрочиеРасходыЕНВДВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету,
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|				И НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы)),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы)),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов),
	|			Организация = &Организация
	|				И Субконто1.ВидРБП В (ЗНАЧЕНИЕ(Перечисление.ВидыРБП.УбыткиПрошлыхЛет), ЗНАЧЕНИЕ(Перечисление.ВидыРБП.УбыткиОтРеализацииАмортизируемогоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыРБП.УбыткиПрошлыхЛетОбслуживающихПроизводствИХозяйств)),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	-ХозрасчетныйОбороты.СуммаОборотДт,
	|	-ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	-ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	-ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|				И НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт * ДолиЕНВД.ДоляЕНВД,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт * ДолиЕНВД.ДоляЕНВД,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт * ДолиЕНВД.ДоляЕНВД,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт * ДолиЕНВД.ДоляЕНВД
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Месяц,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыиРасходы),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДС), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования)),
	|			) КАК ХозрасчетныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолиЕНВД КАК ДолиЕНВД
	|		ПО ХозрасчетныйОбороты.Период = ДолиЕНВД.МесяцЕНВД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Убытки.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	-ЕСТЬNULL(СУММА(Убытки.СуммаНУОборотДт), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	-ЕСТЬNULL(СУММА(Убытки.СуммаНУОборотДт), 0),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			СчетКт В (&СчетаВыручка),
	|			,
	|			Организация = &Организация
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						СтатьиПрибылиУбыткиПрошлыхЛет.Ссылка
	|					ИЗ
	|						СтатьиПрибылиУбыткиПрошлыхЛет)) КАК Убытки
	|
	|СГРУППИРОВАТЬ ПО
	|	Убытки.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСБУ) КАК ПрочиеРасходыОСБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСНУ) КАК ПрочиеРасходыОСНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСПР) КАК ПрочиеРасходыОСПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСВР) КАК ПрочиеРасходыОСВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыДрБУ) КАК ПрочиеРасходыДрБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыДрНУ) КАК ПрочиеРасходыДрНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыДрПР) КАК ПрочиеРасходыДрПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыДрВР) КАК ПрочиеРасходыДрВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеБУ) КАК ПрочиеРасходыНеБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеНУ) КАК ПрочиеРасходыНеНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеПР) КАК ПрочиеРасходыНеПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеВР) КАК ПрочиеРасходыНеВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыРаспрБУ) КАК ПрочиеРасходыРаспрБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыРаспрНУ) КАК ПрочиеРасходыРаспрНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыРаспрПР) КАК ПрочиеРасходыРаспрПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыРаспрВР) КАК ПрочиеРасходыРаспрВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеЕНВДБУ) КАК ПрочиеРасходыНеЕНВДБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеЕНВДНУ) КАК ПрочиеРасходыНеЕНВДНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеЕНВДПР) КАК ПрочиеРасходыНеЕНВДПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеЕНВДВР) КАК ПрочиеРасходыНеЕНВДВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыЕНВДБУ) КАК ПрочиеРасходыЕНВДБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыЕНВДНУ) КАК ПрочиеРасходыЕНВДНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыЕНВДПР) КАК ПрочиеРасходыЕНВДПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыЕНВДВР) КАК ПрочиеРасходыЕНВДВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСБУ + ВТХозрасчетный.ПрочиеРасходыДрБУ) КАК ПрочиеРасходыБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСНУ + ВТХозрасчетный.ПрочиеРасходыДрНУ) КАК ПрочиеРасходыНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСПР + ВТХозрасчетный.ПрочиеРасходыДрПР) КАК ПрочиеРасходыПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыОСВР + ВТХозрасчетный.ПрочиеРасходыДрВР) КАК ПрочиеРасходыВР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеЕНВДБУ + ВТХозрасчетный.ПрочиеРасходыРаспрБУ - ВТХозрасчетный.ПрочиеРасходыЕНВДБУ) КАК ПрочиеРасходыУчБУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеЕНВДНУ + ВТХозрасчетный.ПрочиеРасходыРаспрНУ - ВТХозрасчетный.ПрочиеРасходыЕНВДНУ) КАК ПрочиеРасходыУчНУ,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеЕНВДПР + ВТХозрасчетный.ПрочиеРасходыРаспрПР - ВТХозрасчетный.ПрочиеРасходыЕНВДПР) КАК ПрочиеРасходыУчПР,
	|	СУММА(ВТХозрасчетный.ПрочиеРасходыНеЕНВДВР + ВТХозрасчетный.ПрочиеРасходыРаспрВР - ВТХозрасчетный.ПрочиеРасходыЕНВДВР) КАК ПрочиеРасходыУчВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("ПрочиеРасходыОС");
	ПоляСтраницы.Добавить("ПрочиеРасходыДр");
	ПоляСтраницы.Добавить("ПрочиеРасходыНе");
	ПоляСтраницы.Добавить("ПрочиеРасходыРаспр");
	ПоляСтраницы.Добавить("ПрочиеРасходыНеЕНВД");
	ПоляСтраницы.Добавить("ПрочиеРасходыЕНВД");
	ПоляСтраницы.Добавить("ПрочиеРасходы");
	ПоляСтраницы.Добавить("ПрочиеРасходыУч");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"ПрочиеРасходы", 7, "Прочие расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ЭтоЕНВД       = УчетнаяПолитика.ПлательщикЕНВД(ПараметрыОтчета.ОрганизацияРасшифровки, ПараметрыОтчета.КонецПериода);
		ИмяМакета     = ?(ЭтоЕНВД, "РасходыПрочиеЕНВД", "РасходыПрочие") + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, ПоляСтраницы, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);
	
	ПроверяемыеБлоки = Новый Структура;
	Если ЭтоЕНВД Тогда
		
		ПроверяемыеБлоки.Вставить("ПрочиеРасходыНЕЕНВД", "РасшифровкаПрочиеРасходыНЕЕНВД");
		ПроверяемыеБлоки.Вставить("ПрочиеРасходыЕНВД",   "РасшифровкаПрочиеРасходыЕНВД");
		ПроверяемыеБлоки.Вставить("ПрочиеРасходы", 	     "РасшифровкаПрочиеРасходы");
		ПроверяемыеБлоки.Вставить("ПрочиеРасходыРаспр",  "РасшифровкаПрочиеРасходыРаспр");
		
	КонецЕсли;
	
	ПроверяемыеБлоки.Вставить("ПрочиеРасходыНе", 	 "РасшифровкаПрочиеРасходыНе");
	ПроверяемыеБлоки.Вставить("ПрочиеРасходыУч", 	 "РасшифровкаПрочиеРасходыУч");
	ПроверяемыеБлоки.Вставить("ПрочиеРасходыОС", 	 "РасшифровкаРасходыТовары");
	ПроверяемыеБлоки.Вставить("ПрочиеРасходыДр", 	 "РасшифровкаПрочиеРасходыДр");
		
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	Если ЭтоЕНВД Тогда
		
		РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходыЕНВД",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеРасходыОтнесенныеНаЕНВД"));
		РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходыРаспр",  ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеРасходыРаспределяемые"));
		РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходыНеЕНВД", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеРасходыНеЕНВД"));
	
	КонецЕсли;	
	
	РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходыНе", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеРасходыНеУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходыУч", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеРасходыУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходыДр", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаДругиеПрочиеРасходы"));
	РасшифровкаМакета.Вставить("РасшифровкаПрочиеРасходы",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрочиеРасходы"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыТовары",   ПереходКСхеме(ПараметрыОтчета, 3, СтруктураВП));
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);

КонецПроцедуры

Процедура СформироватьСтоимостьЗапасов(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета   = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК СтоимостьНачБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток КАК СтоимостьНачНУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток КАК СтоимостьНачПР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток КАК СтоимостьНачВР,
	|	0 КАК СтоимостьДтБУ,
	|	0 КАК СтоимостьДтНУ,
	|	0 КАК СтоимостьДтПР,
	|	0 КАК СтоимостьДтВР,
	|	0 КАК СтоимостьВыпускаБУ,
	|	0 КАК СтоимостьВыпускаНУ,
	|	0 КАК СтоимостьВыпускаПР,
	|	0 КАК СтоимостьВыпускаВР,
	|	0 КАК СтоимостьИзлишковБУ,
	|	0 КАК СтоимостьИзлишковНУ,
	|	0 КАК СтоимостьИзлишковПР,
	|	0 КАК СтоимостьИзлишковВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости)),
	|			,
	|			Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)))
	|				И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции)))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)))
	|				И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции)))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)))
	|				И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции)))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)))
	|				И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции)))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости)),
	|			,
	|			Организация = &Организация,
	|			(НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация,
	|	СУММА(ВТХозрасчетный.СтоимостьДтБУ) КАК СтоимостьДтБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьДтНУ) КАК СтоимостьДтНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьДтПР) КАК СтоимостьДтПР,
	|	СУММА(ВТХозрасчетный.СтоимостьДтВР) КАК СтоимостьДтВР,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаБУ) КАК СтоимостьВыпускаБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаНУ) КАК СтоимостьВыпускаНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаПР) КАК СтоимостьВыпускаПР,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаВР) КАК СтоимостьВыпускаВР,
	|	СУММА(ВТХозрасчетный.СтоимостьИзлишковБУ) КАК СтоимостьИзлишковБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьИзлишковНУ) КАК СтоимостьИзлишковНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьИзлишковПР) КАК СтоимостьИзлишковПР,
	|	СУММА(ВТХозрасчетный.СтоимостьИзлишковВР) КАК СтоимостьИзлишковВР,
	|	СУММА(ВТХозрасчетный.СтоимостьНачБУ) КАК СтоимостьНачБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьНачНУ) КАК СтоимостьНачНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьНачПР) КАК СтоимостьНачПР,
	|	СУММА(ВТХозрасчетный.СтоимостьНачВР) КАК СтоимостьНачВР,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаБУ + ВТХозрасчетный.СтоимостьИзлишковБУ + ВТХозрасчетный.СтоимостьДтБУ + ВТХозрасчетный.СтоимостьНачБУ) КАК СтоимостьБУ,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаНУ + ВТХозрасчетный.СтоимостьИзлишковНУ + ВТХозрасчетный.СтоимостьДтНУ + ВТХозрасчетный.СтоимостьНачНУ) КАК СтоимостьНУ,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаПР + ВТХозрасчетный.СтоимостьИзлишковПР + ВТХозрасчетный.СтоимостьДтПР + ВТХозрасчетный.СтоимостьНачПР) КАК СтоимостьПР,
	|	СУММА(ВТХозрасчетный.СтоимостьВыпускаВР + ВТХозрасчетный.СтоимостьИзлишковВР + ВТХозрасчетный.СтоимостьДтВР + ВТХозрасчетный.СтоимостьНачВР) КАК СтоимостьВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("СтоимостьДт");
	ПоляСтраницы.Добавить("СтоимостьВыпуска");
	ПоляСтраницы.Добавить("СтоимостьИзлишков");
	ПоляСтраницы.Добавить("СтоимостьНач");
	ПоляСтраницы.Добавить("Стоимость");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"Стоимость", 9, "Активы", КэшПараметровОтчета);
		Возврат;
		
	Иначе	
		
		ИмяМакета     = "СтоимостьТоваров" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, ПоляСтраницы, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("Стоимость",         "РасшифровкаРасходыТовары");
	ПроверяемыеБлоки.Вставить("СтоимостьДт",       "РасшифровкаСтоимостьДт");
	ПроверяемыеБлоки.Вставить("СтоимостьНач",      "РасшифровкаСтоимостьНач");
	ПроверяемыеБлоки.Вставить("СтоимостьВыпуска",  "РасшифровкаСтоимостьВыпуска");
	ПроверяемыеБлоки.Вставить("СтоимостьИзлишков", "РасшифровкаСтоимостьИзлишков");
	
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	РасшифровкаМакета.Вставить("РасшифровкаСтоимостьДт",       ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаРасходыНаПриобретениеТоваровАмортизируемогоИмуществаРБП"));
	РасшифровкаМакета.Вставить("РасшифровкаСтоимостьНач",      ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаСтоимостьТоваровИАмортизацияНеСписаннаяВПрошлыхПериодах"));
	РасшифровкаМакета.Вставить("РасшифровкаСтоимостьВыпуска",  ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаСтоимостьВыпущеннойПродукции"));
	РасшифровкаМакета.Вставить("РасшифровкаСтоимостьИзлишков", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаОприходованиеИзлишков"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыТовары", 	   ПереходКСхеме(ПараметрыОтчета, 3, СтруктураВП));
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование 	= ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);

КонецПроцедуры

Процедура СформироватьРаспределяемыеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.НоменклатурныеГруппы) КАК Субконто1
	|ПОМЕСТИТЬ ВТНоменклатурныеГруппыЕНВД
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы), Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Субконто1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА (НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.НоменклатурныеГруппы) В
	|					(ВЫБРАТЬ
	|						ВТНоменклатурныеГруппыЕНВД.Субконто1
	|					ИЗ
	|						ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходы20БУ,
	|	ВЫБОР
	|		КОГДА (НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.НоменклатурныеГруппы) В
	|					(ВЫБРАТЬ
	|						ВТНоменклатурныеГруппыЕНВД.Субконто1
	|					ИЗ
	|						ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходы20НУ,
	|	ВЫБОР
	|		КОГДА (НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.НоменклатурныеГруппы) В
	|					(ВЫБРАТЬ
	|						ВТНоменклатурныеГруппыЕНВД.Субконто1
	|					ИЗ
	|						ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходы20ПР,
	|	ВЫБОР
	|		КОГДА (НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.НоменклатурныеГруппы) В
	|					(ВЫБРАТЬ
	|						ВТНоменклатурныеГруппыЕНВД.Субконто1
	|					ИЗ
	|						ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходы20ВР,
	|	0 КАК РаспределяемыеРасходы90БУ,
	|	0 КАК РаспределяемыеРасходы90НУ,
	|	0 КАК РаспределяемыеРасходы90ПР,
	|	0 КАК РаспределяемыеРасходы90ВР,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.НоменклатурныеГруппы) В
	|				(ВЫБРАТЬ
	|					ВТНоменклатурныеГруппыЕНВД.Субконто1
	|				ИЗ
	|					ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходыЕНВДБУ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.НоменклатурныеГруппы) В
	|				(ВЫБРАТЬ
	|					ВТНоменклатурныеГруппыЕНВД.Субконто1
	|				ИЗ
	|					ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходыЕНВДНУ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.НоменклатурныеГруппы) В
	|				(ВЫБРАТЬ
	|					ВТНоменклатурныеГруппыЕНВД.Субконто1
	|				ИЗ
	|					ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходыЕНВДПР,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.НоменклатурныеГруппы) В
	|				(ВЫБРАТЬ
	|					ВТНоменклатурныеГруппыЕНВД.Субконто1
	|				ИЗ
	|					ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РаспределяемыеРасходыЕНВДВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|				И (НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)),
	|			КорСЧет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|				И (НЕ ХозрасчетныйОбороты.КорСубконто1 В
	|						(ВЫБРАТЬ
	|							ВТНоменклатурныеГруппыЕНВД.Субконто1
	|						ИЗ
	|							ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|				И (НЕ ХозрасчетныйОбороты.КорСубконто1 В
	|						(ВЫБРАТЬ
	|							ВТНоменклатурныеГруппыЕНВД.Субконто1
	|						ИЗ
	|							ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|				И (НЕ ХозрасчетныйОбороты.КорСубконто1 В
	|						(ВЫБРАТЬ
	|							ВТНоменклатурныеГруппыЕНВД.Субконто1
	|						ИЗ
	|							ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|				И (НЕ ХозрасчетныйОбороты.КорСубконто1 В
	|						(ВЫБРАТЬ
	|							ВТНоменклатурныеГруппыЕНВД.Субконто1
	|						ИЗ
	|							ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|				И (НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)),
	|			КорСЧет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20БУ + ВТХозрасчетный.РаспределяемыеРасходы90БУ + ВТХозрасчетный.РаспределяемыеРасходыЕНВДБУ) КАК РаспределяемыеРасходыБУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20НУ + ВТХозрасчетный.РаспределяемыеРасходы90НУ + ВТХозрасчетный.РаспределяемыеРасходыЕНВДНУ) КАК РаспределяемыеРасходыНУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ПР + ВТХозрасчетный.РаспределяемыеРасходы90ПР + ВТХозрасчетный.РаспределяемыеРасходыЕНВДПР) КАК РаспределяемыеРасходыПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ВР + ВТХозрасчетный.РаспределяемыеРасходы90ВР + ВТХозрасчетный.РаспределяемыеРасходыЕНВДВР) КАК РаспределяемыеРасходыВР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20БУ) КАК РаспределяемыеРасходы20БУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20НУ) КАК РаспределяемыеРасходы20НУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ПР) КАК РаспределяемыеРасходы20ПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ВР) КАК РаспределяемыеРасходы20ВР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы90БУ) КАК РаспределяемыеРасходы90БУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы90НУ) КАК РаспределяемыеРасходы90НУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы90ПР) КАК РаспределяемыеРасходы90ПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы90ВР) КАК РаспределяемыеРасходы90ВР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходыЕНВДБУ) КАК РаспределяемыеРасходыЕНВДБУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходыЕНВДНУ) КАК РаспределяемыеРасходыЕНВДНУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходыЕНВДПР) КАК РаспределяемыеРасходыЕНВДПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходыЕНВДВР) КАК РаспределяемыеРасходыЕНВДВР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20БУ + ВТХозрасчетный.РаспределяемыеРасходы90БУ) КАК РаспределяемыеРасходыНеЕНВДБУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20НУ + ВТХозрасчетный.РаспределяемыеРасходы90НУ) КАК РаспределяемыеРасходыНеЕНВДНУ,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ПР + ВТХозрасчетный.РаспределяемыеРасходы90ПР) КАК РаспределяемыеРасходыНеЕНВДПР,
	|	СУММА(ВТХозрасчетный.РаспределяемыеРасходы20ВР + ВТХозрасчетный.РаспределяемыеРасходы90ВР) КАК РаспределяемыеРасходыНеЕНВДВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("РаспределяемыеРасходы");
	ПоляСтраницы.Добавить("РаспределяемыеРасходы20");
	ПоляСтраницы.Добавить("РаспределяемыеРасходы90");
	ПоляСтраницы.Добавить("РаспределяемыеРасходыЕНВД");
	ПоляСтраницы.Добавить("РаспределяемыеРасходыНеЕНВД");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(), 
			"РаспределяемыеРасходы", 8, "Распределяемые расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе	
		
		ИмяМакета     = "РасходыРаспределяемые" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, ПоляСтраницы, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("РаспределяемыеРасходы20", 	 "РасшифровкаРаспределяемыеРасходы20");
	ПроверяемыеБлоки.Вставить("РаспределяемыеРасходы90", 	 "РасшифровкаРаспределяемыеРасходы90");
	ПроверяемыеБлоки.Вставить("РаспределяемыеРасходыНеЕНВД", "РасшифровкаРаспределяемыеРасходыНеЕНВД");
	ПроверяемыеБлоки.Вставить("РаспределяемыеРасходыЕНВД",   "РасшифровкаРаспределяемыеРасходыЕНВД");
	ПроверяемыеБлоки.Вставить("РаспределяемыеРасходы",	     "РасшифровкаРаспределяемыеРасходы");
	
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходы20",     ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаОПРиОХРСписанныеНаПрямыеРаспределяемые"));
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходы90",     ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРаспределяемыеРасходыУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходыНеЕНВД", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыНеЕНВД"));
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходыЕНВД",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыЕНВД"));
	РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходы",       ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);
	
КонецПроцедуры

Процедура СформироватьРасходыПроизводства(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.НоменклатурныеГруппы) КАК Субконто1
	|ПОМЕСТИТЬ ВТНоменклатурныеГруппыЕНВД
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыручкаЕНВД)), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы), Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.Субконто1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыВыпускБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыВыпускНУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыВыпускПР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыВыпускВР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыУслугиБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыУслугиНУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыУслугиПР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПрямыеРасходыУслугиВР,
	|	0 КАК ОХРБУ,
	|	0 КАК ОХРНУ,
	|	0 КАК ОХРПР,
	|	0 КАК ОХРВР,
	|	0 КАК ОХРРаспрБУ,
	|	0 КАК ОХРРаспрНУ,
	|	0 КАК ОХРРаспрПР,
	|	0 КАК ОХРРаспрВР,
	|	0 КАК НЗПБУ,
	|	0 КАК НЗПНУ,
	|	0 КАК НЗППР,
	|	0 КАК НЗПВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыпускПродукции)),
	|			,
	|			Организация = &Организация,
	|			(НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОстатки.СуммаКонечныйОстаток,
	|	ХозрасчетныйОстатки.СуммаНУКонечныйОстаток,
	|	ХозрасчетныйОстатки.СуммаПРКонечныйОстаток,
	|	ХозрасчетныйОстатки.СуммаВРКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы),
	|			Организация = &Организация
	|				И (НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.НоменклатурныеГруппы) В
	|						(ВЫБРАТЬ
	|							ВТНоменклатурныеГруппыЕНВД.Субконто1
	|						ИЗ
	|							ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))) КАК ХозрасчетныйОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И (НЕ ВЫРАЗИТЬ(КорСубконто1 КАК Справочник.НоменклатурныеГруппы) В
	|						(ВЫБРАТЬ
	|							ВТНоменклатурныеГруппыЕНВД.Субконто1
	|						ИЗ
	|							ВТНоменклатурныеГруппыЕНВД КАК ВТНоменклатурныеГруппыЕНВД))
	|				И (НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы)) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОстатки.СуммаКонечныйОстаток,
	|	ХозрасчетныйОстатки.СуммаНУКонечныйОстаток,
	|	ХозрасчетныйОстатки.СуммаПРКонечныйОстаток,
	|	ХозрасчетныйОстатки.СуммаВРКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья)), , Организация = &Организация) КАК ХозрасчетныйОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускБУ) КАК ПрямыеРасходыВыпускБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускНУ) КАК ПрямыеРасходыВыпускНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускПР) КАК ПрямыеРасходыВыпускПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускВР) КАК ПрямыеРасходыВыпускВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиБУ) КАК ПрямыеРасходыУслугиБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиНУ) КАК ПрямыеРасходыУслугиНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиПР) КАК ПрямыеРасходыУслугиПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыУслугиВР) КАК ПрямыеРасходыУслугиВР,
	|	СУММА(ВТХозрасчетный.ОХРБУ) КАК ОХРБУ,
	|	СУММА(ВТХозрасчетный.ОХРНУ) КАК ОХРНУ,
	|	СУММА(ВТХозрасчетный.ОХРПР) КАК ОХРПР,
	|	СУММА(ВТХозрасчетный.ОХРВР) КАК ОХРВР,
	|	СУММА(ВТХозрасчетный.ОХРРаспрБУ) КАК ОХРРаспрБУ,
	|	СУММА(ВТХозрасчетный.ОХРРаспрНУ) КАК ОХРРаспрНУ,
	|	СУММА(ВТХозрасчетный.ОХРРаспрПР) КАК ОХРРаспрПР,
	|	СУММА(ВТХозрасчетный.ОХРРаспрВР) КАК ОХРРаспрВР,
	|	СУММА(ВТХозрасчетный.НЗПБУ) КАК НЗПБУ,
	|	СУММА(ВТХозрасчетный.НЗПНУ) КАК НЗПНУ,
	|	СУММА(ВТХозрасчетный.НЗППР) КАК НЗППР,
	|	СУММА(ВТХозрасчетный.НЗПВР) КАК НЗПВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускБУ + ВТХозрасчетный.ПрямыеРасходыУслугиБУ + ВТХозрасчетный.НЗПБУ) КАК ПрямыеРасходыБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускНУ + ВТХозрасчетный.ПрямыеРасходыУслугиНУ + ВТХозрасчетный.НЗПНУ) КАК ПрямыеРасходыНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускПР + ВТХозрасчетный.ПрямыеРасходыУслугиПР + ВТХозрасчетный.НЗППР) КАК ПрямыеРасходыПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускВР + ВТХозрасчетный.ПрямыеРасходыУслугиВР + ВТХозрасчетный.НЗПВР) КАК ПрямыеРасходыВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускБУ + ВТХозрасчетный.ПрямыеРасходыУслугиБУ + ВТХозрасчетный.НЗПБУ - ВТХозрасчетный.ОХРБУ - ВТХозрасчетный.ОХРРаспрБУ) КАК ПроизводствоБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускНУ + ВТХозрасчетный.ПрямыеРасходыУслугиНУ + ВТХозрасчетный.НЗПНУ - ВТХозрасчетный.ОХРНУ - ВТХозрасчетный.ОХРРаспрНУ) КАК ПроизводствоНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускПР + ВТХозрасчетный.ПрямыеРасходыУслугиПР + ВТХозрасчетный.НЗППР - ВТХозрасчетный.ОХРПР - ВТХозрасчетный.ОХРРаспрПР) КАК ПроизводствоПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыВыпускВР + ВТХозрасчетный.ПрямыеРасходыУслугиВР + ВТХозрасчетный.НЗПВР - ВТХозрасчетный.ОХРВР - ВТХозрасчетный.ОХРРаспрВР) КАК ПРоизводствоВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("ПрямыеРасходыВыпуск");
	ПоляСтраницы.Добавить("ПрямыеРасходыУслуги");
	ПоляСтраницы.Добавить("ОХР");
	ПоляСтраницы.Добавить("ОХРРаспр");
	ПоляСтраницы.Добавить("НЗП");
	ПоляСтраницы.Добавить("ПрямыеРасходы");
	ПоляСтраницы.Добавить("Производство");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"ПрямыеРасходы", 4, "Расходы производства", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ЭтоЕНВД       = УчетнаяПолитика.ПлательщикЕНВД(ПараметрыОтчета.ОрганизацияРасшифровки, ПараметрыОтчета.КонецПериода);
		ИмяМакета     = ?(ЭтоЕНВД, "РасходыПроизводстваЕНВД", "РасходыПроизводства") + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, ПоляСтраницы, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);

	ПроверяемыеБлоки = Новый Структура;
	
	ПроверяемыеБлоки.Вставить("ПрямыеРасходыУслуги", "ПрямыеРасходыУслуги");
	ПроверяемыеБлоки.Вставить("ПрямыеРасходыВыпуск", "РасшифровкаАктивы");
	ПроверяемыеБлоки.Вставить("НЗП",                 "РасшифровкаНЗП");
	ПроверяемыеБлоки.Вставить("Производство",        "РасшифровкаРасходыОбычные");
	ПроверяемыеБлоки.Вставить("ОХР",                 "РасшифровкаКосвенныеРасходы");
	ПроверяемыеБлоки.Вставить("ПрямыеРасходы",       "Расходы");
	
	Если ЭтоЕНВД Тогда
		ПроверяемыеБлоки.Вставить("ОХРРаспр", "РасшифровкаРаспределяемыеРасходы");
	КонецЕсли;
	
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	Если ЭтоЕНВД Тогда
		РасшифровкаМакета.Вставить("РасшифровкаРаспределяемыеРасходы", ПереходКСхеме(ПараметрыОтчета, 8, СтруктураВП))
	КонецЕсли;
	
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходы", ПереходКСхеме(ПараметрыОтчета, 6,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыОбычные",   ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	РасшифровкаМакета.Вставить("ПрямыеРасходыУслуги", 	      ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрямыеРасходыПоРеализованнымУслугам"));
	РасшифровкаМакета.Вставить("РасшифровкаАктивы",           ПереходКСхеме(ПараметрыОтчета, 9,  СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаНЗП",              ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаНезавершенноеПроизводство"));
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);
	
КонецПроцедуры

Процедура СформироватьРасходыПоТоварам(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК АктивыКонБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстаток КАК АктивыКонНУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРКонечныйОстаток КАК АктивыКонПР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРКонечныйОстаток КАК АктивыКонВР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК АктивыКтБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУОборотКт КАК АктивыКтНУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРОборотКт КАК АктивыКтПР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРОборотКт КАК АктивыКтВР,
	|	0 КАК ПрямыеРасходыТоварыБУ,
	|	0 КАК ПрямыеРасходыТоварыНУ,
	|	0 КАК ПрямыеРасходыТоварыПР,
	|	0 КАК ПрямыеРасходыТоварыВР,
	|	0 КАК ПрямыеРасходыТоварыЕНВДБУ,
	|	0 КАК ПрямыеРасходыТоварыЕНВДНУ,
	|	0 КАК ПрямыеРасходыТоварыЕНВДПР,
	|	0 КАК ПрямыеРасходыТоварыЕНВДВР,
	|	0 КАК ПрямыеРасходыОСБУ,
	|	0 КАК ПрямыеРасходыОСНУ,
	|	0 КАК ПрямыеРасходыОСПР,
	|	0 КАК ПрямыеРасходыОСВР,
	|	0 КАК ПрямыеРасходыТоварыНЕБУ,
	|	0 КАК ПрямыеРасходыТоварыНЕНУ,
	|	0 КАК ПрямыеРасходыТоварыНЕПР,
	|	0 КАК ПрямыеРасходыТоварыНЕВР,
	|	0 КАК ПрямыеРасходыДтБУ,
	|	0 КАК ПрямыеРасходыДтНУ,
	|	0 КАК ПрямыеРасходыДтПР,
	|	0 КАК ПрямыеРасходыДтВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости)),
	|			,
	|			Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости)),
	|			,
	|			Организация = &Организация,
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы))
	|				И НЕ КОрСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|				И НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОсновныхСредств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияНематериальныхАктивов), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравКромеПраваТребования), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияИмущественныхПравПоОбъектамОбслуживающихПроизводствИХозяйств), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияДоНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияПослеНаступленияСрокаПлатежа), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПраваТребованияКакОказанияФинансовыхУслуг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияПрочегоИмущества), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияЦенныхБумаг), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.РеализацияОбъектовСтроительства), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделок), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ОперацииСФинансовымиИнструментамиСрочныхСделокОР), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.СдачаИмуществаВАрендуИлиСубаренду), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате), ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУКорОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРКорОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ПринятиеКналоговомуУчету
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости)),
	|			,
	|			Организация = &Организация,
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы)) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД))
	|				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьПродажЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.КорСубконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОборудованиеКУстановке), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Материалы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Полуфабрикаты), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыНаСкладах), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговле), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТараПодТоваромИПорожняя), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеИзделия), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаАТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТорговаяНаценкаНТТ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ГотоваяПродукция), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыБудущихПериодов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПлатежиПоПрочимВидамСтрахования))
	|				ИЛИ Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОсновныхСредств), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НематериальныеАктивы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости)),
	|			,
	|			Организация = &Организация,
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат)) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыБУ + ВТХозрасчетный.ПрямыеРасходыТоварыЕНВДБУ + ВТХозрасчетный.ПрямыеРасходыОСБУ + ВТХозрасчетный.ПрямыеРасходыТоварыНЕБУ + ВТХозрасчетный.АктивыКонБУ + ВТХозрасчетный.ПрямыеРасходыДтБУ) КАК АктивыБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНУ + ВТХозрасчетный.ПрямыеРасходыТоварыЕНВДНУ + ВТХозрасчетный.ПрямыеРасходыОСНУ + ВТХозрасчетный.ПрямыеРасходыТоварыНЕНУ + ВТХозрасчетный.АктивыКонНУ + ВТХозрасчетный.ПрямыеРасходыДтНУ) КАК АктивыНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыПР + ВТХозрасчетный.ПрямыеРасходыТоварыЕНВДПР + ВТХозрасчетный.ПрямыеРасходыОСПР + ВТХозрасчетный.ПрямыеРасходыТоварыНЕПР + ВТХозрасчетный.АктивыКонПР + ВТХозрасчетный.ПрямыеРасходыДтПР) КАК АктивыПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыВР + ВТХозрасчетный.ПрямыеРасходыТоварыЕНВДВР + ВТХозрасчетный.ПрямыеРасходыОСВР + ВТХозрасчетный.ПрямыеРасходыТоварыНЕВР + ВТХозрасчетный.АктивыКонВР + ВТХозрасчетный.ПрямыеРасходыДтВР) КАК АктивыВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыБУ) КАК ПрямыеРасходыТоварыБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНУ) КАК ПрямыеРасходыТоварыНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыПР) КАК ПрямыеРасходыТоварыПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыВР) КАК ПрямыеРасходыТоварыВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыЕНВДБУ) КАК ПрямыеРасходыТоварыЕНВДБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыЕНВДНУ) КАК ПрямыеРасходыТоварыЕНВДНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыЕНВДПР) КАК ПрямыеРасходыТоварыЕНВДПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыЕНВДВР) КАК ПрямыеРасходыТоварыЕНВДВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыОСБУ) КАК ПрямыеРасходыОСБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыОСНУ) КАК ПрямыеРасходыОСНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыОСПР) КАК ПрямыеРасходыОСПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыОСВР) КАК ПрямыеРасходыОСВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНЕБУ) КАК ПрямыеРасходыТоварыНЕБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНЕНУ) КАК ПрямыеРасходыТоварыНЕНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНЕПР) КАК ПрямыеРасходыТоварыНЕПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыТоварыНЕВР) КАК ПрямыеРасходыТоварыНЕВР,
	|	СУММА(ВТХозрасчетный.АктивыКонБУ) КАК АктивыКонБУ,
	|	СУММА(ВТХозрасчетный.АктивыКонНУ) КАК АктивыКонНУ,
	|	СУММА(ВТХозрасчетный.АктивыКонПР) КАК АктивыКонПР,
	|	СУММА(ВТХозрасчетный.АктивыКонВР) КАК АктивыКонВР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыДтБУ) КАК ПрямыеРасходыДтБУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыДтНУ) КАК ПрямыеРасходыДтНУ,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыДтПР) КАК ПрямыеРасходыДтПР,
	|	СУММА(ВТХозрасчетный.ПрямыеРасходыДтВР) КАК ПрямыеРасходыДтВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("Активы");
	ПоляСтраницы.Добавить("ПрямыеРасходыТовары");
	ПоляСтраницы.Добавить("ПрямыеРасходыТоварыЕНВД");
	ПоляСтраницы.Добавить("ПрямыеРасходыОС");
	ПоляСтраницы.Добавить("ПрямыеРасходыТоварыНЕ");
	ПоляСтраницы.Добавить("АктивыКон");
	ПоляСтраницы.Добавить("ПрямыеРасходыДт");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"Активы", 3, "Стоимость активов", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ЭтоЕНВД       = УчетнаяПолитика.ПлательщикЕНВД(ПараметрыОтчета.ОрганизацияРасшифровки, ПараметрыОтчета.КонецПериода);
		ИмяМакета     = ?(ЭтоЕНВД, "СтоимостьСписанияТоваровЕНВД", "СтоимостьСписанияТоваров") + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, ПоляСтраницы, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;

	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("ПрямыеРасходыТовары",   "РасшифровкаПрямыеРасходыТовары");
	ПроверяемыеБлоки.Вставить("ПрямыеРасходыОС",       "РасшифровкаПрямыеРасходыОС");
	ПроверяемыеБлоки.Вставить("ПрямыеРасходыДт",       "РасшифровкаПрямыеРасходыДт");
	ПроверяемыеБлоки.Вставить("Активы",                "РасшифровкаАктивы");
	ПроверяемыеБлоки.Вставить("ПрямыеРасходыТоварыНЕ", "РасшифровкаПрямыеРасходыТоварыНЕ");
	ПроверяемыеБлоки.Вставить("АктивыКон",             "РасшифровкаАктивыКон");
	Если ЭтоЕНВД Тогда
		ПроверяемыеБлоки.Вставить("ПрямыеРасходыТоварыЕНВД", "РасшифровкаПрямыеРасходыТоварыЕНВД");
	КонецЕсли;
	
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	РасшифровкаМакета.Вставить("РасшифровкаПрямыеРасходыОС",       ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаРасходыОтносящиесяКСтоимостиРеализованногоИмущества"));
	РасшифровкаМакета.Вставить("РасшифровкаПрямыеРасходыТовары",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрямыеРасходыПоРеализованнымТоварамУчНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаАктивыКон",             ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаСтоимостьНеСписанныхТоваровРБПАмортизируемогоИмущества"));
	РасшифровкаМакета.Вставить("РасшифровкаПрямыеРасходыТоварыНЕ", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрямыеРасходыПоРеализованнымТоварамНеУчНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаПрямыеРасходыДт",       ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаАмортизацияРБПТоварыНеРеализация"));
	
	Если ЭтоЕНВД Тогда
		
		РасшифровкаМакета.Вставить("РасшифровкаПрямыеРасходыТоварыЕНВД", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаПрямыеРасходыЕНВД"));
		
	КонецЕсли;
	
	РасшифровкаМакета.Вставить("РасшифровкаАктивы", ПереходКСхеме(ПараметрыОтчета, 9, СтруктураВП));
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);
	
КонецПроцедуры

Процедура СформироватьТранспортныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",   ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК ТранспортныеРасходыБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстатокДт КАК ТранспортныеРасходыНУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстатокДт КАК ТранспортныеРасходыПР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстатокДт КАК ТранспортныеРасходыВР,
	|	0 КАК ТранспортныеРасходыСписБУ,
	|	0 КАК ТранспортныеРасходыСписНУ,
	|	0 КАК ТранспортныеРасходыСписПР,
	|	0 КАК ТранспортныеРасходыСписВР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК ТранспортныеРасходыОстБУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстатокДт КАК ТранспортныеРасходыОстНУ,
	|	ХозрасчетныйОстаткиИОбороты.СуммаПРКонечныйОстатокДт КАК ТранспортныеРасходыОстПР,
	|	ХозрасчетныйОстаткиИОбороты.СуммаВРКонечныйОстатокДт КАК ТранспортныеРасходыОстВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИздержкиОбращения)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотКт,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИздержкиОбращения)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения)
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы),
	|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД)),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыБУ) КАК ТранспортныеРасходыБУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыНУ) КАК ТранспортныеРасходыНУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыПР) КАК ТранспортныеРасходыПР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыВР) КАК ТранспортныеРасходыВР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыСписБУ) КАК ТранспортныеРасходыСписБУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыСписНУ) КАК ТранспортныеРасходыСписНУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыСписПР) КАК ТранспортныеРасходыСписПР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыСписВР) КАК ТранспортныеРасходыСписВР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыОстБУ) КАК ТранспортныеРасходыОстБУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыОстНУ) КАК ТранспортныеРасходыОстНУ,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыОстПР) КАК ТранспортныеРасходыОстПР,
	|	СУММА(ВТХозрасчетный.ТранспортныеРасходыОстВР) КАК ТранспортныеРасходыОстВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	ПоляСтраницы = Новый Массив;
	ПоляСтраницы.Добавить("ТранспортныеРасходы");
	ПоляСтраницы.Добавить("ТранспортныеРасходыСпис");
	ПоляСтраницы.Добавить("ТранспортныеРасходыОст");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, ПоляСтраницы, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"ТранспортныеРасходы", 5, "Транспортные расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе	
		
		ИмяМакета     = "ТранспортныеРасходы" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, ПоляСтраницы, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("ТранспортныеРасходыСпис", "РасшифровкаТранспортныеРасходыСпис");
	ПроверяемыеБлоки.Вставить("ТранспортныеРасходы", 	 "РасшифровкаРасходыОбычные");
	ПроверяемыеБлоки.Вставить("ТранспортныеРасходыОст",  "РасшифровкаТранспортныеРасходыОст");
	
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	РасшифровкаМакета.Вставить("РасшифровкаТранспортныеРасходыСпис", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаТранспортныхРасходовУчитываемыхВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаТранспортныеРасходыОст",  ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаТранспортныхРасходовОтнесенныхНаОстаток"));
	РасшифровкаМакета.Вставить("РасшифровкаРасходыОбычные",          ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);
	
КонецПроцедуры

Процедура СформироватьКосвенныеРасходы(ПараметрыОтчета, ДокументРезультат, ДокументСхемы, КэшПараметровОтчета)
	
	СтруктураВП	= КэшПараметровОтчета.СтруктураВП;
	
	РасшифровкаМакета = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",       ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",        КонецДня(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("НачалоГода",          ПараметрыОтчета.НачалоГода);
	Запрос.УстановитьПараметр("Организация",         ПараметрыОтчета.ОрганизацияРасшифровки);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыУчБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыУчНУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыУчПР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И НЕ ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыУчВР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыНеБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыНеНУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыНеПР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД))
	|				И ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения)
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыНеВР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|			ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыСписБУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|			ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыСписНУ,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|			ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыСписПР,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство_), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства))
	|				И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу))
	|			ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КосвенныеРасходыСписВР,
	|	0 КАК КосвенныеРасходыОстБУ,
	|	0 КАК КосвенныеРасходыОстНУ,
	|	0 КАК КосвенныеРасходыОстПР,
	|	0 КАК КосвенныеРасходыОстВР
	|ПОМЕСТИТЬ ВТХозрасчетный
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВспомогательныеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбслуживающиеПроизводства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|				И НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы),
	|			,
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Организация,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
	|	ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
	|	ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
	|	ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоГода,
	|			&КонецПериода,
	|			,
	|			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщехозяйственныеРасходы), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаПродажу)),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат),
	|			Организация = &Организация
	|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|				И НЕ ВЫРАЗИТЬ(Субконто1 КАК Справочник.СтатьиЗатрат).ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.ТранспортныеРасходы),
	|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НераспределеннаяПрибыль)),
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТХозрасчетный.Организация КАК Организация,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчБУ) КАК КосвенныеРасходыУчБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчНУ) КАК КосвенныеРасходыУчНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчПР) КАК КосвенныеРасходыУчПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчВР) КАК КосвенныеРасходыУчВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеБУ) КАК КосвенныеРасходыНеБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеНУ) КАК КосвенныеРасходыНеНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеПР) КАК КосвенныеРасходыНеПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыНеВР) КАК КосвенныеРасходыНеВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыСписБУ) КАК КосвенныеРасходыСписБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыСписНУ) КАК КосвенныеРасходыСписНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыСписПР) КАК КосвенныеРасходыСписПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыСписВР) КАК КосвенныеРасходыСписВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыОстБУ) КАК КосвенныеРасходыОстБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыОстНУ) КАК КосвенныеРасходыОстНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыОстПР) КАК КосвенныеРасходыОстПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыОстВР) КАК КосвенныеРасходыОстВР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчБУ + ВТХозрасчетный.КосвенныеРасходыНеБУ + ВТХозрасчетный.КосвенныеРасходыСписБУ + ВТХозрасчетный.КосвенныеРасходыОстБУ) КАК КосвенныеРасходыБУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчНУ + ВТХозрасчетный.КосвенныеРасходыНеНУ + ВТХозрасчетный.КосвенныеРасходыСписНУ + ВТХозрасчетный.КосвенныеРасходыОстНУ) КАК КосвенныеРасходыНУ,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчПР + ВТХозрасчетный.КосвенныеРасходыНеПР + ВТХозрасчетный.КосвенныеРасходыСписПР + ВТХозрасчетный.КосвенныеРасходыОстПР) КАК КосвенныеРасходыПР,
	|	СУММА(ВТХозрасчетный.КосвенныеРасходыУчВР + ВТХозрасчетный.КосвенныеРасходыНеВР + ВТХозрасчетный.КосвенныеРасходыСписВР + ВТХозрасчетный.КосвенныеРасходыОстВР) КАК КосвенныеРасходыВР
	|ИЗ
	|	ВТХозрасчетный КАК ВТХозрасчетный
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТХозрасчетный.Организация";
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(ПараметрыОтчета.ОрганизацияРасшифровки);
		Запрос.УстановитьПараметр("Организация", СписокОП);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		
	КонецЕсли;
	
	НаборыПолей = Новый Массив;
	НаборыПолей.Добавить("КосвенныеРасходыУч");
	НаборыПолей.Добавить("КосвенныеРасходыНе");
	НаборыПолей.Добавить("КосвенныеРасходыСпис");
	НаборыПолей.Добавить("КосвенныеРасходыОст");
	НаборыПолей.Добавить("КосвенныеРасходы");
	
	НастроитьПоляРазницТекстаЗапроса(Запрос.Текст, НаборыПолей, ПараметрыОтчета);
	
	Результат = Запрос.Выполнить();
	
	Если СтруктураВП.НомерТекущейСхемы > 20 Тогда
		
		СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат.Выгрузить(),
			"КосвенныеРасходы", 6, "Косвенные расходы", КэшПараметровОтчета);
		Возврат;
		
	Иначе
		
		ИмяМакета     = "КосвенныеРасходы" + ПараметрыОтчета.СуффиксСхемы;
		ДокументСхемы = ГрафическаяСхемаОтчета(ИмяМакета, НаборыПолей, ПараметрыОтчета);
		ЭлементыСхемы = ДокументСхемы.ЭлементыГрафическойСхемы;
		
	КонецЕсли;
	
	ПоказателиСтраницы = ПоказателиСтраницы(Результат);
	УстановитьПоказатели(ДокументСхемы, ПоказателиСтраницы);
	
	ПроверяемыеБлоки = Новый Структура;
	ПроверяемыеБлоки.Вставить("КосвенныеРасходыУч",	  "РасшифровкаКосвенныеРасходыУч");
	ПроверяемыеБлоки.Вставить("КосвенныеРасходыНе",	  "РасшифровкаКосвенныеРасходыНЕ");
	ПроверяемыеБлоки.Вставить("КосвенныеРасходыСпис", "РасшифровкаКосвенныеРасходыСпис");
	ПроверяемыеБлоки.Вставить("КосвенныеРасходыОст",  "РасшифровкаКосвенныеРасходыОст");
	ПроверяемыеБлоки.Вставить("КосвенныеРасходы",     "РасшифровкаРасходыОбычные");
	
	ПодсветитьРасхождения(ЭлементыСхемы, ПоказателиСтраницы, ПроверяемыеБлоки, ПараметрыОтчета);
	
	РасшифровкаМакета.Вставить("РасшифровкаРасходыОбычные",       ПереходКСхеме(ПараметрыОтчета, 10, СтруктураВП));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходыУч",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходыНе",   ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыНеУчитываемыеВНУ"));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходыСпис", ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаОПРиОХРСписанныеНаПрямые"));
	РасшифровкаМакета.Вставить("РасшифровкаКосвенныеРасходыОст",  ПереходКРасшифровкеСхемы(ПараметрыОтчета, "РасшифровкаКосвенныеРасходыНеВкл"));
	
	ЭлементыСхемы.НазваниеОрганизации.Наименование = ЗаголовокОтчета(ПараметрыОтчета);
	
	// Сохраняем историю
	СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета);
	
КонецПроцедуры

Процедура СформироватьТаблицуОрганизаций(ПараметрыОтчета, ДокументРезультат, Результат, НазваниеПараметра, НомерСхемы, НазваниеОтчета, КэшПараметровОтчета)
	
	СтруктураВП = КэшПараметровОтчета.СтруктураВП;
	
	ДокументРезультат.Очистить();
	
	Макет      		 = ПолучитьМакет("СписокОрганизаций");
	ОбластьОтчета    = Макет.ПолучитьОбласть("Область");
	ЗаголовокОтчета  = Макет.ПолучитьОбласть("Заголовок");
	ПодвалОтчета     = Макет.ПолучитьОбласть("Подвал");
	
	
	ЗаголовокОтчета.Параметры.НазваниеОрганизации = ЗаголовокОтчета(ПараметрыОтчета);
	ЗаголовокОтчета.Параметры.НазваниеОтчета 	  = НазваниеОтчета;
	
	ДокументРезультат.Вывести(ЗаголовокОтчета);
	
	ПостфиксыСумм = СтрРазделить("БУ,НУ,ПР,ВР", ",");
	ПоляСумм = Новый Структура;
	Для Каждого Постфикс Из ПостфиксыСумм Цикл
		ИмяПоляРезультат = НазваниеПараметра + Постфикс;
		Если Результат.Колонки.Найти(ИмяПоляРезультат) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ИмяПоляПараметры = "Сумма" + Постфикс;
		ПоляСумм.Вставить(ИмяПоляПараметры, ИмяПоляРезультат);
	КонецЦикла;
	
	Для Каждого Выборка ИЗ Результат Цикл
		
		ОбластьОтчета.Параметры.Текст = Выборка.Организация;
		
		ОбластьОтчета.Параметры.Контроль = 0;
		Для Каждого ОписаниеПоля Из ПоляСумм Цикл
			Сумма = Выборка[ОписаниеПоля.Значение];
			ОбластьОтчета.Параметры[ОписаниеПоля.Ключ] = Сумма;
			Если ОписаниеПоля.Ключ = "СуммаБУ" Тогда
				СлагаемоеКонтроль = Сумма;
			Иначе
				СлагаемоеКонтроль = -Сумма;
			КонецЕсли;
			ОбластьОтчета.Параметры.Контроль = ОбластьОтчета.Параметры.Контроль + СлагаемоеКонтроль;
		КонецЦикла;
		
		ОбластьОтчета.Параметры.СхемаРасшифровки = ПереходКСхеме(ПараметрыОтчета, НомерСхемы, СтруктураВП, Ложь, Выборка.Организация);
		
		ДокументРезультат.Вывести(ОбластьОтчета);
		
	КонецЦикла;
	
	Для Каждого ОписаниеПоля Из ПоляСумм Цикл
		ПодвалОтчета.Параметры[ОписаниеПоля.Ключ] = Результат.Итог(ОписаниеПоля.Значение);
	КонецЦикла;
	
	ДокументРезультат.Вывести(ПодвалОтчета);
	ДокументРезультат.КлючПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Вывести(ДокументРезультат);
	
	КэшМакета 	= Новый Структура;
	КэшМакета.Вставить("РасшифровкаМакета", Неопределено);
	КэшМакета.Вставить("ЭтоСхема",          Ложь);
	КэшМакета.Вставить("Макет",	            ТабличныйДокумент);
	КэшМакетов 	= КэшПараметровОтчета.КэшМакетов;
	
	КэшМакетов.Вставить("Макет_" + СтруктураВП.НомерТекущейСхемы, КэшМакета);
	КэшПараметровОтчета.Вставить("КэшМакетов", КэшМакетов);
	
КонецПроцедуры

Функция ПереходКСхеме(ПараметрыОтчета, НомерСхемы, СтруктураВП, УчитыватьОП = Ложь, ОрганизацияОП = Неопределено)

	РасшифровкаТек = Новый Соответствие;
	РасшифровкаТек.Вставить("Организация", 		 ?(ОрганизацияОП = Неопределено, ПараметрыОтчета.ОрганизацияРасшифровки, ОрганизацияОП));
	РасшифровкаТек.Вставить("НомерТекущейСхемы", НомерСхемы + ?(ПараметрыОтчета.ВключатьОбособленныеПодразделения и УчитыватьОП, 20,0));
	РасшифровкаТек.Вставить("ВидРасшифровки", 	 "Схема");
	
	Возврат РасшифровкаТек;

КонецФункции

Функция ПереходКРасшифровкеСхемы(ПараметрыОтчета, ИдентификаторРасшифровки)
	
	РасшифровкаСхемы = Новый Соответствие;
 	РасшифровкаСхемы.Вставить("ВидРасшифровки",    "Расшифровка");
	РасшифровкаСхемы.Вставить("Организация", 	   ПараметрыОтчета.ОрганизацияРасшифровки);
	РасшифровкаСхемы.Вставить("НомерТекущейСхемы", ИдентификаторРасшифровки);
	
	Возврат РасшифровкаСхемы;
	
КонецФункции

Процедура СохранитьИсториюРасшифровок(КэшПараметровОтчета, ИмяМакета, РасшифровкаМакета)
	
	КэшМакета 	= Новый Структура;
	КэшМакета.Вставить("РасшифровкаМакета", РасшифровкаМакета);
	КэшМакета.Вставить("Макет",             ИмяМакета);
	КэшМакета.Вставить("ЭтоСхема",          Истина);
	
	КэшПараметровОтчета.КэшМакетов.Вставить("Макет_" + КэшПараметровОтчета.СтруктураВП.НомерТекущейСхемы, КэшМакета);
	
КонецПроцедуры

Функция ЗаголовокОтчета(ПараметрыОтчета, Сноска = Ложь)
	
	ПредставлениеПериода = ПараметрыОтчета.ПредставлениеПериода;
	Если Сноска Тогда
		// Не все макеты поддерживают вывод сносок
		СправкиРасчеты.ДополнитьПериодОтчетаПримечанием(ПредставлениеПериода, ПараметрыОтчета);
	КонецЕсли;
	
	Возврат СправкиРасчетыКлиентСервер.ТекстЗаголовка(
		"",
		ПредставлениеПериода,
		ПараметрыОтчета.ПредставлениеОрганизации);
	
КонецФункции

#Область ВозвратыПрошлыхЛет

Функция ПрибыльУбытокВозвратыПрошлыхЛет(НачалоПериода, КонецПериода, Организация, ВсяОрганизация)
	
	ПрибыльУбыток = Новый Структура;
	ПрибыльУбыток.Вставить("Прибыль", 0);
	ПрибыльУбыток.Вставить("Убыток",  0);
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",  НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",   КонецПериода);
	Запрос.УстановитьПараметр("ВсяОрганизация", ВсяОрганизация);
	УстановитьПараметрыСчетаВыручкиСебестоимости(Запрос, КонецПериода, Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеДоходыИРасходы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СтатьиПрибылиУбыткиПрошлыхЛет
	|ИЗ
	|	Справочник.ПрочиеДоходыИРасходы КАК ПрочиеДоходыИРасходы
	|ГДЕ
	|	ПрочиеДоходыИРасходы.ВидПрочихДоходовИРасходов = ЗНАЧЕНИЕ(Перечисление.ВидыПрочихДоходовИРасходов.ПрибыльУбытокПрошлыхЛет)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Прибыли.СуммаНУОборотКт), 0) КАК Прибыль,
	|	0 КАК Убыток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт В (&СчетаСебестоимостьПродаж),
	|			,
	|			СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДоходы),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			Организация В (&ВсяОрганизация)
	|				И СубконтоКт1 В
	|					(ВЫБРАТЬ
	|						СтатьиПрибылиУбыткиПрошлыхЛет.Ссылка
	|					ИЗ
	|						СтатьиПрибылиУбыткиПрошлыхЛет)) КАК Прибыли
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	ЕСТЬNULL(СУММА(Убытки.СуммаНУОборотДт), 0)
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеРасходы),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы),
	|			СчетКт В (&СчетаВыручка),
	|			,
	|			Организация В (&ВсяОрганизация)
	|				И СубконтоДт1 В
	|					(ВЫБРАТЬ
	|						СтатьиПрибылиУбыткиПрошлыхЛет.Ссылка
	|					ИЗ
	|						СтатьиПрибылиУбыткиПрошлыхЛет)) КАК Убытки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПрибыльУбыток.Прибыль = ПрибыльУбыток.Прибыль + Выборка.Прибыль;
		ПрибыльУбыток.Убыток  = ПрибыльУбыток.Убыток  + Выборка.Убыток;
	КонецЦикла;
	
	Возврат ПрибыльУбыток;
	
КонецФункции

Функция ПараметрыЗапросаСчетаВыручкиСебестоимости(Период, Организация)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("СчетаВыручка",             Новый Массив);
	ПараметрыЗапроса.Вставить("СчетаСебестоимостьПродаж", Новый Массив);
	
	Счета = НалоговыйУчет.СчетаВыручкиСебестоимости(Период, Организация);
	
	Для Каждого ОписаниеСчета Из Счета.Выручка Цикл
		ПараметрыЗапроса.СчетаВыручка.Добавить(ОписаниеСчета.Ключ);
	КонецЦикла;
	
	Для Каждого ОписаниеСчета Из Счета.СебестоимостьПродаж Цикл
		ПараметрыЗапроса.СчетаСебестоимостьПродаж.Добавить(ОписаниеСчета.Ключ);
	КонецЦикла;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Процедура УстановитьПараметрыСчетаВыручкиСебестоимости(Запрос, Период, Организация)
	
	ПараметрыЗапроса = ПараметрыЗапросаСчетаВыручкиСебестоимости(Период, Организация);
	
	Для Каждого ОписаниеПараметра Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ОписаниеПараметра.Ключ, ОписаниеПараметра.Значение);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПараметрыРасшифровкиСчетаВыручкиСебестоимости(ПараметрыДанных, СхемаКомпоновкиДанных, Период, Организация)
	
	Если СхемаКомпоновкиДанных.Параметры.Найти("СчетаВыручка") = Неопределено
		И СхемаКомпоновкиДанных.Параметры.Найти("СчетаСебестоимостьПродаж") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ПараметрыЗапросаСчетаВыручкиСебестоимости(Период, Организация);
	
	Для Каждого ОписаниеПараметра Из ПараметрыЗапроса Цикл
		
		ПараметрКомпоновкиДанных = ПараметрыДанных.Элементы.Найти(ОписаниеПараметра.Ключ);
		
		Если ПараметрКомпоновкиДанных = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеПараметра = Новый СписокЗначений;
		ЗначениеПараметра.ЗагрузитьЗначения(ОписаниеПараметра.Значение);
		ПараметрыДанных.УстановитьЗначениеПараметра(ОписаниеПараметра.Ключ, ЗначениеПараметра);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаГрафическихСхем

Функция ГрафическаяСхемаОтчета(ИмяМакета, НаборыПолей, ПараметрыОтчета)
	
	ГрафическаяСхема = ПолучитьМакет(ИмяМакета);
	
	Если УчетПостоянныхРазниц(ПараметрыОтчета) Тогда
		Возврат ГрафическаяСхема;
	КонецЕсли;
	
	// Заменим картинки. Это можно сделать, сериализовав схему в XDTO
	ГрафическаяСхемаXDTO = СериализаторXDTO.ЗаписатьXDTO(ГрафическаяСхема);
	
	// Суммы ВР прячем - закрываем заглушками
	УстановитьЗаглушки = Новый Структура;
	Для Каждого ИмяНабора Из НаборыПолей Цикл
		УстановитьЗаглушки.Вставить(ИмяНабора + "ВР");
	КонецЦикла;
	
	ОтступПоГоризонтали = 2;
	ОтступПоВертикали   = 2;
	
	ЛишняяШирина = 5;
	ЛишняяВысота = 5;
	
	ГрафическаяСхемаXDTO = СериализаторXDTO.ЗаписатьXDTO(ГрафическаяСхема);
	
	Для Каждого Элемент Из ГрафическаяСхемаXDTO.item Цикл
		
		Если Не УстановитьЗаглушки.Свойство(Элемент.itemCode) Тогда
			Продолжить;
		КонецЕсли;
		
		Заглушка = Картинка("ЗаглушкаВР");// переиспользовать объект XDTO нельзя, каждый раз создаем из макета
		Элемент.Установить("picture",          Заглушка);
		Элемент.Установить("picturePlacement", ПоложениеКартинкиЭлементаГрафическойСхемы.Центр);
		
		Элемент.Установить("rectLeft",         Элемент.rectLeft - ОтступПоГоризонтали);
		Элемент.Установить("rectTop",          Элемент.rectTop  - ОтступПоВертикали);
		
		Элемент.Установить("rectRight",        Элемент.rectLeft + Заглушка.tx - ЛишняяШирина);
		Элемент.Установить("rectBottom",       Элемент.rectTop  + Заглушка.ty - ЛишняяВысота);
		
	КонецЦикла;
	
	// В качестве легенды набора сумм выводим "сокращенную" версию - только про БУ и НУ, без разниц
	КартинкаЛегенда = Картинка("ЛегендаБухгалтерскийНалоговыйУчет");
	Декорация = ДекорацияЛегендаЦветныеБлоки(ГрафическаяСхема, ГрафическаяСхемаXDTO, ИмяМакета);
	Если Декорация <> Неопределено Тогда
		Декорация.Установить("picture", КартинкаЛегенда);
	КонецЕсли;
	
	// В качестве легенды расхождений выводим описание суммы ПР
	КартинкаЛегенда = Картинка("ПодсветкаРазличия");
	Декорация = ДекорацияПодсветкаРазличия(ГрафическаяСхема, ГрафическаяСхемаXDTO);
	Декорация.Установить("picture", КартинкаЛегенда);
	Декорация.Установить("picturePlacement", ПоложениеКартинкиЭлементаГрафическойСхемы.Центр);
	
	Возврат СериализаторXDTO.ПрочитатьXDTO(ГрафическаяСхемаXDTO);
	
КонецФункции

Функция Картинка(ИмяМакета)
	
	ТипКартинкаXDTO = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/ui", "Picture");
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПолучитьМакет(ИмяМакета).ПолучитьТекст());
	
	Возврат ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON, ТипКартинкаXDTO);
	
КонецФункции

Функция НайтиЭлементГрафическойСхемыXDTOПоИмени(ГрафическаяСхемаXDTO, Имя)
	
	Для Каждого Элемент Из ГрафическаяСхемаXDTO.item Цикл
		
		Если Элемент.itemCode = Имя Тогда
			Возврат Элемент;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДекорацияПодсветкаРазличия(ГрафическаяСхема, ГрафическаяСхемаXDTO)
	
	Возврат НайтиЭлементГрафическойСхемыXDTOПоИмени(ГрафическаяСхемаXDTO, "ПодсветкаРазличия");
	
КонецФункции

Функция ДекорацияЛегендаЦветныеБлоки(ГрафическаяСхема, ГрафическаяСхемаXDTO, ИмяМакета)
	
	Возврат НайтиЭлементГрафическойСхемыXDTOПоИмени(ГрафическаяСхемаXDTO, "ЛегендаЦветныеБлоки");
	
КонецФункции

Процедура ПодсветитьРасхождения(ЭлементыСхемы, Показатели, ПроверяемыеБлоки, ПараметрыОтчета)
	
	ЭлементыРасхождений = Новый Массив;
	
	ДополнитьЭлементыРасхождений(ЭлементыРасхождений, ЭлементыСхемы, Показатели, ПроверяемыеБлоки, ПараметрыОтчета);
	
	ОтобразитьПодсветкуРасхождений(ЭлементыРасхождений, ЭлементыСхемы, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ДополнитьЭлементыРасхождений(ЭлементыРасхождений, ЭлементыСхемы, Показатели, ПроверяемыеБлоки, ПараметрыОтчета)
	
	ПрименяютсяПостоянныеРазницы = УчетПостоянныхРазниц(ПараметрыОтчета);
	
	Для Каждого ПроверяемыйБлок Из ПроверяемыеБлоки Цикл
		
		СуммаБУ = СуммовоеЗначениеПоказателя(Показатели, ПроверяемыйБлок.Ключ + "БУ");
		СуммаНУ = СуммовоеЗначениеПоказателя(Показатели, ПроверяемыйБлок.Ключ + "НУ");
		
		Если Не ПрименяютсяПостоянныеРазницы Тогда
			
			Если СуммаБУ = СуммаНУ Тогда
				Продолжить;
			КонецЕсли;
			
		Иначе
			
			СуммаПР = СуммовоеЗначениеПоказателя(Показатели, ПроверяемыйБлок.Ключ + "ПР");
			СуммаВР = СуммовоеЗначениеПоказателя(Показатели, ПроверяемыйБлок.Ключ + "ВР");
			
			Контроль = СуммаБУ - СуммаНУ - СуммаПР - СуммаВР;
			
			Если Контроль > -10 И Контроль < 10 Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ЭлементыРасхождений.Добавить(ЭлементыСхемы[ПроверяемыйБлок.Значение]);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтобразитьПодсветкуРасхождений(ЭлементыРасхождений, ЭлементыСхемы, ПараметрыОтчета)
	
	Если УчетПостоянныхРазниц(ПараметрыОтчета) Тогда
		
		Если ЗначениеЗаполнено(ЭлементыРасхождений) Тогда
			
			ТревожныйЦвет = WebЦвета.Красный;
			
			// Легенда
			ЭлементыСхемы.ПодсветкаРазличия.ЦветРамки 	= ТревожныйЦвет;
			ЭлементыСхемы.ПодсветкаРазличия.Фигура		= ФигурыГрафическойСхемы.Блок;
			ЭлементыСхемы.ЛегендаРазличия.Наименование	= НСтр("ru = 'Не выполняется правило БУ = НУ + ПР + ВР'");
			
			// Рамки
			Для Каждого БлокПоказателей Из ЭлементыРасхождений Цикл
				БлокПоказателей.ЦветРамки 	= ТревожныйЦвет;
				БлокПоказателей.Фигура		= ФигурыГрафическойСхемы.Блок;
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ЭлементыРасхождений) Тогда
			ЭлементыСхемы.ЛегендаРазличия.Наименование = НСтр("ru = 'Отличается сумма бухгалтерского и налогового учета'");
			ЭлементыСхемы.ЛегендаРазличия.Шрифт        = Новый Шрифт(ЭлементыСхемы.ЛегендаРазличия.Шрифт, , 7);
		Иначе
			ЭлементыСхемы.ПодсветкаРазличия.Картинка = Новый Картинка;
		КонецЕсли;
			
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ЗапросыГрафическойСхемы

Процедура НастроитьПоляРазницТекстаЗапроса(ТекстЗапроса, НаборыПолей, ПараметрыОтчета)
	
	Если УчетПостоянныхРазниц(ПараметрыОтчета) Тогда
		Возврат;
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Суффиксы = Новый Структура;
	Суффиксы.Вставить("БУ");
	Суффиксы.Вставить("НУ");
	Суффиксы.Вставить("ПР");
	Суффиксы.Вставить("ВР");
	
	ИменаПолей = Новый Структура; // в именах полей запросов есть ошибки в регистре букв, поэтому используется Структура
	Для Каждого ИмяНабора Из НаборыПолей Цикл
		
		Для Каждого Суффикс Из Суффиксы Цикл
			
			ИмяПоля = ИмяНабора + Суффикс.Ключ;
			
			ОписаниеПоля = Новый Структура;
			ОписаниеПоля.Вставить("ИмяНабора", ИмяНабора);
			ОписаниеПоля.Вставить("Суффикс",   Суффикс.Ключ);
			
			ИменаПолей.Вставить(ИмяПоля, ОписаниеПоля);
			
		КонецЦикла;
			
	КонецЦикла;
	
	КолонкиЗапроса = Новый Соответствие; // Ключ - имя набора полей, Значение - структура, где Ключ - "БУ,НУ,ПР,ВР", значение - ссылка на колонку
	
	Для Каждого ОписаниеЗапроса Из СхемаЗапроса.ПакетЗапросов Цикл
		
		Если ТипЗнч(ОписаниеЗапроса) <> Тип("ЗапросВыбораСхемыЗапроса") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ОписаниеЗапроса.ТаблицаДляПомещения) Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоКолонок = ОписаниеЗапроса.Колонки.Количество();
		Для НомерСКонца = 1 По КоличествоКолонок Цикл
			
			Индекс = КоличествоКолонок - НомерСКонца;
			ОписаниеКолонки = ОписаниеЗапроса.Колонки[Индекс];
			
			Если Не ИменаПолей.Свойство(ОписаниеКолонки.Псевдоним) Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеПоля = ИменаПолей[ОписаниеКолонки.Псевдоним];
			
			// Поле ВР не используем
			Если ОписаниеПоля.Суффикс = "ВР" Тогда
				ОписаниеЗапроса.Колонки.Удалить(Индекс);
				Продолжить;
			КонецЕсли;
			
			// Ссылки на остальные поля сохраним
			ОписаниеНабораПолей = КолонкиЗапроса[ОписаниеПоля.ИмяНабора];
			
			Если ОписаниеНабораПолей = Неопределено Тогда
				ОписаниеНабораПолей = ОбщегоНазначения.СкопироватьРекурсивно(Суффиксы);
				КолонкиЗапроса.Вставить(ОписаниеПоля.ИмяНабора, ОписаниеНабораПолей);
			КонецЕсли;
			
			ОписаниеНабораПолей[ОписаниеПоля.Суффикс] = ОписаниеКолонки;
			
		КонецЦикла;
		
		// В поле ПР выводим разность полей БУ и НУ
		Для Каждого ОператорЗапроса Из ОписаниеЗапроса.Операторы Цикл
			
			Для Каждого ОписаниеНабораПолей Из КолонкиЗапроса Цикл
				
				Если ОписаниеНабораПолей.Значение.ПР = Неопределено Тогда
					Продолжить;
				КонецЕсли;
					
				Если ОписаниеНабораПолей.Значение.БУ <> Неопределено Тогда
					ИндексПоля = ОписаниеЗапроса.Колонки.Индекс(ОписаниеНабораПолей.Значение.БУ);
					ВыражениеБУ = Строка(ОператорЗапроса.ВыбираемыеПоля[ИндексПоля]);
				Иначе
					ВыражениеБУ = Новый ВыражениеСхемыЗапроса("0");
				КонецЕсли;
				
				Если ОписаниеНабораПолей.Значение.НУ <> Неопределено Тогда
					ИндексПоля = ОписаниеЗапроса.Колонки.Индекс(ОписаниеНабораПолей.Значение.НУ);
					ВыражениеНУ = Строка(ОператорЗапроса.ВыбираемыеПоля[ИндексПоля]);
				Иначе
					ВыражениеНУ = Новый ВыражениеСхемыЗапроса("0");
				КонецЕсли;
				
				ВыражениеПР = СтрШаблон("%1 - %2", ВыражениеБУ, ВыражениеНУ);
				
				ИндексПоля = ОписаниеЗапроса.Колонки.Индекс(ОписаниеНабораПолей.Значение.ПР);
				ОператорЗапроса.ВыбираемыеПоля.Установить(ИндексПоля, Новый ВыражениеСхемыЗапроса(ВыражениеПР));
					
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецПроцедуры

Функция УчетПостоянныхРазниц(ПараметрыОтчета)
	
	ВидИспользованияСумм = БухгалтерскийУчет.ИспользоватьСуммыНалогНаПрибыль(
							ПараметрыОтчета.ОрганизацияРасшифровки, ПараметрыОтчета.КонецПериода);
	Возврат БухгалтерскийУчетКлиентСервер.ИспользоватьСуммыРазниц(ВидИспользованияСумм);
	
КонецФункции

Функция ПоказателиСтраницы(РезультатЗапроса)
	
	Показатели = Новый Структура;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Для Каждого ОписаниеКолонки Из РезультатЗапроса.Колонки Цикл
		Показатели.Вставить(ОписаниеКолонки.Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Показатели, Выборка);
	
	Возврат Показатели;
	
КонецФункции

Функция СуммовоеЗначениеПоказателя(Показатели, Имя)
	
	Если Не Показатели.Свойство(Имя) Тогда
		Возврат 0;
	КонецЕсли;
	
	Значение = Показатели[Имя];
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Окр(Значение, 2);
	
КонецФункции

Процедура УстановитьПоказатели(ГрафическаяСхема, ПоказателиСтраницы)
	
	Для Каждого ЭлементСхемы Из ГрафическаяСхема.ЭлементыГрафическойСхемы Цикл
		
		Если Не ПоказателиСтраницы.Свойство(ЭлементСхемы.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеПоказателя = ПоказателиСтраницы[ЭлементСхемы.Имя];
			
		Если ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
			
			Если ТипЗнч(ЗначениеПоказателя) = Тип("Число") Тогда
				ПредставлениеПоказателя = Формат(ЗначениеПоказателя, ФорматнаяСтрокаСумм());
			Иначе
				ПредставлениеПоказателя = ЗначениеПоказателя;
			КонецЕсли;
			
		Иначе
			
			ПредставлениеПоказателя = "";
			
		КонецЕсли;
		
		ЭлементСхемы.Наименование = ПредставлениеПоказателя;
				
	КонецЦикла;
	
КонецПроцедуры

Функция ФорматнаяСтрокаСумм()
	
	Возврат "ЧЦ=20; ЧДЦ=0; ЧРГ=' '";
	
КонецФункции

#КонецОбласти

#Область Расшифровки

Процедура ВыполнитьОбщиеНастройкиСхемыКомпоновкиДанныхРасшифровки(СхемаКомпоновкиДанных)
	
	// В схеме заданы только те параметры, которые действительно отличаются от схемы к схеме.
	// Общие для всех свойства дополнительно устанавливаются здесь.
	
	// 1. Не используем макеты, заданные в схеме
	СхемаКомпоновкиДанных.Макеты.Очистить();
	СхемаКомпоновкиДанных.МакетыГруппировок.Очистить();
	СхемаКомпоновкиДанных.МакетыЗаголовковГруппировок.Очистить();
	СхемаКомпоновкиДанных.МакетыПолей.Очистить();
	СхемаКомпоновкиДанных.МакетыПолейИтога.Очистить();
	
	МакетОбъединенныйЗаголовок = СхемаКомпоновкиДанных.МакетыГруппировок.Добавить();
	МакетОбъединенныйЗаголовок.ИмяГруппировки = "ОбъединенныйЗаголовок";
	МакетОбъединенныйЗаголовок.Макет          = МакетОбъединенныйЗаголовок.ИмяГруппировки;
	МакетОбъединенныйЗаголовок.ТипМакета      = ТипМакетаОбластиКомпоновкиДанных.Заголовок;
	
	СхемаКомпоновкиДанных.Макеты.Добавить().Имя = МакетОбъединенныйЗаголовок.ИмяГруппировки;
	
	// 2. Установим заголовки и оформление стандартных полей
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("СуммаБУ",  НСтр("ru = 'БУ'"));
	Заголовки.Вставить("СуммаНУ",  НСтр("ru = 'НУ'"));
	Заголовки.Вставить("СуммаПР",  НСтр("ru = 'ПР'"));
	Заголовки.Вставить("СуммаВР",  НСтр("ru = 'ВР'"));
	Заголовки.Вставить("Контроль", НСтр("ru = 'Контроль'"));
	
	Для Каждого НаборДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		
		Если ТипЗнч(НаборДанных) <> Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Поле Из НаборДанных.Поля Цикл
			
			Если ТипЗнч(Поле) <> Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаголовокПоля = Заголовки[Поле.ПутьКДанным];
			Если ЗаголовокПоля = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Поле.Заголовок = ЗаголовокПоля;
			
			УстановитьОформлениеРесурса(Поле.Оформление);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// 3. Вычисляемое поле и ресурс СверкаНУ
	ВычисляемоеПоле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Добавить();
	ВычисляемоеПоле.Выражение   = "СуммаБУ - СуммаНУ";
	ВычисляемоеПоле.Заголовок   = НСтр("ru = 'Разница'");
	ВычисляемоеПоле.ПутьКДанным = "СверкаНУ";
	УстановитьОформлениеРесурса(ВычисляемоеПоле.Оформление);
	
	Ресурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	Ресурс.ПутьКДанным = "СверкаНУ";
	Ресурс.Выражение   = "Сумма(СверкаНУ)";
	
	// 4. Настройки
	
	Для Каждого ВариантНастройки Из СхемаКомпоновкиДанных.ВариантыНастроек Цикл
		
		ВариантНастройки.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра(
			"ВертикальноеРасположениеОбщихИтогов",
			РасположениеИтоговКомпоновкиДанных.Конец);

		Группировки = НайтиГруппировки(ВариантНастройки.Настройки.Структура);
		
		// Строки
		Таблица = ВариантНастройки.Настройки.Структура.Добавить(Тип("ТаблицаКомпоновкиДанных"));
		НовыйУровеньСтруктуры = Таблица.Строки;
		Для Каждого Группировка Из Группировки Цикл
			
			НоваяГруппировка = НовыйУровеньСтруктуры.Добавить();
			НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			
			ПолеГруппировки = Неопределено;
			
			Для Каждого ПолеГруппировки Из Группировка.ПоляГруппировки.Элементы Цикл
				
				Если ТипЗнч(ПолеГруппировки) <> Тип("ПолеГруппировкиКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				НовоеПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовоеПолеГруппировки, ПолеГруппировки);
				
			КонецЦикла;
			
			Группировка.Использование = Ложь;
			
			Если НовоеПолеГруппировки <> Неопределено Тогда
				ВыбранноеПолеГруппировки = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ВыбранноеПолеГруппировки.Поле = НовоеПолеГруппировки.Поле;
			КонецЕсли;
			
			НовыйУровеньСтруктуры = НоваяГруппировка.Структура;
			
		КонецЦикла;
		
		// Отображение итогов
		Если ЗначениеЗаполнено(Таблица.Строки) Тогда
			ПерваяГруппировка = Таблица.Строки[0];
			ПерваяГруппировка.ПараметрыВывода.УстановитьЗначениеПараметра(
				"ВыводитьОтбор",
				ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
		КонецЕсли;
			
		
		// Колонка
		Колонка = Таблица.Колонки.Добавить();
		Для Каждого Ресурс Из СхемаКомпоновкиДанных.ПоляИтога Цикл
			ВыбранноеПолеРесурса = Колонка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПолеРесурса.Поле = Новый ПолеКомпоновкиДанных(Ресурс.ПутьКДанным);
		КонецЦикла;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьОформлениеРесурса(Оформление)
	
	ШиринаПоля = 19;
	
	Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина",  ШиринаПоля);
	Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", ШиринаПоля);
	Оформление.УстановитьЗначениеПараметра("Формат",             "ЧДЦ=2");
	
КонецПроцедуры

Функция НайтиГруппировки(Структура)
	
	Группировки = Новый Массив;
	
	Для Каждого Группировка Из Структура Цикл
		
		Если ТипЗнч(Группировка) <> Тип("ГруппировкаКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Группировки.Добавить(Группировка);
		
		СледующийУровень = НайтиГруппировки(Группировка.Структура);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Группировки, СледующийУровень);
		
	КонецЦикла;
	
	Возврат Группировки;
	
КонецФункции

Процедура НастроитьИспользованиеКолонок(КомпоновщикНастроек, ПараметрыОтчета)
	
	ИспользованиеКолонок = Новый Соответствие;
	
	УчетРазниц = УчетПостоянныхРазниц(ПараметрыОтчета);
	
	ИспользованиеКолонок.Вставить("СуммаПР",  УчетРазниц);
	ИспользованиеКолонок.Вставить("СуммаВР",  УчетРазниц);
	ИспользованиеКолонок.Вставить("Контроль", УчетРазниц);
	ИспользованиеКолонок.Вставить("СверкаНУ", Не УчетРазниц);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Направление", "Колонки");
	
	Колонки = Новый Массив;
	БухгалтерскиеОтчеты.НайтиГруппировкиТаблицы(Колонки, КомпоновщикНастроек.Настройки.Структура, Отбор);
	
	Для Каждого Колонка Из Колонки Цикл
		
		Для Каждого ВыбранноеПоле Из Колонка.Выбор.Элементы Цикл
			
			Использование = ИспользованиеКолонок[Строка(ВыбранноеПоле.Поле)];
			Если Использование = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ВыбранноеПоле.Использование = Использование;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапретитьРасчетНедоступныхПолей(СхемаКомпоновкиДанных, ПараметрыОтчета)
	
	Если УчетПостоянныхРазниц(ПараметрыОтчета) Тогда
		Возврат;
	КонецЕсли;
	
	// Запретим расчет полей, значения которых не могут быть показаны пользователю
	ЗапрещенныеПоля = Новый Массив;
	ЗапрещенныеПоля.Добавить("СуммаВР");
	ЗапрещенныеПоля.Добавить("СуммаПР");
	ЗапрещенныеПоля.Добавить("Контроль");
	
	Для Каждого ИмяЗапрещенногоПоля Из ЗапрещенныеПоля Цикл
		
		ЗапрещенноеПоле = СхемаКомпоновкиДанных.ПоляИтога.Найти(ИмяЗапрещенногоПоля);
		Если ЗапрещенноеПоле = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗапрещенноеПоле.Выражение = "0";
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоРасшифровкаСМакетами(ИмяРасшифровки)
	
	// Некоторые отчеты для расшифровки содержат несколько последовательных групп показателей
	// со своими заголовками, сделанными в виде макетов.
	// Их нельзя обработать в общем порядке.
	
	Возврат ИмяРасшифровки = "РасшифровкаДоходыУчитываемыеПриОпределенииНалоговойБазы"
		Или ИмяРасшифровки = "РасшифровкаКосвенныеРасходы"
		Или ИмяРасшифровки = "РасшифровкаПрямыеПроизводственныеРасходы"
		Или ИмяРасшифровки = "РасшифровкаТранспортныхРасходов";
	
КонецФункции

#КонецОбласти

#КонецЕсли
