
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("ИзмененоСостояниеОбъекта", (НЕ ЭтоНовый() и НЕ ПометкаУдаления = Ссылка.ПометкаУдаления));
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.ИзмененоСостояниеОбъекта Тогда 
		ОбработатьСобственниковОбъектовНедвижимости();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьСобственниковОбъектовНедвижимости()
		 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АР_СобственникиОбъектовАренды.Собственник КАК Собственник
		|ИЗ
		|	РегистрСведений.АР_СобственникиОбъектовАренды КАК АР_СобственникиОбъектовАренды
		|ГДЕ
		|	АР_СобственникиОбъектовАренды.ОбъектАренды = &ОбъектАренды
		|
		|СГРУППИРОВАТЬ ПО
		|	АР_СобственникиОбъектовАренды.Собственник";
	
	Запрос.УстановитьПараметр("ОбъектАренды", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СосбвенникОбъект = ВыборкаДетальныеЗаписи.Собственник.ПолучитьОбъект();
		СосбвенникОбъект.ПометкаУдаления = ПометкаУдаления;
		СосбвенникОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

