
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Наименование");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ПредставленияОбщихДанных.ОбработкаПолученияДанныхВыбора(
		Справочники.ОснованияУвольнения, 
		ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

#КонецЕсли

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ПредставленияОбщихДанныхВызовСервера.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Процедура выполняет первоначальное заполнение статей ТК - оснований увольнения.
Процедура НачальноеЗаполнение() Экспорт
	
	ЗагрузитьКлассификатор();
	
КонецПроцедуры

Процедура ЗагрузитьКлассификатор() Экспорт
	
	ОбновитьСтатьиУвольненияУмершихСотрудников();
	
	КадровыйУчет.ЗаполнитьКлассификаторОснованийУвольнения(
		Метаданные.Справочники.ОснованияУвольнения.Имя,
		ПолучитьМакет("ОснованияУвольненияПоТКРФ"));
	
КонецПроцедуры

Процедура ОбновитьСтатьиУвольненияУмершихСотрудников()
	
	КадровыйУчет.УстановитьИмяПредопределенногоОснованиюУвольнения(
		Метаданные.Справочники.ОснованияУвольнения.Имя, "Статья83ч1п6", НСтр("ru = 'п. 6 ч. 1 ст. 83'"));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли