
Процедура ПередЗаписью(Отказ)
	
	Если Собственники.Количество() = 1 Тогда 
		ПредставлениеСобственника = Собственники[0].Собственник;
		Собственники[0].Доля = 100;
	Иначе 
		ПредставлениеСобственника = "";
		Для Каждого СтрокаТаблицы из Собственники Цикл 
			ПредставлениеСобственника = ПредставлениеСобственника + СокрЛП(СтрокаТаблицы.Собственник.Наименование) + " (" + Формат(СтрокаТаблицы.Доля, "ЧГ=0") + "%)" + Символы.ПС;
		КонецЦикла;
		
		ПредставлениеСобственника = СокрЛП(ПредставлениеСобственника);
		
	КонецЕсли;	
		
КонецПроцедуры
