#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает состояние чека, соответствующее строковому статусу.
//
// Параметры:
//   СтатусЧека - Строка - строковое значение статуса чека.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СостоянияЧековНПД
//
Функция СостояниеЧекаПоСтатусу(СтатусЧека) Экспорт
	
	СтатусыЧеков = ИнтеграцияСПлатформойСамозанятыеКлиентСервер.СтатусыЧеков();
	
	Если ВРег(СтатусЧека) = ВРег(СтатусыЧеков.Зарегистрирован) Тогда
		
		Возврат Зарегистрирован;
		
	ИначеЕсли ВРег(СтатусЧека) = ВРег(СтатусыЧеков.ВыполняетсяРегистрация) Тогда
		
		Возврат ВыполняетсяРегистрация;
		
	ИначеЕсли ВРег(СтатусЧека) = ВРег(СтатусыЧеков.ОшибкаПриРегистрации) Тогда
		
		Возврат ОшибкаПриРегистрации;
		
	ИначеЕсли ВРег(СтатусЧека) = ВРег(СтатусыЧеков.ОжидаетОтправкиВФНС) Тогда
		
		Возврат ОжидаетОтправкиВФНС;
		
	ИначеЕсли ВРег(СтатусЧека) = ВРег(СтатусыЧеков.Аннулирован) Тогда
		
		Возврат Аннулирован;
		
	ИначеЕсли ВРег(СтатусЧека) = ВРег(СтатусыЧеков.ВыполняетсяАннулирование) Тогда
		
		Возврат ВыполняетсяАннулирование;
		
	ИначеЕсли ВРег(СтатусЧека) = ВРег(СтатусыЧеков.ОшибкаПриАннулировании) Тогда
		
		Возврат ОшибкаПриАннулировании;
		
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
