
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", ЭтоПостояннаяЧасть);
		ПараметрыФормы.Вставить("ДокументВладелец", ДокументВладелец);
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);

		ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы);
		ФормаГрафика.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ЭтоПостояннаяЧасть", ЭтоПостояннаяЧасть);
	Параметры.Свойство("ДокументВладелец", ДокументВладелец);
	Параметры.Свойство("Услуга", Услуга);
	Параметры.Свойство("ОбъектАренды", ОбъектАренды);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЭтоПостояннаяЧасть", ЭтоПостояннаяЧасть);
	ПараметрыФормы.Вставить("ДокументВладелец", ДокументВладелец);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);

	ФормаГрафика = ПолучитьФорму("Справочник.АР_ГрафикиИзмененияСтавокНаУслуги.ФормаОбъекта", ПараметрыФормы, Элемент);
	ФормаГрафика.Объект.Владелец = АР_ОбщиеПроцедуры.ЗначениеРеквизитаОбъекта(ДокументВладелец, "ДоговорКонтрагента");
	ФормаГрафика.Объект.Документ = ДокументВладелец;
	ФормаГрафика.Объект.Наименование = "График изменения ставок по услуге """ + Услуга + """ и объекту """ + ОбъектАренды + """";
	
	Если Копирование Тогда
		ПолучитьГрафикСтавокНаСервере(ТекущиеДанные.Ссылка);
		Для Каждого Строк Из ГрафикСтавок Цикл
			Стр = ФормаГрафика.Объект.ГрафикСтавок.Добавить();
			Стр.Дата = Строк.Дата;
			Стр.Ставка = Строк.Ставка;
		КонецЦикла;
	КонецЕсли;
	
	ФормаГрафика.ЗакрыватьПриВыборе = Ложь;
	ФормаГрафика.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьГрафикСтавокНаСервере(Ссылка)
	
	ГрафикСтавок.Очистить();
	Для Каждого Строк Из Ссылка.ГрафикСтавок Цикл
		Стр = ГрафикСтавок.Добавить();
		Стр.Дата = Строк.Дата;
		Стр.Ставка = Строк.Ставка;
	КонецЦикла;
	
КонецПроцедуры
