
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦветСтиляПоясняющийОшибкуТекст 	= ЦветаСтиля.ПоясняющийОшибкуТекст;
	ЦветСтиляИнформационнойНадписи  = ЦветаСтиля.ТекстИнформационнойНадписи;
	ОбновитьЭУОтветственный(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ФизическиеЛица" И Источник = Ответственный Тогда
		ЗаполнитьРеквизитыОтветственного(Ответственный, Логин, ЭлектроннаяПочта, МобильныйТелефон, Пол);
		ОбновитьЭУОтветственный(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыОтветственного(Ответственный, Логин, ЭлектроннаяПочта, МобильныйТелефон, Пол);
	ОбновитьЭУОтветственный(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Отказ = Ложь;
	Если ЕстьОшибкиЗаполнения() Тогда
		Отказ = Истина;
	Иначе
		Результат = РезультатРедактирования();
	КонецЕсли;
	
	Если Не Отказ Тогда
		Закрыть(Результат);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУОтветственный(Форма)
	
	Элементы = Форма.Элементы;
	Форма.ДанныеОтветственногоЗаполнены = Ложь;
	
	Если Не ЗначениеЗаполнено(Форма.Ответственный) Тогда
		Элементы.ДекорацияТелефонПочтаОтветственного.Заголовок = "";
		Элементы.ДекорацияРеквизитыОтветственногоПояснение.Заголовок = "";
		Элементы.ДекорацияРеквизитыОтветственногоПояснение.ЦветТекста = Форма.ЦветСтиляИнформационнойНадписи;
	Иначе
		
		ТелефонУказан = Ложь;
		ТелефонСоответствуетТребованиям = Ложь;
		Если ЗначениеЗаполнено(Форма.МобильныйТелефон) Тогда
			СтрокаТелефон = СОКРЛП(Форма.МобильныйТелефон);
			ТелефонУказан = Истина;
			ТелефонСоответствуетТребованиям = (Лев(СтрокаТелефон,1) = "+");
		Иначе
			СтрокаТелефон = НСтр("ru = '<телефон не указан>'");
		КонецЕсли;
		
		ПочтаУказана = Ложь;
		ПочтаСоответствуетТребованиям = Ложь;
		Если ЗначениеЗаполнено(Форма.ЭлектроннаяПочта) Тогда
			СтрокаПочта = СОКРЛП(Форма.ЭлектроннаяПочта);
			ПочтаУказана = Истина;
			ПочтаСоответствуетТребованиям = ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Форма.ЭлектроннаяПочта);
		Иначе
			СтрокаПочта = НСтр("ru = '<Email не указан>'");
		КонецЕсли;
		
		СтрокаТелефонПочта = СтрШаблон(НСтр("ru = 'Мобильный телефон и почта: %1, %2'"), СтрокаТелефон, СтрокаПочта);
		Элементы.ДекорацияТелефонПочтаОтветственного.Заголовок = СтрокаТелефонПочта;
		
		Если ТелефонУказан И ТелефонСоответствуетТребованиям И ПочтаУказана И ПочтаСоответствуетТребованиям И ЗначениеЗаполнено(Форма.Пол) Тогда
			Элементы.ДекорацияРеквизитыОтветственногоПояснение.ЦветТекста = Форма.ЦветСтиляИнформационнойНадписи;
			Элементы.ДекорацияРеквизитыОтветственногоПояснение.Заголовок = НСтр("ru = 'Убедитесь в том, что у ответственного лица задан действующий мобильный телефон и адрес электронной почты'");
			Форма.ДанныеОтветственногоЗаполнены = Истина;
		Иначе
			
			Если ТелефонУказан И ТелефонСоответствуетТребованиям И ПочтаУказана И ПочтаСоответствуетТребованиям Тогда
				СообщениеОбОшибке =НСтр("ru = 'Заполните, пожалуйста, пол ответственного'");
			Иначе
				
				СообщениеНеУказанПол = "";
				Если Не ЗначениеЗаполнено(Форма.Пол) Тогда
					СообщениеНеУказанПол = НСтр("ru = ', не указан пол'");
				КонецЕсли;
				
				СообщениеПочтаСоответствуетТребованиям = "";
				Если ПочтаУказана И Не ПочтаСоответствуетТребованиям Тогда
					СообщениеПочтаСоответствуетТребованиям = НСтр("ru = ', адрес электронной почты указан некорректно'");
				КонецЕсли;
				
				СообщениеТелефонСоответствуетТребованиям = "";
				Если ТелефонУказан И Не ТелефонСоответствуетТребованиям Тогда
					СообщениеТелефонСоответствуетТребованиям = НСтр("ru = ', номер телефон должен начинаться с символа ""+""'");
				КонецЕсли;
				
				СообщениеОбОшибке = СтрШаблон(
					НСтр("ru = 'Заполните, пожалуйста, контактные данные ответственного%1%2%3'"),
					СообщениеТелефонСоответствуетТребованиям,
					СообщениеПочтаСоответствуетТребованиям,
					СообщениеНеУказанПол);
				
			КонецЕсли;
			
			Элементы.ДекорацияРеквизитыОтветственногоПояснение.ЦветТекста = Форма.ЦветСтиляПоясняющийОшибкуТекст;
			Элементы.ДекорацияРеквизитыОтветственногоПояснение.Заголовок = СообщениеОбОшибке;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыОтветственного(Ответственный, Логин, ЭлектроннаяПочта, МобильныйТелефон, Пол)
	
	Логин 			 = "";
	ЭлектроннаяПочта = "";
	МобильныйТелефон = "";
	Пол = Перечисления.ПолФизическогоЛица.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОбъекта =  ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ответственный, "Фамилия,Инициалы,Пол");
	Пол = РеквизитыОбъекта["Пол"];
	Инициалы = СтрЗаменить(РеквизитыОбъекта["Инициалы"],".","");
	Инициалы = СтрЗаменить(Инициалы," ","");
	Логин = СтрШаблон("%1%2", РеквизитыОбъекта["Фамилия"], Инициалы);
	
	ВидыКонтактнойИнформации = Новый Массив;
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	ВидыКонтактнойИнформации.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
								ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответственный),,ВидыКонтактнойИнформации);
	Для каждого СтрокаТЗ Из КонтактнаяИнформация Цикл
		Если СтрокаТЗ.Вид = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица Тогда
			ЭлектроннаяПочта = СтрокаТЗ.Представление;
		ИначеЕсли СтрокаТЗ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица Тогда
			МобильныйТелефон = СтрокаТЗ.Представление;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция РезультатРедактирования()

	Результат = Новый Структура();
	Результат.Вставить("ИмяПриложения", 	ИмяПриложения);
	Результат.Вставить("Ответственный", 	Ответственный);
	Результат.Вставить("Логин", 			Логин);
	Результат.Вставить("МобильныйТелефон", 	МобильныйТелефон);
	Результат.Вставить("ЭлектроннаяПочта", 	ЭлектроннаяПочта);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ЕстьОшибкиЗаполнения()

	Если ЗначениеЗаполнено(Ответственный) И Не ДанныеОтветственногоЗаполнены Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции


#КонецОбласти